Arquivotheca/SunOS-4.1.3/man/man5/bar.5
.\" @(#)bar.5 1.1 92/07/30 SMI; from UCB 4.2
.TH BAR 5 "19 February 1988"
.SH NAME
bar \- tape archive file format
.SH DESCRIPTION
.IX  "bar file"  ""  "\fLbar\fR \(em tape archive file format"
.LP
.BR bar (1),
(the tape archive command)
dumps several files into one, in a medium suitable for transportation.
This format is not compatible with the format generated by 
.BR tar (1).
.LP
A 
.I bar tape
or file is a series of blocks.
Each block is of size
.BR \s-1TBLOCK\s0.
A file on the tape is represented by a header block that describes
the file, followed by zero or more blocks that give the contents of the
file.
At the end of the tape are two blocks filled with binary
zeros, as an
.SM EOF
indicator.
.LP
The blocks are grouped for physical I/O operations.
Each group of
.I n
blocks (where
.I n
is set by the 
.B b
keyletter on the 
.BR bar (1)
command line \(em default is 20 blocks) is written with a single system
call; on nine-track tapes, the result of this write is a single tape
record.
The last group is always written at the full size, so blocks after
the two zero blocks contain random data.
On reading, the specified or
default group size is used for the
first read, but if that read returns less than a full tape block, the reduced
block size is used for further reads, unless the
.B B
keyletter is used.
.LP
The header block looks like:
.RS
.nf
.ft B
#define \s-1TBLOCK\s0	512
.sp .5
union hblock {
	char dummy[\s-1TBLOCK\s0];
	struct header {
		char mode[8];
		char uid[8];
		char gid[8];
		char size[12];
		char mtime[12];
		char chksum[8];
		char rdev[8];
		char linkflag;
		char bar_magic[2];
		char volume_num[4];
		char compressed;
		char date[12];
		char start_of_name;
	} dbuf;
};
.ft
.fi
.RE
.LP
.IR start_of_name
is a null-terminated string.
.IR date 
is the date of the archive.
.IR bar_magic
is a special number indicating that this is a 
.B bar 
archive.
.IR rdev
is the device type, for files that are devices.
The other fields are zero-filled octal numbers in
.SM ASCII\s0.
Each field
(of width w) contains w-2 digits, a space, and a null, except
.IR size ,
.IR rdev ,
and
.IR mtime ,
which do not contain the trailing null.
.I start_of_name
is the name of the file, as specified on the 
.I bar
command line.
Files dumped because they were in a directory that
was named in the command line have the directory name as prefix and
.BI / filename
as suffix.
.  \"Whatever format was used in the command line
.  \"will appear here, such as
.  \".I \&./yellow
.  \"or
.  \".IR \&../../brick/./road/.. .
.  \"To retrieve a file from a bar tape, an exact prefix match must be specified,
.  \"including all of the directory prefix information used on the command line
.  \"that dumped the file (if any).
.I mode
is the file mode, with the top bit masked off.
.I uid
and
.I gid
are the user and group numbers that own the file.
.I size
is the size of the file in bytes.
Links and symbolic links, and special
files, are dumped
with this field specified as zero.
.I mtime
is the modification time of the file at the time it was dumped.
.I chksum
is a decimal
.SM ASCII
value that represents the sum of all the bytes in the
header block.
When calculating the checksum, the 
.I chksum
field is treated as if it were all blanks.
.I linkflag
is
.SM ASCII
0
if the file is \*(lqnormal\*(rq or a special file,
1 if it is an hard link, 2
if it is a symbolic link, and
3 if it is a special file (device or
.SM FIFO\s0). 
The name linked-to, if any, is in
a null-terminated string, following 
.IR start_of_name .
Unused fields of the header are binary zeros (and are included in the
checksum).
.LP
The first time a given i-node number is dumped, it is dumped as a regular
file.
The second and subsequent times, it is dumped as a link instead.
Upon retrieval, if a link entry is retrieved, but not the file it was
linked to, an error message is printed and the tape must be manually
re-scanned to retrieve the linked-to file.
.LP
When the 
.B H
modifier is used with
.B bar ,
an additional header block (one that does not pertain to a particular
file) is written to the first block of each volume of the archive.
The 
header
.SM ID\s0,
as specified on the command line, is copied to 
.IR start_of_name .
The size reflects the number of bytes to skip to the start of
the first full file (always zero on the first volume).
.LP
The encoding of the header is designed to be portable across machines.
.SH "SEE ALSO"
.BR bar (1)
