Arquivotheca/SunOS-4.1.3/man/man5/bootservers.5
.\" @(#)bootservers.5 1.1 92/07/30 SMI;
.TH BOOTSERVERS 5 "25 September 1989"
.SH NAME
bootservers \- NIS bootservers file
.SH SYNOPSIS
.B /etc/bootservers
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX "bootservers" "" "\fLbootservers\fP\(em NIS bootservers file" ""
.LP
The
.B bootservers
file is an
.SM ASCII
file that resides in the
.B /etc
directory on the
Network Information Service
(\s-1NIS\s0)
master server.
The file contains basic information about each host
providing boot services for clients on the network.
This file contains a one-line entry
for each boot server, where each field
.I must
be separated by a
.SM TAB
character:
.LP
.if t .ti +.5i
.I "system\ \ type\ \ client_limit\ \ swap_size\ \ tmp_size\ \ root_minfree\ \ swap_minfree"
.LP
The entries in the file have the following descriptions:
.TP 1.0i
.I system
is the name of a boot server.
This field contains only lowercase and numeric
characters, must start with a lower-case character,
and must not be longer than 32 characters.
.TP
.I type
Currently, the only legal value is 3.
.TP
.I client_limit
indicates the maximum number of diskless clients the server is willing
to accept.
.TP
.I swap_size
default swap size per client (in kilobytes).
.TP
.I tmp_size
default tmp size per client (in kilobytes).
.TP
.I root_minfree
minimum amount of disk space in the server's client-root partition after a
client is added (in kilobytes).
.TP
.I swap_minfree
minimum amount of disk space in the server's client-swap partition after a
client is added (in kilobytes).
.SH EXAMPLE
.LP
Here is a sample
.B bootservers
file entry:
.RS
.ft B
.sp
.nf
polaris  3   2  16000   8000    40000   0
.fi
.sp
.ft R
.RE
.SH FILES
.PD 0
.TP 20
.B /etc/bootservers
.PD
.SH SEE ALSO
.TX ADMIN ,
.br
.I Sun386i Advanced Administration
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
