Arquivotheca/SunOS-4.1.3/man/man5/filetype.5
.if n .ds La '
.if n .ds Ra '
.if t .ds La `
.if t .ds Ra '
.if n .ds Lq "
.if n .ds Rq "
.if t .ds Lq ``
.if t .ds Rq ''
.de Ch
\\$3\\*(Lq\\$1\\*(Rq\\$2
..
.\" @(#)filetype.5 1.1 92/07/30 SMI;
.TH FILETYPE 5 "14 December 1990"
.SH NAME
filetype \- DeskSet binding database file
.SH SYNOPSIS
.B /etc/filetype
.SH DESCRIPTION
.LP
The
.B filetype
file is a database file used by both the OpenWindows
and SunView DeskSet tools.
.LP
The file describes bindings between types of files.  That is, it
contains entries defining what type of action should be done on a
type of file.  Specifically, it binds an icon and color to a file
type, and defines what method is used to invoke and print a given
filetype.
.LP
Files may be described in one of two ways: by a name pattern (such
as
.BR *.ras )
or by their magic number (as defined in the
.B /etc/magic
file).
.LP
.B /etc/filetype
is the system default database file created by 
running the
.B install_deskset
script (for the SunView DeskSet),
or
.B install_filemgr
script (for the OpenWindows DeskSet).
.LP
.B $HOME/.filetype
is the user's own personal binding database file,
which can be created and modified using the binder tool.
.LP
The DeskSet will first use the user's personal
.B $HOME/.filetype
file if it is found; else it will use the system defaults defined
in
.BR /etc/filetype .
These two files are mutually exclusive; entries
are not shared between them.
.LP
These files are not meant to be modified by hand; the DeskSet tool
binder should always be used to modify them.  Remember to
start the binder as root if you wish to modify the system's defaults
in
.BR /etc/filetype .
.SH FILES
.PD 0
.TP 25
.B /etc/magic
.TP
.B /etc/filetype
.TP
.B $HOME/.filetype
.PD
.SH NOTES
.LP
These files will only be used for SunView DeskSet 1.0 & 1.1 and
OpenWindows DeskSet 2.0.  A new way of storing and retrieving
binding information will be used in future OpenWindows DeskSet
tools.
