Arquivotheca/SunOS-4.1.3/man/man5/group.adjunct.5
.\" @(#)group.adjunct.5 1.1 92/07/30 SMI
.TH GROUP.ADJUNCT 5 "14 December 1987"
.SH NAME
group.adjunct \- group security data file
.SH SYNOPSIS
.B /etc/security/group.adjunct
.SH DESCRIPTION
.IX  "group.adjunct file"  ""  "\fLgroup.adjunct\fP \(em password file"
.LP
The
.B group.adjunct
file contains the following information for each group:
.IP
.IB groupname : password
.TP 20
.I groupname
The group's name in the system; it must be unique.
.TP
.I password
The encrypted password, formerly field two of the
.B /etc/group
file.
.LP
The
.B group.adjunct
file is in
.SM ASCII\s0.
Fields are separated by a colon,
and each group is separated from the next by a
.SM NEWLINE\s0.
.LP
A
.B group.adjunct
file can have a line beginning with a
.RB ` + '
(plus sign), which means to incorporate
entries from the 
Network Information Service
(\s-1NIS\s0).
There are two styles of
.RB ` + '
entries: all by itself,
.RB ` + '
means to insert the entire contents of the
.B group.adjunct
.SM NIS
file at that point;
.BI + name
means to insert the entry (if any) for
.I name
from the 
.SM NIS
service at that point.  If a
.RB ` + '
entry has a non-null
password, the contents of that field will override
what is contained in the 
.SM NIS
service.
.\" .SH EXAMPLE
.\" .LP
.\" Here is a sample
.\" .B /etc/security/group.adjunct
.\" file:
.\" .RS
.\" .LP
.\" .ft B
.\" .nf
.\" primary:q.mJzTnu8icF.
.\" tuttles:7\s-1KCFRPNVX\s0gfrw
.\" phish:7\s-1HU\s08\s-1RPNVX\s0ga9o
.\" reew:
.\" +:
.\" .fi
.\" .ft R
.\" .LP
.\" .RE
.\" The group security data file resides in the
.\" .B /etc/security
.\" directory.
.\" Because of the encrypted passwords,
.\" it does not have general read permission.
.SH FILES
.PD 0
.TP 20
.\" .B /etc/security/group.adjunct
.\" .TP
.B /etc/group
.\" .TP
.\" .B /etc/security
.PD
.SH "SEE ALSO"
.BR crypt (3),
.BR getgraent (3),
.BR getgrent (3V),
.BR group (5)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
