Arquivotheca/SunOS-4.1.3/man/man5/internat.5
.\" @(#)internat.5	1.1 92/07/30 SMI;
.TH INTERNAT 5 "19 February 1988"
.SH NAME
internat \- key mapping table for internationalization
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX internat "" "\fLinternat\fR \(em key mapping table for internationalization"
This file format is used for the file specified by the \-f option of
.BR old-setkeys (1).
.LP
The file has three columns.  First column is keytable identifier, one of:
.SM "BASE, CTRL, SHIFT, CAPS, UP, BASE_ISO, SHIFT_ISO or ALTG."
The second column is a decimal keystation number.
The third column is hexadecimal keytable entry value.
The file must end with line of "END, 0, 0".
As usual, comment lines start with #.
.SH EXAMPLES
This is the file for mapping keys to Canadian standards:
.LP
.in 10
.ft B
.nf
# /usr/lib/.setkeys: Key remapping, used by "setkeys remap"
#	
# First column is keytable identifier:
#		BASE, CTRL, SHIFT, CAPS, UP, BASE_ISO, SHIFT_ISO or ALTG
# Second column is decimal keystation number
# Third column is hexadecimal keytable entry value
# File must end with line of "END, 0, 0"
# Comment lines must start with #
#
#
# --- Keymaps for Canadian keyboard ---
# > Define Alt Graph key (SHIFTKEYS+ALTGRAPH=86)
BASE 119 86
CTRL 119 86
SHIFT 119 86
CAPS 119 86
UP 119 86
# > Define Caps key (SHIFTKEYS+CAPSLOCK=80)
BASE 13 80
CTRL 13 80
SHIFT 13 80
CAPS 13 80
# > Define Floating Accent keys
#		FA_UMLAUT = A9
#		FA_CFLEX = AA
#		FA_TILDE = AB
#		FA_CEDILLA = AC
#		FA_ACUTE = AD
#		FA_GRAVE = AE
BASE 64 AA
SHIFT 64 A9
CAPS 64 A9
BASE 65 AC
SHIFT 65 AB
CAPS 65 AB
BASE 87 AE
SHIFT 87 AD
CAPS 87 AD
# > Define ASCII values
BASE 88 5B
SHIFT 88 7B
CAPS 88 7B
BASE 15 5D
SHIFT 15 7D
CAPS 15 7D
SHIFT 31 22
SHIFT 32 2F
SHIFT 35 3F
SHIFT 107 27
CAPS 107 27
SHIFT 108 60
CAPS 108 60
BASE 124 3C
SHIFT 124 3E
CAPS 124 3E
# > Define ISO values
BASE_ISO 109 E9
SHIFT_ISO 109 C9
# > Define Alternate Graph ISO values
ALTG 88 AB
ALTG 15 BB
ALTG 30 B1
ALTG 31 B2
ALTG 32 B3
ALTG 33 A2
ALTG 34 A4
ALTG 35 5E
ALTG 36 40
ALTG 37 A3
ALTG 38 5C
ALTG 40 AC
ALTG 41 23
ALTG 63 B6
ALTG 64 BC
ALTG 65 BD
ALTG 42 BE
ALTG 106 B5
ALTG 105 BA
# > End of file
END 0 0
.ft
.fi
.in 0
.\" end of page
.SH SEE ALSO
.BR old-setkeys (1)
.LP
The
.I "Sun386i Developer's Guide"
for keystation number diagrams.
