Arquivotheca/SunOS-4.1.3/man/man5/keytables.5
.\" @(#)keytables.5 1.1 92/07/30 SMI
.TH KEYTABLES 5 "1 September 1988"
.SH NAME
keytables \- keyboard table descriptions for loadkeys and dumpkeys
.SH DESCRIPTION
.IX "keytables" "" "\fLkeytables\fR \(em keyboard table descriptions for loadkeys and dumpkeys" ""
.IX "loadkeys" "keyboard table descriptions" "\fLloadkeys\fR" "keyboard table descriptions"
.IX "dumpkeys" "keyboard table descriptions" "\fLdumpkeys\fR" "keyboard table descriptions"
.IX keyboard "table descriptions for loadkeys and dumpkeys" keyboard "table descriptions for \fLloadkeys\fR and \fLdumpkeys\fR"
.IX "translation tables"
.LP
These files are used by
.BR loadkeys (1)
to modify the translation tables used by the keyboard streams module
.BR kb (4M),
and generated by
.BR dumpkeys
(see
.BR loadkeys (1))
from those translation tables.
.LP
Any line in the file beginning with
.B #
is a comment, and is ignored.
.B #
is treated specially only at the beginning of a line.
.LP
Other lines specify the values to load into the tables for a particular
keystation.  The format is either:
.LP
.RS
.nf
.BI key " number list_of_entries"
.fi
.RE
.LP
or
.LP
.RS
.nf
.BI swap " number1" " with" " number2"
.fi
.RE
.LP
or
.LP
.RS
.nf
.BI key " number1" " same as" " number2"
.fi
.RE
.LP
or a blank line, which is ignored.
.LP
.RS
.nf
.BI key " number list_of_entries"
.fi
.RE
.LP
sets the entries for keystation
.I number
from the list given.  An entry in that list is of the form
.LP
.RS
.nf
.I "tablename code"
.fi
.RE
.LP
where
.I tablename
is the name of a particular translation table, or
.BR all .
The translation tables are:
.RS
.TP
.B base
entry when no shifts are active
.TP
.B shift
entry when "Shift" key is down
.TP
.B
caps
entry when "Caps Lock" is in effect
.TP
.B ctrl
entry when "Control" is down
.TP
.B altg
entry when "Alt Graph" is down
.TP
.B numl
entry when "Num Lock" is in effect
.TP
.B up
entry when a key goes up
.RE
.LP
All tables other than
.B up
refer to the action generated when a key goes down.  Entries in the
.B up
table are used only for shift keys, since the shift in question goes
away when the key goes up, except for keys such as "Caps Lock" or "Num Lock";
the keyboard streams module makes the key look as if it were a latching key.
.LP
A table name of
.B all
indicates that the entry for all tables should be set to the specified value,
with the following exception:
for entries with a value other than
.BR hole ,
the entry for the
.B numl
table should be set to
.BR nonl ,
and the entry for the
.B up
table should be set to
.BR nop .
.LP
The
.I code
specifies the effect of the key in question when the specified shift key is
down.
A
.I code
consists of either:
.RS
.TP 3
\(bu
A character, which indicates that the key should generate the given
character.  The character can either be a single character, a single character
preceded by
.B ^
which refers to a "control character" (for instance,
.B ^c
is control-C), or a C-style
character constant enclosed in single quote characters
.RB ( ' ),
which can be expressed with C-style escape sequences such as
.RB \er
for
.SM RETURN
or
.RB \e000
for the null character.  Note that the single character may be any character in
an 8-bit character set, such as \s-1ISO\s0 8859/1.
.TP 3
\(bu
A string, consisting of a list of characters enclosed in double quote
characters (\fB"\fR).
.\" do NOT use e.g. ".RB" here unless you make ABSOLUTELY SURE the double quote
.\" comes out correctly!  The " character has a special meaning to "nroff" and
.\" "troff" when used in arguments to macros such as ".RB".
Note that the use of the double quote character means that a
.I code
of double quote must be enclosed in single quotes.
.RE
.TP 3
\(bu
One of the following expressions:
.RS
.TP 15
.B shiftkeys+leftshift
the key is to be the left-hand "Shift" key
.TP
.B shiftkeys+rightshift
the key is to be the right-hand "Shift" key
.TP
.B shiftkeys+leftctrl
the key is to be the left-hand "Control" key
.TP
.B shiftkeys+rightctrl
the key is to be the right-hand "Control" key
.TP
.B shiftkeys+alt
the key is to be the "Alt" shift key
.TP
.B shiftkeys+altgraph
the key is to be the "Alt Graph" shift key
.TP
.B shiftkeys+capslock
the key is to be the "Caps Lock" key
.TP
.B shiftkeys+shiftlock
the key is to be the "Shift Lock" key
.TP
.B shiftkeys+numlock
the key is to be the "Num Lock" key
.TP
.B buckybits+systembit
the key is to be the "Stop" key in Sunview; this is normally the L1 key, or the
\s-1SETUP\s0 key on the VT100 keyboard
.TP
.B buckybits+metabit
the key is to be the "meta" key, that is, the "Left" or "Right"
key on a Sun-2 or Sun-3 keyboard or the "diamond" key on a Sun-4 keyboard
.TP
.B compose
the key is to be the "Compose" key
.TP
.B ctrlq
on the "VT100" keyboard, the key is to transmit the control-Q character (this
would be the entry for the "Q" key in the
.B ctrl
table)
.TP
.B ctrls
on the "VT100" keyboard, the key is to transmit the control-S character (this
would be the entry for the "S" key in the
.B ctrl
table)
.TP
.B noscroll
on the "VT100" keyboard, the key is to be the "No Scroll" key
.TP
.B string+uparrow
the key is to be the "up arrow" key
.TP
.B string+downarrow
the key is to be the "down arrow" key
.TP
.B string+leftarrow
the key is to be the "left arrow" key
.TP
.B string+rightarrow
the key is to be the "right arrow" key
.TP
.B string+homearrow
the key is to be the "home" key
.TP
.B fa_acute
the key is to be the acute accent "floating accent" key
.TP
.B fa_cedilla
the key is to be the cedilla "floating accent" key
.TP
.B fa_cflex
the key is to be the circumflex "floating accent" key
.TP
.B fa_grave
the key is to be the grave accent "floating accent" key
.TP
.B fa_tilde
the key is to be the tilde "floating accent" key
.TP
.B fa_umlaut
the key is to be the umlaut "floating accent" key
.TP
.B nonl
this is used only in the Num Lock table; the key is not to be affected by the
state of Num Lock
.TP
.B pad0
the key is to be the "0" key on the numeric keypad
.TP
.B pad1
the key is to be the "1" key on the numeric keypad
.TP
.B pad2
the key is to be the "2" key on the numeric keypad
.TP
.B pad3
the key is to be the "3" key on the numeric keypad
.TP
.B pad4
the key is to be the "4" key on the numeric keypad
.TP
.B pad5
the key is to be the "5" key on the numeric keypad
.TP
.B pad6
the key is to be the "6" key on the numeric keypad
.TP
.B pad7
the key is to be the "7" key on the numeric keypad
.TP
.B pad8
the key is to be the "8" key on the numeric keypad
.TP
.B pad9
the key is to be the "9" key on the numeric keypad
.TP
.B paddot
the key is to be the "." key on the numeric keypad
.TP
.B padenter
the key is to be the "Enter" key on the numeric keypad
.TP
.B padplus
the key is to be the "+" key on the numeric keypad
.TP
.B padminus
the key is to be the "-" key on the numeric keypad
.TP
.B padstar
the key is to be the "*" key on the numeric keypad
.TP
.B padslash
the key is to be the "/" key on the numeric keypad
.TP
.B padequal
the key is to be the "=" key on the numeric keypad
.TP
.B padsep
the key is to be the "," (separator) key on the numeric keypad
.TP
.BI lf( n )
the key is to be the left-hand function key
.I n
.TP
.BI rf( n )
the key is to be the right-hand function key
.I n
.TP
.BI tf( n )
the key is to be the top function key
.I n
.TP
.BI bf( n )
the key is to be the "bottom" function key
.I n
.TP
.B nop
the key is to do nothing
.TP
.B error
this code indicates an internal error; to be used only for keystation
126, and must be used there
.TP
.B idle
this code indicates that the keyboard is idle (that is, has no keys down); to
be used only for all entries other than the
.B numl
and
.B up
table entries for keystation 127, and must be used there
.TP
.B oops
this key exists, but its action is not defined; it has the same effect as
.B nop
.TP
.B reset
this code indicates that the keyboard has just been reset; to be used only for
the
.B up
table entry for keystation 127, and must be used there
.RE
.LP
.RS
.nf
.BI swap " number1" " with" " number2"
.RE
.fi
.LP
exchanges the entries for keystations
.I number1
and
.IR number2 .
.LP
.RS
.nf
.BI key " number1" " same as" " number2"
.fi
.RE
.LP
sets the entries for keystation
.I number1
to be the same as those for keystation
.IR number2 .
If the file does not specify entries for keystation
.IR number2 ,
the entries currently in the translation table are used; if the file does
specify entries for keystation
.IR number2 ,
those entries are used.
.SH EXAMPLES
The following entry sets keystation 15 to be a \*(lqhole\*(rq (that is, an entry
indicating that there is no keystation 15); sets keystation 30 to do nothing
when Alt Graph is down, generate "!" when Shift is down, and generate "1" under
all other circumstances; and sets keystation 76 to be the left-hand Control
key.
.LP
.RS
.nf
key 15	 all hole
key 30	 base 1 shift ! caps 1 ctrl 1 altg nop
key 76	 all shiftkeys+leftctrl up shiftkeys+leftctrl
.fi
.RE
.LP
The following entry exchanges the Delete and Back Space keys on the Type 4
keyboard:
.LP
.RS
.nf
swap 43 with 66
.fi
.RE
.LP
Keystation 43 is normally the Back Space key, and keystation 66 is normally the
Delete key.
.LP
The following entry disables the Caps Lock key on the Type 3 and U.S. Type 4
keyboards:
.LP
.RS
.nf
key 119 all nop
.fi
.RE
.LP
The following specifies the standard translation tables for the U.S. Type 4
keyboard:
.LP
.RS
.nf
key 0	 all hole
key 1	 all buckybits+systembit up buckybits+systembit
key 2	 all hole
key 3	 all lf(2)
key 4	 all hole
key 5	 all tf(1)
key 6	 all tf(2)
key 7	 all tf(10)
key 8	 all tf(3)
key 9	 all tf(11)
key 10	 all tf(4)
key 11	 all tf(12)
key 12	 all tf(5)
key 13	 all shiftkeys+altgraph up shiftkeys+altgraph
key 14	 all tf(6)
key 15	 all hole
key 16	 all tf(7)
key 17	 all tf(8)
key 18	 all tf(9)
key 19	 all shiftkeys+alt up shiftkeys+alt
key 20	 all hole
key 21	 all rf(1)
key 22	 all rf(2)
key 23	 all rf(3)
key 24	 all hole
key 25	 all lf(3)
key 26	 all lf(4)
key 27	 all hole
key 28	 all hole
key 29	 all ^[
key 30	 base 1 shift ! caps 1 ctrl 1 altg nop
key 31	 base 2 shift @ caps 2 ctrl ^@ altg nop
key 32	 base 3 shift # caps 3 ctrl 3 altg nop
key 33	 base 4 shift $ caps 4 ctrl 4 altg nop
key 34	 base 5 shift % caps 5 ctrl 5 altg nop
key 35	 base 6 shift ^ caps 6 ctrl ^^ altg nop
key 36	 base 7 shift & caps 7 ctrl 7 altg nop
key 37	 base 8 shift * caps 8 ctrl 8 altg nop
key 38	 base 9 shift ( caps 9 ctrl 9 altg nop
key 39	 base 0 shift ) caps 0 ctrl 0 altg nop
key 40	 base - shift _ caps - ctrl ^_ altg nop
key 41	 base = shift + caps = ctrl = altg nop
key 42	 base ` shift ~ caps ` ctrl ^^ altg nop
key 43	 all '\eb'
key 44	 all hole
key 45	 all rf(4) numl padequal
key 46	 all rf(5) numl padslash
key 47	 all rf(6) numl padstar
key 48	 all bf(13)
key 49	 all lf(5)
key 50	 all bf(10) numl padequal
key 51	 all lf(6)
key 52	 all hole
key 53	 all '\et'
key 54	 base q shift Q caps Q ctrl ^Q altg nop
key 55	 base w shift W caps W ctrl ^W altg nop
key 56	 base e shift E caps E ctrl ^E altg nop
key 57	 base r shift R caps R ctrl ^R altg nop
key 58	 base t shift T caps T ctrl ^T altg nop
key 59	 base y shift Y caps Y ctrl ^Y altg nop
key 60	 base u shift U caps U ctrl ^U altg nop
key 61	 base i shift I caps I ctrl '\et' altg nop
key 62	 base o shift O caps O ctrl ^O altg nop
key 63	 base p shift P caps P ctrl ^P altg nop
key 64	 base [ shift { caps [ ctrl ^[ altg nop
key 65	 base ] shift } caps ] ctrl ^] altg nop
key 66	 all '\e177'
key 67	 all compose
key 68	 all rf(7) numl pad7
key 69	 all rf(8) numl pad8
key 70	 all rf(9) numl pad9
key 71	 all bf(15) numl padminus
key 72	 all lf(7)
key 73	 all lf(8)
key 74	 all hole
key 75	 all hole
key 76	 all shiftkeys+leftctrl up shiftkeys+leftctrl
key 77	 base a shift A caps A ctrl ^A altg nop
key 78	 base s shift S caps S ctrl ^S altg nop
key 79	 base d shift D caps D ctrl ^D altg nop
key 80	 base f shift F caps F ctrl ^F altg nop
key 81	 base g shift G caps G ctrl ^G altg nop
key 82	 base h shift H caps H ctrl '\eb' altg nop
key 83	 base j shift J caps J ctrl '\en' altg nop
key 84	 base k shift K caps K ctrl '\ev' altg nop
key 85	 base l shift L caps L ctrl ^L altg nop
key 86	 base ; shift : caps ; ctrl ; altg nop
key 87	 base '\e'' shift '"' caps '\e'' ctrl '\e'' altg nop
key 88	 base '\e\e' shift | caps '\e\e' ctrl ^\e altg nop
key 89	 all '\er'
key 90	 all bf(11) numl padenter
key 91	 all rf(10) numl pad4
key 92	 all rf(11) numl pad5
key 93	 all rf(12) numl pad6
key 94	 all bf(8) numl pad0
key 95	 all lf(9)
key 96	 all hole
key 97	 all lf(10)
key 98	 all shiftkeys+numlock
key 99	 all shiftkeys+leftshift up shiftkeys+leftshift
key 100	 base z shift Z caps Z ctrl ^Z altg nop
key 101	 base x shift X caps X ctrl ^X altg nop
key 102	 base c shift C caps C ctrl ^C altg nop
key 103	 base v shift V caps V ctrl ^V altg nop
key 104	 base b shift B caps B ctrl ^B altg nop
key 105	 base n shift N caps N ctrl ^N altg nop
key 106	 base m shift M caps M ctrl '\er' altg nop
key 107	 base , shift < caps , ctrl , altg nop
key 108	 base . shift > caps . ctrl . altg nop
key 109	 base / shift ? caps / ctrl ^_ altg nop
key 110	 all shiftkeys+rightshift up shiftkeys+rightshift
key 111	 all '\en'
key 112	 all rf(13) numl pad1
key 113	 all rf(14) numl pad2
key 114	 all rf(15) numl pad3
key 115	 all hole
key 116	 all hole
key 117	 all hole
key 118	 all lf(16)
key 119	 all shiftkeys+capslock
key 120	 all buckybits+metabit up buckybits+metabit
key 121	 base ' ' shift ' ' caps ' ' ctrl ^@ altg ' '
key 122	 all buckybits+metabit up buckybits+metabit
key 123	 all hole
key 124	 all hole
key 125	 all bf(14) numl padplus
key 126	 all error numl error up hole
key 127	 all idle numl idle up reset
.fi
.RE
.SH "SEE ALSO"
.BR loadkeys (1),
.BR kb (4M)
