Arquivotheca/SunOS-4.1.3/man/man5/publickey.5
.\" @(#)publickey.5 1.1 92/07/30 SMI;
.TH PUBLICKEY 5 "19 October 1987"
.SH NAME
publickey \- public key database
.SH SYNOPSIS
.B /etc/publickey
.SH DESCRIPTION
.IX "publickey file" "" "\fLpublickey\fP file"
.LP
.B /etc/publickey
is the public key database used for secure
networking. Each entry in
the database consists of a network user
name (which may either refer to
a user or a hostname), followed by the user's
public key (in hex
notation), a colon, and then the user's
secret key encrypted with
its login password (also in hex notation).
.LP
This file is altered either by the user through the
.BR chkey (1)
command or by the system administrator through the
.BR newkey (8)
command.
The file
.B /etc/publickey
should only contain data on the 
Network Information Service
(\s-1NIS\s0)
master machine, where it
is converted into the
.SM NIS
database
.BR publickey.byname .
.LP
The
.B /etc/publickey
file contains a default entry for
.BR nobody .
If this entry is commented out,
.B chkey
only allows user to edit their existing entry,
it will not allow them to create new entries.
.SH SEE ALSO
.BR chkey (1),
.BR publickey (3R),
.BR newkey (8),
.BR ypupdated (8C)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
