Arquivotheca/SunOS-4.1.3/man/man5/services.5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\" @(#)services.5 1.1 92/07/30 SMI; from UCB 4.3 BSD 6.2
.\"
.TH SERVICES 5 "18 December 1989"
.UC 5
.SH NAME
services \- Internet services and aliases
.SH DESCRIPTION
.IX  "inetd.conf file"  ""  "\fLinetd.conf\fP \(em Internet service aliases"
.IX  "internet servers"  ""  "Internet service aliases"
.LP
The
.B services
file contains an entry for each service
available through the
.SM TCP/IP.
Each entry consists of a line of the form:
.IP
.I service-name\ \ \ port\|\fB/\|\fPprotocol\ \ \ aliases
.TP 15
.I service-name
This is the official Internet service name.
.TP
.IB port\| / protocol
This field is composed of the port
number and protocol through which
the service is provided (for instance,
.BR 512/tcp ).
.TP
.I aliases
This is a list of alternate names by which
the service might be requested.
.LP
Fields can be separated by any number of spaces or
.SM TAB\s0's.
A
.RB ` # '
(pound-sign) indicates the beginning of a
comment; characters up to the end of the
line are not interpreted by routines which
search the file.
.LP
Service names may contain any printable
character other than a field delimiter,
.SM NEWLINE\s0,
or comment character.
.SH FILES
.PD 0
.TP 20
.B /etc/services
.PD
.SH "SEE ALSO"
.BR getservent (3N),
.BR inetd.conf (5)
.SH BUGS
A name server should be used instead of a static file.
