Arquivotheca/SunOS-4.1.3/man/man5/sm.5
.\" @(#)sm.5 1.1 92/07/30 SMI;
.TH SM 5 "19 October 1987"
.SH NAME
sm, sm.bak, sm.state \- in.statd directory and file structures
.SH SYNOPSIS
.B /etc/sm,
.B /etc/sm.bak,
.B /etc/sm.state
.SH DESCRIPTION
.IX "sm file" "" "\fLsm\fP, file"
.LP
.B /etc/sm
and
.B /etc/sm.bak
are directories generated by
.BR in.statd .
Each entry in
.B /etc/sm
represents the name of the machine to be monitored by the
.B in.statd
daemon.
Each entry in
.B /etc/sm.bak
represents the name of the machine to be notified by the
.B in.statd
daemon upon its recovery.
.LP
.B /etc/sm.state
is a file generated by
.B rpc.statd
to record the its version number.
This version number is incremented each time a crash or
recovery takes place.
.SH FILES
.PD 0
.TP 20
.B /etc/sm
.TP
.B /etc/sm.bak
.TP
.B /etc/sm.state
.PD
.SH "SEE ALSO"
.BR lockd (8C),
.BR statd (8C)
