Arquivotheca/SunOS-4.1.3/man/man5/syslog.conf.5
.\" @(#)syslog.conf.5 1.1 92/07/30 SMI; from UCB 4.3
.\" Copyright (c) 1983,1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.TH SYSLOG.CONF 5 "18 February 1988"
.SH NAME
syslog.conf \- configuration file for syslogd system log daemon
.SH SYNOPSIS
.B /etc/syslog.conf
.SH DESCRIPTION
.IX  "syslog.conf"  ""  "\fLsyslogd.conf\fP \(em system log daemon configuration file"
.IX  "system log configuration file \(em \fLsyslogd.conf\fR"
.IX  "configuration file, system log daemon \(em \fLsyslogd\fR"
.LP
The file
.B /etc/syslog.conf
contains information used by the system log daemon,
.BR syslogd (8),
to forward a system message to appropriate
log files and/or users. 
.B syslog
preprocesses this file through
.BR m4 (1V)
to obtain the correct information for certain log files.
.LP
A configuration entry is composed of two
\s-1TAB\s0-separated fields:
.IP
.I "selector		action"
.LP
The
.I selector
field contains a semicolon-separated list
of priority specifications of the form:
.IP
.IB facility . level\c
.RB [ ;\c
.IB facility . level\c
]
.LP
where
.I facility
is a system facility, or comma-separated
list of facilities, and
.I level
is an indication of the severity of the
condition being logged.
Recognized values for
.I facility
include:
.TP 10
.B user
Messages generated by user processes.
This is the default priority for messages from
programs or facilities not listed in
this file.
.TP
.B kern
Messages generated by the kernel.
.TP
.B mail
The mail system.
.TP
.B daemon
System daemons, such as
.BR ftpd (8C),
.BR routed (8C),
etc.
.TP
.B auth
The authorization system:
.BR login (1),
.BR su (1V),
.BR getty (8),
etc.
.TP
.B lpr
The line printer spooling system:
.BR lpr (1),
.BR lpc (8),
.BR lpd (8),
etc.
.TP
.B news
Reserved for the
.SM USENET
network news system.
.TP
.B uucp
Reserved for the
.SM UUCP
system; it does not currently use the
.B syslog
mechanism.
.TP
.B cron
The
.BR cron / at
facility;
.BR crontab (1),
.BR at (1),
.BR cron (8),
etc.
.TP
.B local0-7
Reserved for local use.
.TP
.B mark
For timestamp messages produced internally by
.BR syslogd .
.TP
.B *
An asterisk indicates all facilities except for the
.B mark
facility.
.LP
Recognized values for
.I level
are (in descending order of severity):
.TP 10
.B emerg
For panic conditions that would normally
be broadcast to all users.
.TP
.B alert
For conditions that should be corrected immediately,
such as a corrupted system database.
.TP
.B crit
For warnings about critical conditions,
such as hard device errors.
.TP
.B err
For other errors.
.TP
.B warning
For warning messages.
.TP
.B notice
For conditions that are not error conditions,
but may require special handling.
.TP
.B info
Informational messages.
.TP
.B debug
For messages that are normally used only
when debugging a program.
.TP
.B none
Do not send messages from the indicated
.I facility
to the selected file.  For example, a
.I selector
of
.RS
.RS
.ft B
*.debug;mail.none
.ft R
.RE
.RE
.IP
will send all messages
.I except
mail messages to the selected file.
.br
.ne 8
.LP
The
.I action
field indicates where to forward the message.
Values for this field can have one of four forms:
.TP 3n
\(bu
A filename, beginning with a leading slash,
which indicates that messages specified by the
.I selector
are to be written to the specified file.
The file will be opened in append mode.
.TP
\(bu
The name of a remote host, prefixed with an
.BR @ ,
as with:
.BI @ server\fR,
which indicates that messages specified by the
.I selector
are to be forwarded to the
.B syslogd
on the named host.
.TP
\(bu
A comma-separated list of usernames,
which indicates that messages specified by the
.I selector
are to be written to the named users if they
are logged in.
.TP
\(bu
An asterisk, which indicates that messages
specified by the
.I selector
are to be written to all logged-in users.
.LP
Blank lines are ignored.
Lines for which the first character is a
.RB ` # '
are treated as comments.
.SH Sun386i DESCRIPTION
.LP
The file is as described above, except that there is an additional
valid entry type, for translation.
A line containing the keyword "translate," if present, specifies
how system error messages are 
translated, suppressed, or forwarded
to appropriate log files and/or users.
.LP
A translation entry in the file is composed of five
\s-1TAB\s0-separated fields:
.LP
.ta 1i 2i 3i 4i 5i
.ft I
.nf
	translate	source	facility	input	output
.fi
.ft
.LP
The
.I translate
field consists of the word
.B translate
and is used to indicate that this is a translation entry.
.LP
The
.I source
field contains a comma separated list of
source names.  Recognized sources are:
.TP 10
.B klog
Messages placed in
.B /dev/klog
by the kernel.
.TP
.B log
Messages placed in
.B /dev/log
file by local programs.
.TP
.B syslog
Messages placed in the internet socket by programs on other systems.
.TP
.B *
An asterisk indicates all three sources
.RB ( klog ,
.B log
and
.BR syslog ).
.LP
The
.I facility
field contains a comma-separated list of facilities.
.LP
The
.I input
field is the name of the file used to map error messages
(in printf format strings) to numbers.
This number is used to locate a new string in the
file specified in the output field.
The format of both files is described in
.BR translate (5).
.LP
The output file specified by the output field translates the numbers
from the input file into the desired error messages, and also 
specifies the format to be used to 
output each message.
.br
.ne 12
.SH EXAMPLE
With the following configuration file:
.nf
.ft B
.ta 4m +\w'*.alert,auth.warning'u+3
	*.notice;mail.info	/var/log/notice
	*.crit	/var/log/critical
	kern,mark.debug	/dev/console
	kern.err	@server
	*.emerg	*
	*.alert	root,operator
	*.alert;auth.warning	/var/log/auth
.fi
.ft R
.LP
.B syslogd
will log all mail system messages except
.B debug
messages and all
.B notice
(or higher) messages into a file named
.BR /var/log/notice .
It logs all critical messages into
.BR /var/log/critical ,
and all kernel messages and 20-minute
marks onto the system console.
.br
.ne 5
.LP
Kernel messages of
.B err
(error) severity or higher are forwarded
to the machine named
.IR server .
Emergency messages are forwarded to all users.
The users \*(lqroot\*(rq and \*(lqoperator\*(rq are informed of any
.B alert
messages.  All messages from the authorization system of
.B warning
level or higher are logged in the file
.BR /var/log/auth .
.SH FILES
.PD 0
.TP 20
.B /etc/syslog.conf
.TP
.B /var/log/notice
.TP
.B /var/log/critical
.TP
.B /var/log/auth
.PD
.SH SEE ALSO
.BR at (1),
.BR crontab (1),
.BR logger (1),
.BR login (1),
.BR lpr (1),
.BR m4 (1V),
.BR su (1V),
.BR syslog (3),
.BR translate (5),
.BR cron (8),
.BR ftpd (8C),
.BR getty (8),
.BR lpc (8),
.BR lpd (8),
.BR routed (8C),
.BR syslogd (8)
