Arquivotheca/SunOS-4.1.3/man/man5/toc.5
.\" @(#)toc.5 1.1 92/07/30 SMI; 
.TH TOC 5 "19 February 1988"
.SH NAME
toc \- table of contents of optional clusters in Application SunOS and Developer's Toolkit 
.SH SYNOPSIS
.B /usr/lib/load/toc
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX "toc file" "" "\fLtoc\fP file"
.LP
The
.B toc
file contains information specifying the organization of the optional clusters
in Application SunOS 
and Developer's Toolkit on the Sun386i distribution media.
For each cluster, a single line should be present
with the following information:
.IP
cluster name
.br
.ns
.IP
set containing the cluster (Application SunOS or Developer's Toolkit)
.br
.ns
.IP
size of the cluster (in kilobytes)
.br
.ns
.IP
diskette volume of the cluster in the set (for loading from 3.5" diskette)
.br
.ns
.IP
tape and file number of the cluster (for loading from 1/4" tape)
.LP
Items are separated by a ':'.
.LP
Cluster names can contain any printable character other than a ':', space,
tab, or newline character.
The set containing the cluster is specified by an 'A' for Application
SunOS or 'D' for Developer's Toolkit.
The diskette volume is the number of the diskette within the diskette set
on which the cluster begins.
The tape and file number specifies the tape and file position of the cluster
on the tape.
.SH EXAMPLE
.LP
The following is an example to the \fBtoc\fR file.
.IP
.ft B
.nf
.ta +1.0i +1.0i +1.0i
accounting:A:55:14:1@12
advanced_admin:A:628:14:1@4
audit:A:144:14:1@8
comm:A:312:13:1@9
disk_quotas:A:56:14:1@11
doc_prep:A:790:13:1@10
extended_commands:A:276:13:1@5
games:A:2351:19:1@17
mail_plus:A:135:14:1@7
man_pages:A:5586:16:1@14
name_server:A:339:14:1@13
networking_plus:A:610:13:1@6
old:A:131:14:1@16
plot:A:227:14:1@14
spellcheck:A:455:13:1@2
sysV_commands:A:2505:14:1@3
base_devel:D:5389:1:2@2
plot_devel:D:247:5:2@3
sccs:D:328:5:2@4
sunview_devel:D:1768:5:2@5
sysV_devel:D:4287:3:2@6
proflibs:D:4755:4:2@7
config:D:3065:6:2@8
.fi
.ft
.br
.ne 7
.LP
The first line specifies that the \fBaccounting\fR cluster is part of
Application SunOS and requires 55 kilobytes of disk storage.
In the diskette distribution, it begins on diskette 14 of Application
SunOS optional clusters. 
In the tape distribution, it can be found on file 12 of tape 1.
The last line specifies that the \fIconfig\fR cluster is part of
Developer's Toolkit and requires 3065 kilobytes of disk storage.
In the diskette distribution, it begin on diskette 6 of Developer's Toolkit.
In the tape distribution, it can be found on file 8 of tape 2.
.SH FILES
\fB/usr/lib/load/toc\fR
.SH "SEE ALSO"
.BR cluster (1)
.BR load (1)
.BR unload (1)
