Arquivotheca/SunOS-4.1.3/man/man5/tzfile.5
.\" @(#)tzfile.5 1.1 92/07/30 SMI; from Arthur Olson
.TH TZFILE 5 "6 October 1989"
.SH NAME
tzfile \- time zone information
.SH SYNOPSIS
.B
#include <tzfile.h>
.SH DESCRIPTION
.IX "tzfile file" "" "\fLtzfile\fP file"
.LP
The time zone information files used by
.BR tzset
(see
.BR ctime (3V))
begin with bytes reserved for future use,
followed by three four-byte values of type
.BR long ,
written in a \*(lqstandard\*(rq byte order
(the high-order byte of the value is written first).
These values are,
in order:
.RS
.TP 20
.I tzh_timecnt
The number of \*(lqtransition times\*(rq for
which data is stored in the file.
.TP
.I tzh_typecnt
The number of \*(lqlocal time types\*(rq for
which data is stored
in the file (must not be zero).
.TP
.I tzh_charcnt
The number of characters of \*(lqtime zone
abbreviation strings\*(rq stored in the file.
.RE
.LP
The above header is followed by
.I tzh_timecnt
four-byte values of type
.BR long ,
sorted in ascending order.
These values are written in \*(lqstandard\*(rq byte order.
Each is used as a transition time (as returned by
.BR gettimeofday (2))
at which the rules for computing local time change.
Next come
.I tzh_timecnt
one-byte values of type
.BR "unsigned char" ;
each one tells which of the different
types of \*(lqlocal time\*(rq types
described in the file is associated
with the same-indexed transition time.
These values serve as indices into an array of
.I ttinfo
structures that appears next in the file;
these structures are defined as follows:
.LP
.RS
.nf
.ta .5i +\w'unsigned int\0\0'u
.ft B
struct ttinfo {	
	long	tt_gmtoff;
	int	tt_isdst;
	unsigned int	tt_abbrind;
};
.ft R
.fi
.RE
.LP
Each structure is written as a four-byte value for
.I tt_gmtoff
of type
.BR long ,
in a standard byte order, followed by a
one-byte value for
.I tt_isdst
and a one-byte value for
.IR tt_abbrind .
In each structure,
.I tt_gmtoff
gives the number of seconds to be added to
.SM GMT\s0,
.I tt_isdst
tells whether
.I tm_isdst
should be set by
.B localtime
(see
.BR ctime (3V))
and
.I tt_abbrind
serves as an index into the array of
time zone abbreviation characters that follow the
.I ttinfo
structure(s) in the file.
.LP
.B localtime
uses the first standard-time
.I ttinfo
structure in the file
(or simply the first
.I ttinfo
structure in the absence of a standard-time structure)
if either
.I tzh_timecnt
is zero or the time argument is less than the first transition time recorded
in the file.
.SH SEE ALSO
.BR gettimeofday (2),
.BR ctime (3V)
