Arquivotheca/SunOS-4.1.3/man/man5/uuencode.5
.\" @(#)uuencode.5 1.1 92/07/30 SMI; from UCB 4.2
.TH UUENCODE 5 "19 October 1987"
.SH NAME
uuencode \- format of an encoded uuencode file
.SH DESCRIPTION
.IX  "uuencode file"  ""  "\fLuuencode\fP \(em UUCP encoded file format"
.LP
Files output by
.BR uuencode (1C)
consist of a header line,
followed by a number of body lines,
and a trailer line.
.B uudecode
(see
.BR uuencode (1C))
will ignore any lines preceding the header or
following the trailer.
Lines preceding a header must not, of course,
look like a header.
.LP
The header line is distinguished by having the first
6 characters
.RB ` "begin " '.
The word
.B begin
is followed by a mode (in octal),
and a string which names the remote file.
Spaces separate the three items in the header line.
.LP
The body consists of a number of lines,
each at most 62 characters
long (including the trailing
.SM NEWLINE\s0).
These consist of a character count,
followed by encoded characters, followed by a
.SM NEWLINE\s0.
The character count is a single printing character,
and represents an integer, the number of bytes
the rest of the line represents.
Such integers are always in the range
from 0 to 63 and can be determined by
subtracting the character space (octal 40)
from the character.
.LP
Groups of 3 bytes are stored in 4
characters, 6 bits per character.
All are offset by a
.SM SPACE
to make
the characters printing.
The last line may be shorter than the normal 45 bytes.
If the size is not a multiple of 3,
this fact can be determined
by the value of the count on the last line.
Extra garbage will be included to make
the character count a multiple
of 4.
The body is terminated by a line with a count of zero.
This line consists of one
.SM ASCII SPACE\s0.
.LP
The trailer line consists of
.B end
on a line by itself.
.SH "SEE ALSO"
.BR mail (1),
.BR uucp (1C),
.BR uuencode (1C),
.BR uusend (1C)
