Arquivotheca/SunOS-4.1.3/man/man5/ypaliases.5
.\" @(#)ypaliases.5 1.1 92/07/30 SMI;
.TH YPALIASES 5 "25 September 1989"
.SH NAME
ypaliases \- NIS aliases for sendmail
.SH SYNOPSIS
.B /etc/ypaliases
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX "ypaliases" "\fLypaliases\fP \(em NIS aliases for sendmail" ""
.LP
Create the 
Network Information Service
(\s-1NIS\s0)
aliases map with this text file.
The
.B /etc/ypaliases
file has the same format as the
.B /etc/aliases
file described in
.BR aliases (5).
.LP
The text file for the 
.SM NIS
aliases map is stored in the
.B /etc/aliases
file on the 
.SM NIS
master of an
.SM NIS
domain.
Other systems in a domain (besides the
.SM NIS
master) can also have a local
.B /etc/aliases
file.
The local file is accessed first by programs such as
.BR sendmail (8),
and if it contains a line beginning with the character
.RB ` + ',
the 
.SM NIS
map will be accessed.
.LP
The local
.B /etc/aliases
file can specify resources that are not available on a
network-wide basis.
This implies that the 
.SM NIS
master cannot use the local
.B /etc/aliases
file to specify aliases that are to be known only to the local system. 
Sun386i systems allow the
.B /etc/aliases
file on the 
.SM NIS
master to be used locally, creating the
.SM NIS
aliases map with the
.B /etc/ypaliases
text file.
.SH FILES
.PD 0
.TP 20
.B /etc/aliases
.TP 20
.B /etc/ypaliases
.PD
.SH SEE ALSO
.BR uucp (1C),
.BR dbm (3X),
.BR aliases (5),
.BR newaliases (8),
.BR sendmail (8)
.LP
.TX ADMIN
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
