Arquivotheca/SunOS-4.1.3/man/man5/ypgroup.5
.\" @(#)ypgroup.5 1.1 92/07/30 SMI;
.TH YPGROUP 5 "25 September 1989"
.SH NAME
ypgroup \- NIS group file
.SH SYNOPSIS
.B /etc/ypgroup
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX "ypgroup" "" "\fLypgroup\fP\(em NIS group file" "" 
.LP
Create the 
Network Information Service
(\s-1NIS\s0)
group map with this text file.
This file has the same format as the
.B /etc/group
file described in
.BR group (5).
.LP
The text file for the 
.SM NIS
group map is stored in the
.B /etc/group
file on the 
.SM NIS
master of an
.SM NIS
domain.
Other systems in a domain (besides the
.SM NIS
master) can also have a local
.B /etc/group
file.
The local file is accessed first by programs such as
.BR groups (1),
and if it contains a line beginning with the character
.RB ` + ',
the 
.SM NIS
map will be accessed.
The local
.B /etc/group
file can specify groups
that are not available on a network-wide basis.
.LP
This implies that the 
.SM NIS
master cannot use the local
.B /etc/group
file to specify groups that are to be known only to the local system.
Sun386i systems allow the
.B /etc/group
file on the 
.SM NIS
master to be used locally, creating the
.SM NIS
group map from the
.B /etc/ypgroup
text file.
.SH FILES
.PD 0
.TP 20
.B /etc/group
.TP
.B /etc/ypgroup
.PD
.SH SEE ALSO
.BR passwd (1),
.BR su (1V),
.BR getgroups (2V),
.BR crypt (3),
.BR initgroups (3),
.BR group (5),
.BR group.adjunct (5),
.BR passwd (5),
.BR grpck (8V)
.LP
.TX ADMIN ,
.br
.IR "Sun386i SNAP Administration" ,
.br
.I Sun386i Advanced Administration
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
