Arquivotheca/SunOS-4.1.3/man/man5/yppasswd.5
.\" @(#)yppasswd.5 1.1 92/07/30 SMI;
.TH YPPASSWD 5 "25 September 1989"
.SH NAME
yppasswd \- NIS password file
.SH SYNOPSIS
.B /etc/yppasswd
.SH DESCRIPTION
.IX "yppasswd" "" "\fLyppasswd\fP\(em NIS password file" ""
.LP
Create the
Network Information Service
(\s-1NIS\s0)
password map with this text file.
The format for
.B /etc/yppasswd
is the same as for the
.B /etc/passwd
file described in
.BR passwd (5).
.LP
The text file for the 
.SM NIS
password map is stored in the
.B /etc/passwd
file on the 
.SM NIS
master of an
.SM NIS
domain. 
Other systems in a domain can also have a local
.B /etc/passwd
file.
The local file is accessed first by programs such as
.BR passwd (1),
and if it contains a line beginning with the character
.RB ` + ',
the 
.SM NIS
map will be accessed.
.LP
The local
.B /etc/passwd
file can specify users that are not available on a
network-wide basis.
This implies that the 
.SM NIS
master cannot use the local
.B /etc/passwd
file to specify users that are to be
known only to the local system.
Sun386i systems allow the
.BR /etc/passwd
file on the 
.SM NIS
master to be used locally, creating the
.SM NIS
password map from the
.B /etc/yppasswd
text file.
.SH FILES
.PD 0
.TP 20
.B /etc/passwd
.TP 20
.B /etc/yppasswd
.PD
.SH SEE ALSO
.BR login (1),
.BR mail (1),
.BR passwd (1),
.BR crypt (3),
.BR getpwent (3V),
.BR group (5),
.BR passwd (5),
.BR passwd.adjunct (5),
.BR adduser (8),
.BR sendmail (8),
.BR vipw (8)
.LP
.TX ADMIN ,
.br
.IR "Sun386i SNAP Administration" ,
.br
.I Sun386i Advanced Administration
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0).
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
