Arquivotheca/SunOS-4.1.3/man/man5/ypprintcap.5
.\" @(#)ypprintcap.5 1.1 92/07/30 SMI;
.TH YPPRINTCAP 5 "25 September 1989"
.SH NAME
ypprintcap \- NIS printer capability database
.SH SYNOPSIS
.B /etc/ypprintcap
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX "ypprintcap" "" "\fLypprintcap\fP\(em NIS printer capability database" ""
.LP
Create the 
Network Information Service
(\s-1NIS\s0)
printcap map with this text file to
centralize and simplify printer administration.
The
.B /etc/ypprintcap
file has the same format as the
.B /etc/printcap
file described in
.BR printcap (5).
.LP
The text file for the 
.SM NIS
printcap map is stored in the
.B /etc/printcap
file on the 
.SM NIS
master of an
.SM NIS
domain. 
Other systems in a domain (besides the
.SM NIS
master) can also have a local
.B /etc/printcap
file.
The local file is accessed first by programs such as
.BR lpr (1),
and if it contains a line beginning with the character
.RB ` + ',
the 
.SM NIS
map will be accessed.
.LP
The local
.B /etc/printcap
file can specify printers that are not available on a
network-wide basis.
This implies that the 
.SM NIS
master cannot use the local
.B /etc/printcap
file to specify printers that are to be
known only to the local system.
Sun386i systems allow the
.B /etc/printcap
file on the 
.SM NIS
master to be used locally, using the
.B /etc/ypprintcap
file to create the 
.SM NIS
printcap map.
.SH FILES
.PD 0
.TP 20
.B /etc/printcap
.TP 20
.B /etc/ypprintcap
.PD
.SH SEE ALSO
.BR lpq (1),
.BR lpr (1),
.BR lprm (1),
.BR snap (1),
.BR stty (1V),
.BR plot (3X),
.BR ttcompat (4M),
.BR printcap (5),
.BR termcap (5),
.BR lpc (8),
.BR lpd (8),
.BR pac (8)
.LP
.TX ADMIN ,
.br
.IR "Sun386i SNAP Administration" ,
.br
.I Sun386i Advanced Administration
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
