Arquivotheca/SunOS-4.1.3/man/man8/c2conv.8
.\" @(#)c2conv.8 1.1 92/07/30 SMI;
.TH C2CONV 8 "14 June 1989"
.SH NAME
C2conv, C2unconv \- convert system to or from C2 security
.SH SYNOPSIS
.B C2conv
.LP
.B C2unconv
.SH AVAILABILITY
This program is available with the
.I Security
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  C2conv  ""  "\fLC2conv\fP \(em convert to C2 security"
.LP
.B C2conv
converts a standard SunOS system to operate with C2-level security.
.LP
The program prompts for information regarding the Secure NFS option,
client systems (if the system is an NFS server for
diskless clients),
audit devices (if it is an audit file server), and names of
file systems (if there is a remote audit server). The program also
requests certain information for the
.BR audit_control (5)
file; default values may be used for audit flags and for the 
"minfree" value.
Finally, it requests the mail address to be used (by
.BR mail (1))
when C2 administrative tasks are required.  The default address is
.B root 
for the host being converted.
.LP
Once it has this information,
.B C2conv
uses it to set up the necessary files for a C2 secure system,
reporting on its progress as it proceeds.
.LP
.B C2unconv
backs out the changes made to
.B /etc/passwd
and
.BR /etc/group .
It does not back out changes to other files.
.SH "FILES"
.PD 0
.TP 25
.B /etc/passwd
.TP
.B /etc/group
.\" .TP
.\" .B /usr/etc/audit_warn
.\" .TP
.\" .B /etc/security/audit/audit_control
.TP
.B /etc/fstab
.PD
.SH "SEE ALSO"
.BR audit_control (5)
