Arquivotheca/SunOS-4.1.3/man/man8/change_login.8
.\" @(#)change_login.8 1.1 92/07/30 SMI;
.TH CHANGE_LOGIN 8 "6 October 1989"
.SH NAME
change_login \- control screen blanking and choice of login utility
.SH SYNOPSIS
.B change_login
.SH AVAILABILITY
.LP
Available only on Sun 386i systems running a SunOS 4.0.\fIx\fR
release or earlier.  Not a SunOS 4.1 release feature.
.SH DESCRIPTION
.IX  change_login  ""  "\fLchange_login\fP \(em screen blanking and login"
.IX  "login"  "change_login command"  ""  "\fLchange_login\fP \(em screen blanking and login"
.IX  "screen blanking"  "change_login command"  ""  "\fLchange_login\fP \(em screen blanking and login"
.LP
To prolong the life of your monitor, your Sun386i system turns
off the screen display if you have not used the keyboard or mouse for 30
minutes or more.
To see the screen again, simply move the mouse on the pad
or press any key.
This feature is normally enabled automatically when you
log in, but you can control it using the
.B change_login
command as explained below.
.LP
This  command also determines whether you log into
your workstation using the Sun386i login screen,
.BR logintool (8)
or through a traditional
.B login:
prompt.
.LP
The screen blanking choices available with
.B change_login
are:
.TP
.B "1. Logintool and Sun Logo screenblank"
Enables screen blanking.
When blank, the system displays the Sun logo 
moving randomly around an otherwise dark screen. 
.TP
.B "2. Logintool and video-off screenblank"
Shuts off the video output to your monitor when the screen goes blank.
This is the most efficient type of screen blanking.
The Desktop is almost instantly
redisplayed when you move the mouse or begin typing.
.TP
.B "3. Logintool and no screenblank"
Retains the login screen, but disables screen blanking.
.TP
.B "4. No Logintool and no screenblank"
Disables both the login screen and screen blanking. 
.SH EXAMPLE
.LP
The following is an example of
.BR change_login .
Notice you must be super-user to use this command.
.RS
.nf
.ft B
example# change_login
.LP
.ft B
This program will check what login and screenblank
options are set on this workstation, and allow you
to choose other options, if you are logged in as superuser.
.LP
.ft B
Do you want to do this? [y or n]: y
.LP
.ft B
This workstation is set up to use logintool and
a screenblank program that displays a Sun logo graphic.
.LP
.ft B
These are the available options:
.LP
.ft B
+ 1. Logintool and Sun Logo screenblank
  2. Logintool and video-off screenblank
  3. Logintool and no screenblank
  4. No Logintool and no screenblank
.LP
.ft B
+ indicates the current configuration
.LP
.ft B
You must be logged in as superuser to change the current setting.
.fi
.ft R
.RE
.LP
Follow the instructions in
.I Sun386i System Setup and Maintenance
or
.I Sun386i Advanced Administration
to shut down and then restart your system.
The setting chosen in the above example will not be
enabled until you have restarted your system.
.SH "SEE ALSO"
.BR login (1),
.BR screenblank (1),
.BR su (1V),
.BR logintool (8)
.LP
.I Sun386i Advanced Skills
.br
.I Sun386i System Setup and Maintenance
.br
.I Sun386i Advanced Administration
