Arquivotheca/SunOS-4.1.3/man/man8/dkctl.8
.\" @(#)dkctl.8 1.1 92/07/30 SMI
.TH DKCTL 8 "17 June 1988"
.SH NAME
dkctl \- control special disk operations
.SH SYNOPSIS
.B /usr/etc/dkctl
.I disk
.I command
.SH DESCRIPTION
.IX  "dkctl command"  ""  "\fLdkctl\fP \(em special disk operations"
.IX  disk  "special operations"  ""  "\fLdkctl\fP \(em special disk operations"
.B dkctl
is used to enable or disable special disk operations. In particular the enabling
or disabling of verified writes (write check functionality) is controlled
by this program.
.LP
The
.I disk
specification here is a disk name of the form
.IR /dev/rxxnp ,
where
.I xx
is the controller device abbreviation (xy, sd, etc.),
.I n
is the disk number, and
.I p
is the partition to which the operation applies.  The
.I partition
specification is simply
the letter used to identify that partition in the standard
.SM UNIX
system nomenclature.
.SH "SUPPORTED COMMANDS"
.sp 0.2i
.IP \fBwchk\fR 0.75i
This function enables write checking for disks that support it for the named
disk partition. This means that for partitions of disks with
this feature enabled, all writes are
.I verified
to have been correctly written on the disk. This operation emphasizes data
reliability over performance, although for each implementation, the fastest
reasonable method will be used (i.e., implemented in hardware, if possible).
.IP \fB\-wchk\fR 0.75i
This disables write check functionality for the named disk partition.
.SH BUGS
.LP
Use of the
.B dkctl
command requires super-user permissions.
.LP
There are many other features this program could control, and may in the
future.
.SH FILES
.PD 0
.TP 20
.BI /dev/r xxnp
.PD
.SH "SEE ALSO"
.BR dkio (4S),
.BR sd (4S),
.BR xy (4S)
