Arquivotheca/SunOS-4.1.3/man/man8/dname.8
.\" @(#)dname.8 1.1 92/07/30 SMI; from S5R3
.TH DNAME 8 "30 June 1988"
.SH NAME
dname \- print RFS domain and network names
.SH SYNOPSIS
.B dname
[
.B \-adn
]
[
.BI \-D " domain"
] [
.BI \-N " netspec"
]
.SH AVAILABILITY
.LP
This program is available with the
.I \s-1RFS\s0
software installation option.
Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "dname print" "" "\fLdname\fP \(em print RFS domain and network names"
.IX network "print RFS domain and network names"
.IX RFS "print RFS domain and network names"
.IX names "print RFS domain and network names"
.IX domain "print RFS domain and network names"
.LP
.B dname
prints or defines a host's Remote File Sharing
(\s-1RFS\s0)
domain name or the network used by 
.SM RFS
as transport provider.
.LP
When
.B dname
is used to change a domain name, the host's password is removed.
The administrator will be prompted for a new
password the next time 
.SM RFS
is started.
See 
.BR rfstart (8).
.LP
If
.B dname
is used with no options, it defaults to
.RB ` "dname \ \-d" '.
.LP
You cannot use the
.B \-D
or
.B \-N
options while 
.SM RFS
is running.
.SH OPTIONS
.TP
.B \-a
Print both the domain name and network name.
.TP
.B \-d
Print the domain name.
.TP
.B \-n
Print the network name.
.TP
.BI \-D " domain"
Set the domain name for the host.
.I domain
must consist of no more than 14 characters,
consisting of any combination of letters (upper
and lower case), digits, hyphens (\-), and
underscores (_).
This option is restricted to the super-user.
.TP
.BI \-N " netspec"
Set the network specification used for
.SM RFS\s0.
.I netspec
is the network device name, relative to the
.B /dev
directory.
For example, the
.SM TCP
transport device,
.B /dev/tcp
uses
.BR tcp .
This option is restricted to the super-user.
.SH "SEE ALSO"
.BR rfstart (8)
.SH NOTES
.LP
This domain name is not related to the
Network Information Service
(\s-1NIS\s0)
domain name.
Note:
.SM NIS
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
