Arquivotheca/SunOS-4.1.3/man/man8/exportfs.8
.\" @(#)exportfs.8 1.1 92/07/30 SMI;
.TH EXPORTFS 8 "7 October 1990"
.SH NAME
exportfs \- export and unexport directories to NFS clients
.SH SYNOPSIS
.B /usr/etc/exportfs
[
.B \-aiuv
] [
.B \-o
.I options
] [
.I pathname
]
.SH DESCRIPTION
.IX "exportfs command" "" "\fLexportfs\fP command"
.LP
.B exportfs
makes a local directory or filename
available for mounting over the network by
.SM NFS
clients.
It is normally invoked at boot time by the
.B /etc/rc.local
script, and uses information contained in the
.B /etc/exports
file to export
.I pathname
(which must be specified as a full pathname).
The super-user can run
.B exportfs
at any time to alter the list or characteristics of
exported directories and filenames.
Directories and files that are currently exported  are listed in the file
.BR /etc/xtab .
.LP
With no options or arguments,
.B exportfs
prints out the list of directories and filenames currently exported.
.SH OPTIONS
.TP
.B \-a
All.  Export all pathnames listed in
.BR /etc/exports ,
or if
.B \-u
is specified, unexport all of the currently exported pathnames.
.TP
.B \-i
Ignore the options in 
.BR /etc/exports. 
Normally, 
.B exportfs 
will consult
.BR /etc/exports 
for the options associated with the exported pathname.
.TP
.B \-u
Unexport the indicated pathnames.
.TP
.B \-v
Verbose. 
Print each directory or filename as it is exported or unexported.
.TP
.BI \-o " options"
Specify a comma-separated list of optional characteristics for
the pathname being exported.
.I options
can be selected from among:
.RS
.TP
.B ro
Export the pathname read-only. If not specified, the pathname
is exported read-write.
.TP
.BI rw= hostname\fR[ : hostname\fR]\|.\|.\|.
Export the pathname read-mostly.
Read-mostly means exported read-only to most
machines, but read-write to those specified.
If not specified, the pathname is exported read-write to all.
.TP
.BI anon= uid
If a request comes from an unknown user, use
.SM UID
as the effective user
.SM ID\s0.
Note: root users (\s-1UID\s0 0) are always
considered \*(lqunknown\*(rq by the
.SM NFS
server, unless they are included in the
.B root
option below.
The default value for this option is the
.SM UID
of the user \*(lqnobody\*(rq.
If the user \*(lqnobody\*(rq does not exist
then the value 65534 is used.
Setting the value of \*(lqanon\*(rq to 65535 disables anonymous access. 
Note: by default secure
.SM NFS
accepts insecure requests as anonymous,
and those wishing for extra security can disable this feature by setting
\*(lqanon\*(rq to 65535.
.TP
.BI root= hostname\fR[ : hostname\fR]\|.\|.\|.
Give root access only to the root users from a specified
.IR hostname  .
The default is for no hosts to be granted root access.
.TP
.BI access= client\fR[ : client\fR]\|.\|.\|.
Give mount access to each
.I client
listed.  A
.I client
can either be a hostname, or a netgroup (see
.BR netgroup (5)).
Each
.I client
in the list is first checked for in the
.B /etc/hosts
database, and then the
.B /etc/netgroup
database.  The default value allows any
machine to mount the given directory.
.TP
.B secure
Require clients to use a more secure protocol when
accessing the directory.
.RE
.SH FILES
.PD 0
.TP 20
.B /etc/exports  
static export information
.TP
.B /etc/xtab
current state of exported pathnames
.TP
.B /etc/netgroup
.PD
.SH "SEE ALSO"
.BR exports (5),
.BR netgroup (5),
.BR showmount (8)
.SH WARNINGS
.LP
You cannot export a directory that is either
a parent- or a sub-directory
of one that is currently exported and
.IR "within the same filesystem" .
It would be illegal, for example, to export both
.B /usr
and
.B /usr/local
if both directories resided in the same disk partition.
