Arquivotheca/SunOS-4.1.3/man/man8/extract_patch.8
.\" @(#)extract_patch.8 1.1 92/07/30 SMI; new for 4.1
.TH EXTRACT_PATCH 8 "18 January 1990"
.SH NAME
extract_patch \- extract and execute patch files from installation tapes
.SH SYNOPSIS
.B extract_patch
[
.BI \-d device
[
.BI \-r remote-host
] ]
[
.BI \-p patch-name
]
[
.SB \-DEFAULT
]
.SH DESCRIPTION
.IX "extract_patch command" "" "\fLextract_patch\fP \(em extract and execute patch files"
.LP
.B extract_patch
extracts a patch from a release tape onto the current system.
If no options are
specifed, it prompts for input as to the patch name,
tape device, or remote
hostname from which to the software is to be installed.
If the named patch cannot be found, a list of valid patches are printed.
.LP
If the named patch is found then the patch is extracted from the tape
onto the system.
If there is a
.SB README
file in the extracted contents then the user is given a chance
to view it.
If there is a patch installation program the user is given a chance
to run it.
.LP
Patches must appear in the tape's table of contents, and must have
a name that starts with \*(lqPatch_\*(rq.
.SH OPTIONS
.TP
.BI \-d device
Install from the indicated tape drive, such as
.BR st0 ,
or
.BR mt0 .
.TP
.BI \-r remote-host
Install from the device given in the 
.BR \-d
option on the indicated remote host.
.TP
.BI \-p patch-name
Specifes the name of the patch to extract.
.TP
.SB \-DEFAULT
Execute the installation script using all default values.
Otherwise the installation script prompts for any optional values.
.SH "SEE ALSO"
.BR extract_unbundled (8)
