Arquivotheca/SunOS-4.1.3/man/man8/format.8s
.\" @(#)format.8s 1.1 92/07/30 SMI
.TH FORMAT 8S "20 January 1988"
.SH NAME
format \- disk partitioning and maintenance utility
.SH SYNOPSIS
.B format
[
.BI \-f " command-file"
] [
.BI \-l " log-file"
] [
.BI \-x " data-file"
] [
.BI \-d " disk-name"
] [
.BI \-t " disk_type"
]
.ti +.5
[
.BI \-p " partition-name"
] [
.B \-s
]
.IR diskname .\|.\|.
.SH DESCRIPTION
.IX "format command" "" "\fLformat\fP command"
.LP
.B format
enables you to format, label, repair and
analyze disks on your Sun computer.  Unlike previous disk
maintenance programs,
.B format
runs under Sun\s-1OS\s0. Because there are
limitations to what can be done to the system disk while the
system is running,
.B format
is also supported within the
memory-resident system environment.  For most applications,
however, running
.B format
under Sun\s-1OS\s0 is the more convenient approach.
.LP
If no
.I disk-list
is present,
.B format
uses the disk list defined
in the data file specified with the
.B \-x
option.  If that option is omitted, the
data file defaults to
.B format.dat
in the current directory, or else
.BR /etc/format.dat .
.SH OPTIONS
.TP
.BI \-f " command-file"
Take command input from
.I command-file
rather than the standard input.
The file must contain commands that appear just as they would
if they had been entered from the keyboard.  With this option,
.B format
does not issue
.B continue?
prompts.
.TP
.BI \-l " log-file"
Log a transcript of the
.B format
session to the indicated
.IR log-file ,
including the standard input, the standard
output and the standard error.
.TP
.BI \-x " data-file"
Use the disk list contained in
.IR data-file .
.TP
.BI \-d " disk_name"
Specify which disk should be made current upon entry into the program.
The disk is specified by its logical name (for instance,
- xy0). This can also
be accomplished by specifying a single disk in the disk list.
.TP
.BI \-t " disk-type"
Specify the type of disk which is current upon entry into the program,
A disk's type is specified by name in the data file. This
option can only be used if a disk is being made current as described
above.
.TP
.BI \-p " partition-name"
Specify the partition table for the disk which is current upon entry
into the program. The table is specified by its name as defined in
the data file.  This option can only be used if a disk is being made
current, and its type is either specified or available from the
disk label.
.TP
.B \-s
Silent.  Suppress all of the standard output.  Error messages are still
displayed.  This is generally used in conjunction with the
.B \-f
option.
.SH FILES
.PD 0
.TP 20
.B /etc/format.dat
default data file
.PD
.SH SEE ALSO
.LP
.TX ADMIN
