Arquivotheca/SunOS-4.1.3/man/man8/fpaversion.8
.\" @(#)fpaversion.8 1.1 92/07/30 SMI;
.TH FPAVERSION 8 "28 September 1987"
.SH NAME
fpaversion \- print FPA version, load microcode
.SH SYNOPSIS
.B fpaversion
[
.B \-chlqv
]
[
.B \-t
[
.B cdhimprstvxCIMS
]\|]
.SH AVAILABILITY
.LP
Available only on Sun-3 and Sun-3x systems
equipped with either an
.SM FPA
or an
.SM FPA\s0+.
.SH DESCRIPTION
.IX fpaversion "" "\fLfpaversion\fR \(em floating-point version and tests"
.IX floating-point "version and tests \(em \fLfpaversion\fR"
.LP
.B fpaversion
performs various tests on the
.SM FPA 
or 
.SM FPA\s0+.
Without arguments, it
prints the microcode version number and constants
currently installed on
.BR /dev/fpa .
.B fpaversion
also performs a quick test to ensure proper operation and reports
whether an
.SM FPA
or an
.SM FPA\s+1+
is installed.
.SH OPTIONS
.TP
.B \-c
Continue tests after an error.
.TP
.B \-h
Help.  Print command-line summary.
.TP
.B \-l
Loop through tests infinitely.
.TP
.B \-q
Quiet output.  Print out only error messages.
.TP
.B \-v
Verbose output.
.TP
.B \-t
Specify certain tests:
.RS
.TP
.B c
Command register format instructions.
.TP
.B d
Double precision format instructions.
.TP
.B h
Help.  Print summary of test specifiers.
.TP
.B i
Imask register.
.TP
.B m
Mode register.
.TP
.B p
Simple pipe sequencing.
.TP
.B r
User registers for all contexts.
.TP
.B s
Single precision format instructions.
.TP
.B t
Status generation.
.TP
.B v
Print version number and date of microcode, and constants.
Report whether an
.SM FPA
or an
.SM FPA\s0+
is installed.
.TP
.B x
Extended format instructions.
.TP
.B C
Check checksum for microcode, mapping
.SM RAM\s0,
and constant
.SM RAM\s0 
for the
.SM FPA\s0.
Check checksum for microcode 
.SM RAM\s0 
and constant 
.SM RAM\s0 
for the
.SM FPA\s0+.
.TP
.B I
Allows interactive reads and writes to the
.SM FPA\s0.
.TP
.B M
Command register format matrix instructions.
.TP
.B S
Shadow registers.
.RE
.SH FILES
.PD 0
.TP 30 
.B /dev/fpa
physical
.SM FPA
device
.TP
.B /usr/etc/fpa/fpa_micro_bin
microcode binaries for the
.SM FPA
.TP
.B /usr/etc/fpa/fpa_micro_map
microcode map binaries for the
.SM FPA
.TP
.B /usr/etc/fpa/fpa_constants
microcode data file for the
.SM FPA
.TP
.B /usr/etc/fpa/fpa_micro_bin+
microcode binaries for the
.SM FPA\s0+
.TP
.B /usr/etc/fpa/fpa_constants+
microcode data file for the
.SM FPA\s0+
.TP
.B /usr/etc/fpa/fpa_download
microcode loader
.PD
.SH "SEE ALSO"
.BR fpa_download (8),
.BR fparel (8),
.BR sundiag (8)
.SH "DIAGNOSTICS"
.LP
If a test fails, its name, along with the actual and expected results will
be printed.
