Arquivotheca/SunOS-4.1.3/man/man8/fsirand.8
.\" @(#)fsirand.8 1.1 92/07/30 SMI;
.TH FSIRAND 8 "9 September 1987"
.SH NAME
fsirand \- install random inode generation numbers
.SH SYNOPSIS
.B fsirand
[
.B \-p
]
.I special
.SH DESCRIPTION
.IX  "fsirand command"  ""  "\fLfsirand\fP \(em install random inode generation numbers"
.B fsirand
installs random inode generation numbers on all the inodes on device
.I special,
and also installs a filesystem
.SM ID
in the superblock.
This helps increase the security of filesystems exported by
.SM NFS\s0.
.LP
.B fsirand
must be used only on an unmounted filesystem
that has been checked with
.BR fsck (8).
The only exception is that it can be used
on the root filesystem in single-user mode,
if the system is immediately re-booted afterwords.
.SH OPTIONS
.TP
.B \-p
Print out the generation numbers for all the inodes,
but do not change the generation numbers.
.SH SEE ALSO
.BR fsck (8)
