Arquivotheca/SunOS-4.1.3/man/man8/htable.8
.\" @(#)htable.8 1.1 92/07/30 SMI; from UCB 4.1
.TH HTABLE 8 "9 September 1987"
.SH NAME
htable \- convert DoD Internet format host table
.SH SYNOPSIS
.B /usr/etc/htable
.I filename
.SH DESCRIPTION
.IX  "htable command"  ""  "\fLhtable\fP \(em convert DoD Internet format host table"
.B htable
converts a host table in the format specified by
.SM RFC
952 to the format used by the network
library routines.  Three files are created as a result
of running
.BR htable :
.BR hosts ,
.BR networks ,
and
.BR gateways .
The
.B hosts
file is used by the
.BR gethostent (3N)
routines in mapping host names to addresses.  The
.B networks
file is used by the
.BR getnetent (3N)
routines in mapping network names to numbers.
The
.B gateways
file is used by the routing daemon
in identifying ``passive'' Internet gateways;
see
.BR routed (8C)
for an explanation.
.LP
If any of the files
.BR localhosts ,
.BR localnetworks ,
or
.B localgateways
are present in the current directory,
the file's contents is prepended to the
output file without interpretation.  This
allows sites to maintain local aliases and
entries which are not normally present in the
master database.
.LP
.B htable
is best used in conjunction with the
.BR gettable (8C)
program which retrieves the DoD Internet host table from a host.
.SH FILES
.PD 0
.TP 20
.B localhosts
.TP
.B localnetworks
.TP
.B localgateways
.PD
.SH "SEE ALSO"
.BR intro (3),
.BR gethostent (3N),
.BR getnetent (3N),
.BR gettable (8C),
.BR routed (8C)
.LP
Harrenstien, Ken, Mary Stahl, and Elizabeth Feinler,
.IR "DoD Internet Host Table Specification" ,
.SM RFC
952,
Network Information Center,
.SM SRI
International, Menlo Park, Calif.,
October 1985.
.SH BUGS
Does not properly calculate the
.B gateways
file.
