Arquivotheca/SunOS-4.1.3/man/man8/icheck.8
.\" @(#)icheck.8 1.1 92/07/30 SMI; from UCB 4.2
.TH ICHECK 8  "9 September 1987"
.SH NAME
icheck \- file system storage consistency check
.SH SYNOPSIS
.B /usr/etc/icheck
[
.B \-s
]
.B \-b
.I numbers
] [
.I filesystem
]
.SH DESCRIPTION
.IX  "icheck command"  ""  "\fLicheck\fP \(em file system consistency check"
.IX  "file system"  "check consistency"  "file system"  "check consistency \(em \fLicheck\fP"
.LP
Note:
.B icheck
has been superseded for normal consistency checking by
.BR fsck (8).
.LP
.B icheck
examines a file system,
builds a bit map of used blocks,
and compares this bit map against
the free list maintained on the file system.
The normal output of
.B icheck
includes a report of
.IP
The total number of files and the numbers of
regular, directory, block special and character special files.
.IP
The total number of blocks in use and the numbers of
single-, double-, and triple-indirect blocks and directory blocks.
.IP
The number of free blocks.
.IP
The number of blocks missing; that is, not in any file
nor in the free list.
.LP
With the
.B \-s
option
.B icheck
ignores the actual free list and reconstructs a new one
by rewriting the superblock of the file system.
The file system should be dismounted while this is done;
if this is not possible (for example if
the root file system has to be salvaged)
care should be taken that the system is quiescent and that
it is rebooted immediately afterwards so that the old, bad in-core
copy of the superblock will not continue to be used.
Notice also that
the words in the superblock
which indicate the size of the free list and of the
i-list are believed.
If the superblock has been curdled
these words will have to be patched.
The
.B \-s
option
suppresses the normal output reports.
.LP
Following the
.B \-b
option is a list of block numbers;
whenever any of the named blocks turns up in a file,
a diagnostic is produced.
.LP
.B icheck
is faster if the raw version of the special file is used,
since it reads the i-list many blocks at a time.
.SH "SEE ALSO"
.BR fs (5),
.BR clri (8),
.BR dcheck (8),
.BR fsck (8),
.BR ncheck (8)
.SH DIAGNOSTICS
For duplicate blocks
and bad blocks (which lie outside the file system)
.B icheck
announces the difficulty, the i-number, and the kind of block involved.
If a read error is encountered,
the block number of the bad block is printed and
.B icheck
considers it to contain 0.
.TP
.B Bad freeblock
means that a block number outside the
available space was encountered in the free list.
.TP
.IB n " dups in free"
means that
.I n
blocks were found in the free list which
duplicate blocks either in some file or
in the earlier part of the free list.
.SH BUGS
Since
.B icheck
is inherently two-pass in nature, extraneous diagnostics
may be produced if applied to active file systems.
.LP
It believes even preposterous superblocks and
consequently can get core images.
.LP
The system should be fixed so that the reboot after fixing the root
file system is not necessary.
