Arquivotheca/SunOS-4.1.3/man/man8/install_small_kernel.8
.\" @(#)install_small_kernel.8 1.1 92/07/30 SMI;  new for 4.1
.TH INSTALL_SMALL_KERNEL 8 "7 October 1990"
.SH NAME
install_small_kernel \- install a small, pre-configured  kernel
.SH SYNOPSIS
.B /usr/etc/install/install_small_kernel 
[
.I hostname
]
\&.\|.\|.
.SH DESCRIPTION
.LP
.B install_small_kernel
is a script that installs a small, pre-configured kernel,
.SB GENERIC_SMALL
on a host.
This kernel supports approximately four users, and is only
available for the following configurations:
.LP
.RS
.nf
Sun-3/50 and Sun-3/60 systems with up to 2 \s-1SCSI\s0 disks, 
    1 \s-1SCSI\s0 tape
Sun-3/80 systems with up to 4 \s-1SCSI\s0 disks, 1 \s-1SCSI\s0 tape
Sun-4/110 systems with up to 2 \s-1SCSI\s0 disks, 1 \s-1SCSI\s0 tape
\s-1SPARC\s0system 330 systems with up to 4 \s-1SCSI\s0 disks,
    1 \s-1SCSI\s0 tape
\s-1SPARC\s0station 1, 1+, and 2 systems with up to 8 \s-1SCSI\s0 
    disks, 4 \s-1SCSI\s0 tapes, 2 CD-ROM drives, 1 floppy disk
.fi
.RE
.LP
If
.I hostname
is a server that does not fit any of the above configurations,
.B install_small_kernel
can be used to install the small kernel on its clients.
.LP
If no hostnames are specified,
.B install_small_kernel
cycles through all the clients configured for a server
to determine the small kernel installs to be made.
If the
.RB ' small_kernel '
flag in the client file,
.BI /etc/install/client. hostname
is set to 
.RB ' yes ',
that client will not be processed.
To force re-installation of a small kernel on any clients,
simply call
.B install_small_kernel
with the appropriate client names.
.LP
.B install_small_kernel
prompts for confirmation before actually
doing the install on any host.
.LP
.B install_small_kernel
is executable from the miniroot, as well
as single-user and multi-user modes.
It supports standalone and server configuration in all cases,
but dataless systems are supported in multi-user mode only.
This script is restricted to the super-user.
.SH FILES
.PD 0
.TP 20
.B /usr/sys/sun\fIarch\fP/conf/\s-1GENERIC_SMALL\s0
kernel configuration file for
.I arch
.BI /usr/install/client. hostname
.PD
.SH SEE ALSO
.BR add_client (8),
.BR add_services (8),
.BR rm_client (8).
.BR suninstall (8)
.LP
.TX ADMIN
