Arquivotheca/SunOS-4.1.3/man/man8/makedev.8
.\" @(#)makedev.8 1.1 92/07/30 SMI; from UCB 4.2
.TH MAKEDEV 8 "9 September 1987"
.SH NAME
makedev, MAKEDEV \- make system special files
.SH SYNOPSIS
.B /dev/\s-1MAKEDEV\s0
.I device-name
\&.\|.\|.
.SH DESCRIPTION
.IX  "makedev command"  ""  "\fLmakedev\fP \(em make system special files"
.IX  make "system special files \(em \fLmakedev\fP"
.IX  "system special files"  ""  "system special files \(em \fLmakedev\fP"
.IX  "special files"  ""  "special files \(em \fLmakedev\fP"
.SB MAKEDEV
is a shell script normally used to install
special files.  It resides in the
.B /dev
directory, as this is the normal location
of special files.  Arguments to
.SB MAKEDEV
are usually of the form
.I device-name?
where
.I device-name
is one of the supported devices listed
in section 4 of the manual and
.RI ` ? '
is a logical unit number (0-9).
A few special arguments create assorted
collections of devices and are listed below.
.TP
.B std
Create the
.I standard
devices for the system; for example,
.BR /dev/console ,
.BR /dev/tty .
.TP
.B local
Create those devices specific to the local site.  This
request runs the shell file
.BR /dev/\s-1MAKEDEV\s0.local .
Site specific commands, such as those
used to setup dialup lines as ``ttyd?''
should be included in this file.
.LP
Since all devices are created using
.BR mknod (8),
this shell script is useful only to the super-user.
.SH FILES
.B /dev/console
.B /dev/\s-1MAKEDEV\s0.local
.B /dev/tty
.SH "SEE ALSO"
.BR intro (4),
.BR config (8),
.BR mknod (8)
.SH DIAGNOSTICS
Either self-explanatory, or generated by one of the programs
called from the script.  Use
.B "sh \-x \s-1MAKEDEV\s0"
in case of trouble.
