Arquivotheca/SunOS-4.1.3/man/man8/mc68881version.8
.\" @ (#)mc68881version.8 1.2 86/07/16 SMI
.TH MC68881VERSION 8 "28 May 1988"
.SH NAME
mc68881version \- print the MC68881 mask number and approximate clock rate
.SH SYNOPSIS
.B /usr/etc/mc68881version
.SH AVAILABILITY
Sun-2, Sun-3, and Sun-4 systems only.
.SH DESCRIPTION
.IX  "mc68881version command"  ""  "\fLmc68881version\fP \(em display MC68881 version"
.B mc68881version
determines whether an
.SM MC\s068881
or
.SM MC\s068882
floating-point coprocessor is available,
and if so, determines its apparent mask number and
approximate clock rate and prints them
on the standard output.
The reported clock rate is derived by timing floating-point
operations with
.BR getrusage (2)
and is thus somewhat variable; best results may be obtained
in single-user mode.
The same applies to the differentiation between 
.SM MC\s068881
and
.SM MC\s068882 ;
these can be distinguished in user mode only by timing tests.
.SH SEE ALSO
.BR getrusage (2)
