Arquivotheca/SunOS-4.1.3/man/man8/ncheck.8
.\" @(#)ncheck.8 1.1 92/07/30 SMI; from UCB 4.2
.TH NCHECK 8  "7 September 1988"
.SH NAME
ncheck \- generate names from i-numbers
.SH SYNOPSIS
.B /usr/etc/ncheck
[
.B \-i
.I numbers
]  [
.B \-as
]
.I filesystem
.SH DESCRIPTION
.IX  "ncheck command"  ""  "\fLncheck\fP \(em convert i-numbers to filenames"
.TP
Note:
For most normal file system maintenance, the function of
.B ncheck
is subsumed by
.BR fsck (8).
.LP
.B ncheck
generates a pathname versus i-number list of files for the indicated
.IR filesystem .
Names of directory files are followed
by
.RB ` . '
.LP
The report is in no useful order, and probably should be sorted.
.SH OPTIONS
.TP
.BI \-i " numbers"
Report only those files whose i-\fInumbers\fP
follow.
.TP
.B \-a
Print the names
.RB ` . '
and
.RB ` .\|. ',
which are ordinarily suppressed.
.TP
.B \-s
Report only special files and files with set-user-\s-1ID\s0 mode.
This is intended to discover concealed violations of security policy.
.SH "SEE ALSO"
.BR sort (1V),
.BR dcheck (8),
.BR fsck (8),
.BR icheck (8)
.SH DIAGNOSTICS
When the filesystem structure is improper,
.RB ` ?? '
denotes the ``parent'' of
a parentless file and a pathname beginning with
.RB ` .\|.\|. '
denotes a loop.
