Arquivotheca/SunOS-4.1.3/man/man8/netstat.8c
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\" @(#)netstat.8c 1.1 92/07/30 SMI; from UCB 6.5 5/8/86
.\"
.TH NETSTAT 8C "6 January 1989"
.SH NAME
netstat \- show network status
.SH SYNOPSIS
.B netstat
[
.B \-aAn
] [
.B \-f
.I address_family
] [
.B system
] [
.B core
]
.LP
.B netstat
[
.B \-n
] [
.B \-s
] [
.BR \-m " |"
.BR \-i " |"
.B  \-r
] [
.B \-f
.I address_family
] [
.B system
] [
.B core
]
.LP
.B netstat
[
.B \-n
] [
.B \-I
.I interface
]
.I interval
[
.B system
] [
.B core
]
.SH AVAILABILITY
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "netstat command"  ""  "\fLnetstat\fP \(em display network status"
.IX  "network status, display \(em \fLnetstat\fP"
.IX  "status of network, display"  ""  "status of network, display \(em \fLnetstat\fR"
.LP
.B netstat
displays the contents of various network-related data structures
in various formats, depending on the options you select.
.LP
The first form of the command displays a list of active sockets for
each protocol.  The second form selects one from among various
other network data structures.  The third form displays running
statistics of packet traffic on configured network interfaces;
the
.I interval
argument indicates the number of seconds in which to gather
statistics between displays.
.LP
The default value for the
.B system
argument is
.BR /vmunix ;
for
.IR core ,
the default is
.BR /dev/kmem .
.SH OPTIONS
.TP 15
.B \-a
Show the state of all sockets; normally
sockets used by server processes are not shown.
.TP
.B \-A
Show the address of any protocol control
blocks associated with sockets; used for debugging.
.TP
.BI \-f " address_family"
Limit statistics or address control block reports to those of the
specified
.IR address_family ,
which can be one of:
.RS
.RS
.TP 8
.B inet
.PD 0
For the
.SM
AF_INET
address family, or
.\".TP
.\".IR ns ,
.\".BR AF_NS ,
.TP
.B unix
For the
.SM AF_UNIX
family.
.PD
.RE
.RE
.TP
.B \-i
Show the state of interfaces that have been auto-configured.
Interfaces that are statically configured into a system, but
not located at boot time, are not shown.
.TP
.BI \-I " interface"
Highlight information about the indicated
.IR interface
in a separate column; the default (for the third form of the
command) is the interface with the most traffic since the
system was last rebooted.
.I interface
can be any valid interface listed in the system configuration file,
such as
.B ie0
or
.BR le0 .
.TP
.B \-m
Show the statistics recorded by management routines for the
network's private buffer pool.
.TP
.B \-n
Show network addresses as numbers.
.B netstat
normally displays addresses as
symbols.  This option may be used with any of the display formats.
.TP
.B \-r
Show the routing tables.  (When
.B \-s
is also present, show routing statistics instead.)
.TP
.B \-s
Show per-protocol statistics.  When used with the
.B \-r
option, show routing statistics.
.TP
.B \-t
Replace queue length information with timer information.
.SH DISPLAYS
.SS "Active Sockets (First Form)"
.LP
The display for each active socket shows the local and remote address,
the send and receive queue sizes (in bytes),
the protocol, and the internal state of the protocol.
.br
.ne 8
.LP
The symbolic format normally used to
display socket addresses is either:
.IP
.IB hostname .\c
.IR \|port
.LP
when the name of the host is specified, or:
.IP
.IB network .\c
.IR \|port
.LP
if a socket address specifies a network but no specific host.
Each
.I hostname
and
.I network
is shown according to its entry in the
.B /etc/hosts
or the
.B /etc/networks
file, as appropriate.
.LP
If the network or hostname for an address is not known (or if the
.B \-n
option is specified), the numerical network address is shown.
Unspecified, or ``wildcard'', addresses and ports appear as ``*''.
(For more information regarding the Internet naming conventions,
refer to
.BR inet (3N)\|).
.SS "\fI\s-1TCP\s0 Sockets"
.LP
The possible state values for
.SM TCP
sockets are as follows:
.RS
.TP 20
.SB CLOSED
Closed: the socket is not being used.
.PD 0
.TP
.SB LISTEN
Listening for incoming connections.
.TP
.SB SYN_SENT
Actively trying to establish connection.
.TP
.SB SYN_RECEIVED
Initial synchronization of the connection under way.
.TP
.SB ESTABLISHED
Connection has been established.
.TP
.SB CLOSE_WAIT
Remote shut down: waiting for the socket to close.
.TP
.SB FIN_WAIT_1
Socket closed, shutting down connection.
.TP
.SB CLOSING
Closed, then remote shutdown: awaiting acknowledgement.
.TP
.SB LAST_ACK
Remote shut down, then closed: awaiting acknowledgement.
.TP
.SB FIN_WAIT_2
Socket closed, waiting for shutdown from remote.
.TP
.SB TIME_WAIT
Wait after close for remote shutdown retransmission.
.PD
.RE
.SS "Network Data Structures (Second Form)"
.LP
The form of the display depends upon which of the
.BR \-m ,
.BR \-i ,
.BR \-h
or
.BR \-r ,
options you select.  (If you specify more than one of these options,
.B netstat
selects one in the order listed here.)
.SS "\fIRouting Table Display"
.LP
The routing table display lists the available routes and the status
of each.  Each route consists of a destination host or network,
and a gateway to use in forwarding packets.  The
.I flags
column shows the status of the route
.RB ( U
if ``up''),
whether the route is to a gateway
.RB ( G ),
and whether the route was created dynamically by a redirect
.RB ( D ).
.LP
Direct routes are created for each
interface attached to the local host;
the gateway field for such entries shows the address of the outgoing
interface.
.LP
The
.B refcnt
column gives the current number of active uses per route.
(Connection-oriented protocols normally hold on to a single route
for the duration of a connection,
whereas connectionless protocols obtain a route while sending
to the same destination.)
.LP
The
.B use
column displays the number of packets sent per route.
.LP
The
.I interface
entry indicates the network interface utilized for the route.
.SS "Cumulative Traffic Statistics (Third Form)"
.LP
When the
.I interval
argument is given,
.B netstat
displays a table of
cumulative statistics regarding packets transferred, errors and
collisions, the network addresses for the interface, and the maximum
transmission unit (``mtu'').
The first line of data displayed, and every 24th line thereafter,
contains cumulative statistics from the time the system was last
rebooted.  Each subsequent line shows incremental statistics for the
.I interval
(specified on the command line) since the previous display.
.SH "SEE ALSO"
.BR hosts (5),
.BR networks (5),
.BR protocols (5),
.BR services (5)
.BR iostat (8),
.BR trpt (8C),
.BR vmstat (8),
.SH BUGS
The notion of errors is ill-defined.
Collisions mean something else for the
.SM IMP\s0.
.LP
The kernel's tables can change while
.B netstat
is examining them, creating incorrect or partial displays.
