Arquivotheca/SunOS-4.1.3/man/man8/pac.8
.\" @(#)pac.8 1.1 92/07/30 SMI; from UCB 4.2
.TH PAC 8 "10 October 1988"
.SH NAME
pac \- printer/plotter accounting information
.SH SYNOPSIS
.B /usr/etc/pac
[
.B \-cmrs
] [
.BI \-P printer
] [
.BI \-p price
] [
.IR username .\|.\|.
]
.SH DESCRIPTION
.IX  "pac command"  ""  "\fLpac\fP \(em printer/plotter accounting"
.IX  "printer/plotter accounting"
.B pac
reads the printer/plotter accounting files, accumulating the number
of pages (the usual case) or feet (for raster devices)
of paper consumed by each user, and printing out
how much each user consumed in pages or feet and dollars.
The accounting file is taken from the 
.B af
field of the 
.B printcap 
entry for the printer. If any
.IR username s
are specified, then statistics are only printed for those users;
usually, statistics are printed for every user who has used any paper.
.SH OPTIONS
.TP 10
.B \-c
Sort the output by cost; usually the output is sorted alphabetically by name.
.TP
.B \-m
Disregard machine names.  Normally, print jobs submitted by a
user from different machines would be counted separately for
each machine.
.TP
.B \-r
Reverse the sorting order.
.TP
.B \-s
Summarize the accounting information on
the summary accounting file.
The name of the summary file is the name of the accounting file with
.RB ` _sum '
appended to it.
.TP
.BI \-P printer
Do accounting for the named
.IR printer .
If this option is not used, the printer specified by the 
.SM PRINTER
environment variable will be used if it is present; 
otherwise accounting is done for the default printer.
.TP
.BI \-p price
Use the value
.I price
for the cost in dollars per page/foot instead of 
the default value of 0.02.
.SH FILES
.PD 0
.TP 20
.B /etc/printcap
.PD
.SH SEE ALSO
.BR printcap (5)
.SH BUGS
The relationship between the computed price and reality is
as yet unknown.
