Arquivotheca/SunOS-4.1.3/man/man8/ping.8c
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\" @(#)ping.8c 1.1 92/07/30 SMI; from UCB 4.3 BSD
.\"
.TH PING 8C "10 May 1988"
.UC 6
.SH NAME
ping \- send ICMP ECHO_REQUEST packets to network hosts
.SH SYNOPSIS
.B /usr/etc/ping
.I host
[
.I timeout
]
.LP
.B /usr/etc/ping
[
.B \-s
] [
.B \-lrRv
]
.I host
[
.I packetsize
] [
.I count
]
.SH AVAILABILITY
.LP
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "ping command"  ""  "\fLping\fP \(em debug network"
.IX  "network debugging"  ""  "network debugging \(em \fLping\fP"
.IX  "debug network"  ""  "debug network \(em \fLping\fP"
.LP
.B ping
utilizes the
.SM ICMP
protocol's mandatory
.SM ECHO_REQUEST
datagram to elicit an
.SM ICMP ECHO_RESPONSE
from the specified
.I host ,
or network gateway.
.SM ECHO_REQUEST
datagrams, or \*(lqpings,\*(rq have an
.SM IP
and
.SM ICMP
header, followed by a
.IR struct timeval ,
and then an arbitrary
number of bytes to pad out the packet.
If
.I host
responds,
.B ping
will print
.IB host " is alive"
on the standard output and exit.  Otherwise after
.I timeout
seconds, it will write
.BI "no answer from " host\fR.
The default value of
.I timeout
is 20 seconds.
.LP
When the
.B \-s
flag is specified,
.B ping
sends one datagram per second, and
prints one line of output for every
.SM ECHO_RESPONSE
that it receives.  No output is produced if there is no response.
In this second form,
.B ping
computes round trip times and packet loss statistics;
it displays a summary of this information upon termination or timeout.
The default datagram packet size is 64 bytes, or you can specify
a size with the
.I packetsize
command-line argument.  If an optional
.I count
is given,
.B ping
sends only that number of requests.
.LP
When using
.B ping
for fault isolation, first
.RB ` ping '
the local host to verify that the local network interface is running.
.LP
.SH OPTIONS
.TP
.B \-l
Loose source route. Use this option in the
.SM IP
header to send the packet to the given host and back again.
Usually specified with the 
.B \-R
option.
.TP
.B \-r
Bypass the normal routing tables and send directly to a host on an
attached network.  If the host is not on a directly-attached network,
an error is returned.
This option can be used to
.B ping
a local host through an interface that has been dropped by the
router daemon, see
.BR routed (8C).
.TP
.B \-R
Record route.
Sets the
.SM IP
record route option, which will store the route
of the packet inside the
.SM IP
header.  The contents of the record route
will only be printed if the
.B \-v 
option is given, and only be set on return packets if the target host
preserves the record route option across echos, or the 
.B \-l
option is given.
.TP
.B \-v
Verbose output.  List any
.SM ICMP
packets, other than
.SM ECHO_RESPONSE\s0,
that are received.
.\".SH AUTHOR
.\"Mike Muuss
.SH SEE ALSO
.BR icmp (4P),
.BR ifconfig (8C),
.BR netstat (8C),
.BR rpcinfo (8C),
.BR spray (8C)
