Arquivotheca/SunOS-4.1.3/man/man8/pwck.8v
.\" @(#)pwck.8v 1.1 92/07/30 SMI; from S5R3
.TH PWCK 8V "17 September 1989"
.SH NAME
pwck \- check password database entries
.SH SYNOPSIS
.B /usr/etc/pwck
.RI [ " filename " ]
.SH AVAILABILITY
.LP
This command is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX pwck "" "\fLpwck\fR \(em check password database entries"
.IX "System V commands" "\fLpwck\fR"
.LP
.B pwck
checks that a file in
.BR passwd (5)
does not contain any errors; it checks the
.B /etc/passwd
file by default.
.SH FILES
.PD 0
.TP 20
.B /etc/passwd
.PD
.SH DIAGNOSTICS
.TP
.B "Too many/few fields"
An entry in the password file does not have the proper number of
fields.
.TP
.B "No login name"
The login name field of an entry is empty.
.TP
.B "Bad character(s) in login name"
The login name in an entry contains characters other than lower-case letters
and digits.
.TP
.B "First char in login name not lower case alpha"
The login name in an entry does not begin with a lower-case letter.
.TP
.B "Login name too long"
The login name in an entry has more than 8 characters.
.TP
.B "Invalid UID"
The user 
.SM ID
field in an entry is not numeric or is greater than
65535.
.TP
.B "Invalid GID"
The group 
.SM ID
field in an entry is not numeric or is greater than
65535.
.TP
.B "No login directory"
The login directory field in an entry is empty.
.TP
.B "Login directory not found"
The login directory field in an entry refers to a directory that does not
exist.
.TP
.B "Optional shell file not found."
The login shell field in an entry refers to a program or shell script that
does not exist.
.TP
.B "No netgroup name"
The entry is a 
Network Information Service
(\s-1NIS\s0)
entry referring to a netgroup, but no
netgroup is present.
.TP
.B "Bad character(s) in netgroup name"
The netgroup name in an
.SM NIS
entry contains characters other than
lower-case letters and digits.
.TP
.B "First char in netgroup name not lower case alpha"
The netgroup name in an
.SM NIS
entry does not begin with a lower-case letter.
.SH SEE ALSO
.BR group (5),
.BR passwd (5)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
