Arquivotheca/SunOS-4.1.3/man/man8/quotaon.8
.\" @(#)quotaon.8 1.1 92/07/30 SMI; from UCB 4.2
.TH QUOTAON 8 "9 September 1987"
.UC 4
.SH NAME
quotaon, quotaoff \- turn file system quotas on and off
.SH SYNOPSIS
.B /usr/etc/quotaon
[
.B \-v
]
.IR filesystem .\|.\|.
.br
.B /usr/etc/quotaon
[
.B \-av
]
.LP
.B /usr/etc/quotaoff
[
.B \-v
]
.IR filesystem .\|.\|.
.br
.B /usr/etc/quotaoff
[
.B \-av
]
.SH DESCRIPTION
.SS quotaon
.IX  "quotaon command"  ""  "\fLquotaon\fP \(em turn file system quotas on"
.IX  "user quotas"  "quotaon command"  ""  "\fLquotaon\fP \(em turn file system quotas on"
.IX  "disk quotas"  "quotaon command"  ""  "\fLquotaon\fP \(em turn file system quotas on"
.IX  "quotas"  "quotaon command"  ""  "\fLquotaon\fP \(em turn file system quotas on"
.IX  "file system"  "quotaon command"  ""  "\fLquotaon\fP \(em turn file system quotas on"
.LP
.B quotaon
announces to the system that disk quotas should be enabled on one or
more file systems.  The file systems specified must be mounted at the
time.  The file system quota files must be present in the root
directory of the specified file system and be named
.IR quotas .
.SS quotaoff
.IX  "quotaoff command"  ""  "\fLquotaoff\fP \(em turn file system quotas off"
.IX  "user quotas"  "quotaoff command"  ""  "\fLquotaoff\fP \(em turn file system quotas off"
.IX  "disk quotas"  "quotaoff command"  ""  "\fLquotaoff\fP \(em turn file system quotas off"
.IX  "quotas"  "quotaoff command"  ""  "\fLquotaoff\fP \(em turn file system quotas off"
.IX  "file system"  "quotaoff command"  ""  "\fLquotaoff\fP \(em turn file system quotas off"
.LP
.B quotaoff
announces to the system that file systems specified should
have any disk quotas turned off.
.SH OPTIONS
.SS quotaon
.TP
.B \-a
All file systems in
.B /etc/fstab
marked read-write with quotas
will have their quotas turned on.  This is normally used at
boot time to enable quotas.
.TP
.B \-v
Display a message for each file system where quotas are turned on.
.SS quotaoff
.TP
.B \-a
Force all file systems in
.B /etc/fstab
to have their quotas disabled.
.TP
.B \-v
Display a message for each file system affected.
.LP
These commands
update the status field of devices located in
.B /etc/mtab
to indicate when quotas are on or off for each file system.
.SH FILES
.PD 0
.TP 20
.B quotas
quota file at the file system root
.TP
.B /etc/mtab
mounted file systems
.TP
.B /etc/fstab
default file systems
.PD
.SH "SEE ALSO"
.BR quotactl (2),
.BR fstab (5),
.BR mtab (5)
