Arquivotheca/SunOS-4.1.3/man/man8/quot.8
.\" @(#)quot.8 1.1 92/07/30 SMI; from UCB 4.2
.TH QUOT 8 "9 September 1987"
.SH NAME
quot \- summarize file system ownership
.SH SYNOPSIS
.B /usr/etc/quot
[
.B \-acfhnv
] [
.I filesystem
]
.SH DESCRIPTION
.IX  "quot command"  ""  "\fLquot\fP \(em summarize file system ownership"
.IX  "file system"  "summarize ownership"  ""  "summarize ownership \(em \fLquot\fP"
.B quot
displays the number of blocks (1024 bytes) in the named
.I filesystem
currently owned by each user.
.SH OPTIONS
.TP
.B \-a
Generate a report for all mounted file systems.
.TP
.B \-c
Display three columns giving file size in blocks, number of
files of that size, and cumulative total of blocks
in that size or smaller file.
.TP
.B \-f
Display count of number of files as well as space owned by each user.
.TP
\fB\-h
Estimate the number of blocks in the file \(em this doesn't account for
files with holes in them.
.TP
.B \-n
Run the pipeline
.B "ncheck filesystem | sort +0n | quot \-n filesystem"
to produce a list of all files and their owners.
.TP
\fB\-v
Display three columns containing the number of blocks not accessed in
the last 30, 60, and 90 days.
.SH FILES
.PD 0
.TP 20
.B /etc/mtab
mounted file systems
.TP
.B /etc/passwd
to get user names
.PD
.SH "SEE ALSO"
.BR du (1V),
.BR ls (1V)
