Arquivotheca/SunOS-4.1.3/man/man8/rfstop.8
.\" @(#)rfstop.8 1.1 92/07/30 SMI; from S5R3
.TH RFSTOP 8 "30 June 1988"
.SH NAME
rfstop \- stop the RFS environment
.SH SYNOPSIS
.B rfstop
.SH AVAILABILITY
.LP
This program is available with the
.I \s-1RFS\s0
software installation option.
Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "rfstop stop" "" "\fLrfstop\fP \(em stop the RFS environment" ""
.IX stop "RFS environment" stop "\s-1RFS\s0 environment"
.IX RFS "stop environment" "\s-1RFS\s0" "stop environment"
.IX disconnect "host from RFS environment" "disconnect" "host from \s-1RFS\s0 environment"
.LP
.B rfstop
disconnects a host from the Remote File Sharing
(\s-1RFS\s0)
environment until another
.BR rfstart (8)
is executed.
.LP
When executed on the domain name server,
the domain name server responsibility
is moved to a secondary name server as designated in the
.B rfmaster
file.
.LP
This command is restricted to the super-user.
.LP
If any of the following is true,
an error message will be sent to standard error.
.RS
.TP 3
\(bu
There are resources currently advertised by this host.
.TP
\(bu
Resources from this machine are still remotely
mounted by other hosts.
.TP
\(bu
There are still remotely mounted resources in the
local file system tree.
.TP
\(bu
.BR rfstart (8)
had not previously been executed.
.TP
\(bu
The command is not run with super-user privileges.
.RE
.SH "SEE ALSO"
.BR rfmaster (5),
.BR adv (8),
.BR mount (8),
.BR rfadmin (8),
.BR rfstart (8),
.BR unadv (8)
