Arquivotheca/SunOS-4.1.3/man/man8/rlogind.8c
.\" @(#)rlogind.8c 1.1 92/07/30 SMI; from UCB 4.2
.TH RLOGIND 8C "9 September 1987"
.SH NAME
rlogind, in.rlogind \- remote login server
.SH SYNOPSIS
.B /usr/etc/in.rlogind
.IB host . port
.SH DESCRIPTION
.IX  "rlogind command"  ""  "\fLrlogind\fP \(em remote login server"
.IX  "remote login" "server \(em \fLrlogind\fP"
.IX  servers  rlogind  ""  "\fLrlogind\fP \(em remote login server"
.B rlogind
is the server for the
.BR rlogin (1C)
program.  The server provides a remote login facility
with authentication based on privileged port numbers.
.LP
.B rlogind
is invoked by
.BR inetd (8C)
when a remote login connection is established,
and executes the following protocol:
.TP
\(bu
The server checks the client's source port.
If the port is not in the range 0-1023, the server
aborts the connection.  The client's address and port number
are passed as arguments to
.B rlogind
by
.B inetd
in the form
.IB host . port
with host in hex and port in decimal.
.TP
\(bu
The server checks the client's source address.
If the address is associated with a host for which no
corresponding entry exists in the host name data base (see
.BR hosts (5)),
the server aborts the connection.
.LP
Once the source port and address have been checked,
.B rlogind
allocates a pseudo-terminal (see
.BR pty (4)),
and manipulates file descriptors so that the slave
half of the pseudo-terminal becomes the
.BR stdin ,
.BR stdout ,
and
.B stderr
for a login process.
The login process is an instance of the
.BR login (1)
program, invoked with the
.B \-r
option.  The login process then proceeds with the authentication
process as described in
.BR rshd (8C),
but if automatic authentication fails, it reprompts the user
to login as one finds on a standard terminal line.
.LP
The parent of the login process manipulates the master side of
the pseudo-terminal, operating as an intermediary
between the login process and the client instance of the
.B rlogin
program.  In normal operation, the packet protocol described
in
.BR pty (4)
is invoked to provide
.BR ^S / ^Q
type facilities and propagate
interrupt signals to the remote programs.  The login process
propagates the client terminal's baud rate and terminal type,
as found in the environment variable,
.BR TERM\s0 ;
see
.BR environ (5V).
.SH "SEE ALSO
.BR inetd (8C)
.SH DIAGNOSTICS
All diagnostic messages are returned on the connection
associated with the
.BR stderr ,
after which any network connections are closed.
An error is indicated by a leading byte with a value of 1.
.TP
.B Hostname for your address unknown.
No entry in the host name database existed for
the client's machine.
.TP
.B Try again.
A
.I fork
by the server failed.
.TP
.BR /usr/bin/sh: " .\|.\|."
The user's login shell could not be started.
.SH BUGS
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an \*(lqopen\*(rq environment.
.LP
A facility to allow all data exchanges to be encrypted should be
present.
