Arquivotheca/SunOS-4.1.3/man/man8/rmntstat.8
.\" @(#)rmntstat.8 1.1 92/07/30 SMI; from S5R3
.TH RMNTSTAT 8 "30 June 1988"
.SH NAME
rmntstat \- display RFS mounted resource information
.SH SYNOPSIS
.B rmntstat
[
.B \-h
] [
.I resource
]
.SH AVAILABILITY
.LP
This program is available with the
.I \s-1RFS\s0
software installation option.
Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "rmntstat display" "" "\fLrmnstat\fP \(em display mounted resource information"
.IX "resource" "display mounted resource information"
.IX RFS "display mounted resource information" "\s-1RFS\s0" "display mounted resource information"
.IX "mount" "display mounted resource information"
.LP
When used with no options,
.B rmntstat
displays a list of all
local Remote File Sharing resources that are remotely
mounted, the local path name, and the corresponding clients.
.B rmntstat
returns the remote mount data regardless of whether a
resource is currently advertised; this ensures that resources that have been
unadvertised but are still remotely mounted are included in the report.
When a
.I resource
is specified,
.B rmntstat
displays the remote mount information only for that resource.
.LP
This command is restricted to the super-user.
.SH OPTIONS
.TP
.B \-h
Omit header information from the display.
.SH "EXIT STATUS"
.LP
If no local resources are remotely mounted,
.B rmntstat
will return a successful exit status.
.SH ERRORS
.LP
If
.I resource
does not physically reside on the local machine or
is an invalid resource name, an error message will be sent to
standard error.
.SH "SEE ALSO"
.BR mount (8),
.BR fumount (8),
.BR unadv (8)
