Arquivotheca/SunOS-4.1.3/man/man8/route.8c
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\" @(#)route.8c 1.1 92/07/30 SMI; from UCB 4.3
.\"
.TH ROUTE 8C "3 August 1988"
.SH NAME
route \- manually manipulate the routing tables
.SH SYNOPSIS
.B /usr/etc/route
[
.B \-fn
]
.BR add \||\| delete
[
.BR host \||\| net
]
.I destination
[
.I gateway
[
.I metric
] ]
.SH AVAILABILITY
.LP
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "route command"  ""  "\fLroute\fP \(em manipulate routing tables"
.LP
.B route
manually manipulates the network routing tables normally maintained by
the system routing daemon,
.BR routed (8C),
or through default routes and redirect messages from routers.
.B route
allows the super-user to operate directly on the routing table
for the specific host or network indicated by
.IR destination .
The
.I gateway
argument, if present, indicates the network gateway to which packets
should be addressed.  The
.I metric
argument indicates the number of \*(lqhops\*(rq to the
.IR destination .
The
.I metric
is required for
.I add
commands; it must be zero if the destination is on a directly-attached network,
and nonzero if the route utilizes one or more gateways.
.LP
The
.B add
command instructs
.B route
to add a route to
.IR destination .
.B delete
deletes a route.
.LP
Routes to a particular host must be distinguished from those to
a network.
The optional keywords
.B net
and
.B host
force the destination to be interpreted as a network or a host, respectively.
Otherwise, if the destination has a \*(lqlocal address part\*(rq of
\fB\s-1INADDR_ANY\s0\fP,
then the route is
assumed to be to a network; otherwise, it is presumed to be a
route to a host.  
If the route is to a destination connected
by a gateway, the
.I metric
parameter should be greater than 0.  
If adding a route with metric 0,
the gateway given is the address of this host on the common network,
indicating the interface to be used directly for transmission.
All symbolic names specified for a
.I destination
or
.I gateway
are looked up in the hosts database using
.B gethostbyname(\|)
(see
.BR gethostent (3N)).
If this lookup fails, then the name is looked up
in the networks database using
.B getnetbyname(\|)
(see
.BR getnetent (3N)).
\*(lqdefault\*(rq is also a valid destination,
which is used for all routes if there is
no specific host or network route.
.SH OPTIONS
.TP
.B \-f
Flush the routing tables of all gateway entries.
If this is used in conjunction with one of the commands
described above,
.B route
flushes the gateways before performing the command.
.TP
.B \-n
Prevents attempts to print host and network names symbolically
when reporting actions.
This is useful, for example, when all name servers are down on your
local net, so you need a route before you can contact the name server.
.SH FILES
.PD 0
.TP 20
.B /etc/hosts
.TP
.B /etc/networks
.PD
.SH "SEE ALSO"
.BR ioctl (2),
.BR gethostent (3N),
.BR getnetent (3N),
.BR routing (4N),
.BR routed (8C)
.SH DIAGNOSTICS
.HP
.BR add " ["
.BR host \||\| net ]
.IR destination : gateway
.br
The specified route is being added to the tables.  The
values printed are from the routing table entry supplied
in the
.BR ioctl (2)
call.
.HP
.BR delete " ["
.BR host \||\| net ]
.IR destination : gateway
.br
The specified route is being deleted.
.TP
.IB "destination" done
When the
.B \-f
flag is specified, each routing table entry deleted
is indicated with a message of this form.
.br
.ne 3
.TP
.B "Network is unreachable"
An attempt to add a route failed because the gateway listed was
not on a directly-connected network.  Give the next-hop gateway
instead.
.br
.ne 8
.TP
.B "not in table"
A delete operation was attempted for an entry that
is  not in the table.
.TP
.B "routing table overflow"
An add operation was attempted, but the system was
unable to allocate memory to create the new entry.
