Arquivotheca/SunOS-4.1.3/man/man8/rshd.8c
.\" @(#)rshd.8c 1.1 92/07/30 SMI; from UCB 4.2
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH RSHD 8C "9 September 1987"
.SH NAME
rshd, in.rshd \- remote shell server
.SH SYNOPSIS
.B /usr/etc/in.rshd
.IB host . port
.SH DESCRIPTION
.IX  "rshd command"  ""  "\fLrshd\fP \(em remote shell server"
.IX  "remote shell server"  ""  "remote shell server \(em \fLrshd\fP"
.IX  servers  rshd  ""  "\fLrshd\fP \(em remote shell server"
.B rshd
is the server for the
.BR rcmd (3N)
routine and, consequently, for the
.BR rsh (1C)
program.  The server provides remote execution facilities
with authentication based on privileged port numbers.
.LP
.B rshd
is invoked by
.BR inetd (8C)
each time a shell service is requested, and executes the
following protocol:
.TP
\(bu
The server checks the client's source port.
If the port is not in the range 512-1023, the server
aborts the connection.  The clients host address (in hex)
and port number (in decimal) are the argument passed to
.B rshd.
.TP
\(bu
The server reads characters from the socket up
to a null
.RB ( \e0 )
byte.  The resultant string is
interpreted as an
.SM ASCII
number, base 10.
.TP
\(bu
If the number received in step 1 is non-zero,
it is interpreted as the port number of a secondary
stream to be used for the
.BR stderr .
A second connection is then created to the specified
port on the client's machine.  The source port of this
second connection is also in the range 512-1023.
.TP
\(bu
The server checks the client's source address.
If the address is associated with a host for which no
corresponding entry exists in the host name data base (see
.BR hosts (5)),
the server aborts the connection.
.TP
\(bu
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
is interpreted as a user identity to use on the
.BR server 's
machine.
.TP
\(bu
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
is interpreted as the user identity on the
.BR client 's
machine.
.TP
\(bu
A null terminated command to be passed to a
shell is retrieved on the initial socket.  The length of
the command is limited by the upper bound on the size of
the system's argument list.
.TP
\(bu
.B rshd
then validates the user according to the following steps.
The remote user name is looked up in the password file and a
.B chdir
is performed to the user's home directory.  If the lookup or
fails, the connection is terminated.  If the
.B chdir
fails, it does a
.B chdir
to
.B /
.BR  (root).
If the user is not the super-user, (user
.SM ID
0), the file
.B /etc/hosts.equiv
is consulted for a list of hosts considered \*(lqequivalent\*(rq.
If the client's host name is present in this file, the
authentication is considered successful.  If the lookup
fails, or the user is the super-user, then the file
.B .rhosts
in the home directory of the remote user is checked for
the machine name and identity of the user on the client's
machine.  If this lookup fails, the connection is terminated.
.TP
\(bu
A null byte is returned on the connection associated
with the
.B stderr
and the command line is passed to the normal login
shell of the user.  The
shell inherits the network connections established by
.BR rshd .
.SH FILES
.PD 0
.TP 20
.B /etc/hosts.equiv
.PD
.SH SEE ALSO
.BR rsh (1C),
.BR rcmd (3N),
.BR syslogd (8)
.SH BUGS
.LP
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an \*(lqopen\*(rq environment.
.LP
A facility to allow all data exchanges
to be encrypted should be present.
.br
.ne 8
.SH DIAGNOSTICS
.LP
The following diagnostic messages are returned on the connection
associated with the
.BR stderr ,
after which any network connections are closed.
An error is indicated by a leading byte with a value of
1 (0 is returned in step 9 above upon successful completion
of all the steps prior to the command execution).
.TP
.B locuser too long
The name of the user on the client's machine is
longer than 16 characters.
.TP
.B remuser too long
The name of the user on the remote machine is
longer than 16 characters.
.TP
.B command too long
The command line passed exceeds the size of the argument
list (as configured into the system).
.TP
.B Hostname for your address unknown.
No entry in the host name database existed for
the client's machine.
.TP
.B Login incorrect.
No password file entry for the user name existed.
.TP
.B Permission denied.
The authentication procedure described above failed.
.TP
.B Can't make pipe.
The pipe needed for the
.BR stderr ,
was not created.
.TP
.B Try again.
A
.I fork
by the server failed.
.TP
.BR /usr/bin/sh: " .\|.\|."
The user's login shell could not be started.
.LP
In addition, daemon's status messages and internal diagnostics are
logged to the appropriate system log using the
.BR syslogd (8)
facility.
