Arquivotheca/SunOS-4.1.3/man/man8/rwhod.8c
.\" @(#)rwhod.8c 1.1 92/07/30 SMI; from UCB 4.2
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.TH RWHOD 8C "17 December 1987"
.SH NAME
rwhod, in.rwhod \- system status server
.SH SYNOPSIS
.B /usr/etc/in.rwhod
.SH AVAILABILITY
.LP
Due to its potential impact on network performance, this service is
commented out of the
.B /etc/rc
system initialization script.
It is provided only for 4.3
.SM BSD
compatibility.
.LP
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "rwhod command"  ""  "\fLrwhod\fP \(em system status server"
.IX  "system status server"  ""  "system status server \(em \fLrwhod\fP"
.IX  servers  rwhod  ""  "\fLrwhod\fP \(em system status server"
.LP
.B rwhod
is the server which maintains the database used by the
.BR rwho (1C)
and
.BR ruptime (1C)
programs.
Its operation is predicated on the ability to
.I broadcast
messages on a network.
.LP
.B rwhod
operates as both a producer and consumer of status information.
As a producer of information it periodically
queries the state of the system and constructs
status messages which are broadcast on a network.
As a consumer of information, it listens for other
.B rwhod
servers' status messages, validating them, then recording
them in a collection of files located in the directory
.BR /var/spool/rwho .
.LP
The
.B rwho
server transmits and receives messages at the port indicated
in the \*(lqrwho\*(rq service specification, see
.BR services (5).
The messages sent and received, are of the form:
.RS
.nf
.ft B
struct	outmp {
.RS
.ft B
char	out_line[8];	/* tty name */
char	out_name[8];	/* user id */
long	out_time;	/* time on */
.RE
.ft B
};
.sp
.ft B
struct	whod {
.RS
.ft B
char	wd_vers;
char	wd_type;
char	wd_fill[2];
int	wd_sendtime;
int	wd_recvtime;
char	wd_hostname[32];
int	wd_loadav[3];
int	wd_boottime;
.RS
.ft B
struct	whoent {
struct	outmp we_utmp;
int	we_idle;
.RE
.ft B
} wd_we[1024 / sizeof (struct whoent)];
.RE
.ft B
};
.fi
.ft R
.RE
.LP
All fields are converted to network byte order prior to
transmission.
The load averages are as calculated by the
.BR w (1)
program, and represent load averages over the 5, 10, and 15 minute
intervals prior to a server's transmission.
The host name included is that returned by the
.BR gethostname (2)
system call.
The array at the end of the message contains information about
the users logged in to the sending machine.
This information includes the contents of the
.BR utmp (5V)
entry for each non-idle terminal line and a value indicating the
time since a character was last received on the terminal line.
.LP
Messages received by the
.B rwho
server are discarded unless they originated at a
.B rwho
server's port.
In addition, if the host's name, as specified
in the message, contains any unprintable
.SM ASCII
characters, the
message is discarded.
Valid messages received by
.B rwhod
are placed in files named
.BI whod. hostname
in the directory
.BR /var/spool/rwho .
These files contain only the most recent message, in the
format described above.
.LP
Status messages are generated approximately once every
60 seconds.
.B rwhod
performs an
.B nlist (3V)
on
.B /vmunix
every 10 minutes to guard against
the possibility that this file is not the system
image currently operating.
.SH FILES
.PD 0
.TP 20
.B /etc/rc
.TP
.B /var/spool/rwho
.PD
.SH "SEE ALSO"
.BR rwho (1C),
.BR ruptime (1C),
.BR w (1),
.BR gethostname (2),
.BR nlist (3V),
.BR utmp (5V),
.BR syslogd (8)
.SH DIAGNOSTICS
.LP
Status and diagnostic messages are logged to the appropriate system
log using the
.BR syslogd (8)
facility.
.SH BUGS
.LP
This service takes up progressively more network bandwidth as
the number of hosts on the local net increases.
For large networks, the cost becomes prohibitive.
.SM RPC\s0-based
services such as 
.BR rup (1C)
and
.BR rusers (1C)
provide a similar function with greater efficiency.
.LP
.B rwhod
should relay status information between networks.
People often interpret the server dying
as a machine going down.
