Arquivotheca/SunOS-4.1.3/man/man8/showrev.8
.\" @(#)showrev.8 1.1 92/07/30 SMI
.\" man page for showrev
.\" Received 9/25/90
.\" Updated 10/2/90
.TH SHOWREV 8 "2 December 1990"
.SH NAME
showrev \- show machine and software revision information
.SH SYNOPSIS
.B /usr/etc/showrev
[
.B \-a
] 
[
.B \-p
]
[
[
.B \-c 
] 
.I command
]
.SH DESCRIPTION
.LP
.B showrev
displays revision information for the current
hardware and software.
With no arguments, 
.B showrev 
shows the system revision information 
including hostname, hostid, kernel architecture, 
application architecture, kernel revision and release.
On
SunOS 4.1.1 Rev B or later,
OS release revision, OpenWindows version, Sunview version and 
patch information may also be displayed.
.LP
If a command
is supplied with the
.B \-c
option,
.B showrev 
shows the PATH and finds out all the directories 
that contain it.
For each file found, its library information, 
\s-1SCCS\s0 Id, permission and checksum are 
printed as well.
.SH OPTIONS
.TP 12
.BI \-a   
Print all system revision information available.  Window system
and patch information are added.
.TP
.BI \-p
Print only the revision information about patches.
.TP
.BI "\-c " command
Print the revision information about
.IR command .
.SH FILES
.TP 30
.PD 0
.B /usr/kvm/arch
system architecture information
.TP
.B /sbin/hostname
hostname information
.TP
.B /etc/hosts
general host information
.TP
.B /vmunix
kernel
.TP
.B /usr/sys/conf.common/\s-1RELEASE
OS\s0 release information - kernel name
.TP
.B /usr/bin/sunview
SunView executable 
.TP
.B /usr/kvm/showrev.dat
OS\s0 release revision information
.TP
.B /etc/install/patch*
patch release information
.PD
.SH SEE ALSO
.BR arch (1), 
.BR cc( 1V), 
.BR ldd (1), 
.BR sum (1),
.BR sccs (1),
.BR what (1)
