Arquivotheca/SunOS-4.1.3/man/man8/spray.8c
.\" @(#)spray.8c 1.1 92/07/30 SMI;
.TH SPRAY 8C "17 December 1987"
.SH NAME
spray \- spray packets
.SH SYNOPSIS
.B /usr/etc/spray
[
.B \-c
.I count
]
[
.B \-d
.I delay
]
[
.B \-i
.I delay
]
.if n .ti +5n
[
.B \-l
.I length
]
.I host
.SH AVAILABILITY
.LP
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "spray command"  ""  "\fLspray\fP \(em spray packets"
.LP
.B spray
sends a one-way stream of packets to
.I host
using
.SM RPC\s0,
and reports how many were received, as
well as the transfer rate.  The
.I host
argument can be either a name or an internet address.
.SH OPTIONS
.TP 15
.BI \-c " count"
Specify how many packets to send.
The default value of
.I count
is the number of packets required
to make the total stream size 100000 bytes.
.TP
.BI \-d " delay"
Specify how many microseconds to pause between
sending each packet.  The default is 0.
.TP
.BI \-i " delay"
Use
.SM ICMP
echo packets rather than
.SM RPC\s0.
Since
.SM ICMP
automatically
echos, this creates a two way stream.
.TP
.BI \-l " length"
The
.I length
parameter is the numbers of bytes in the
Ethernet packet that holds the
.SM RPC
call message.  Since the data
is encoded using
.SM XDR\s0,
and
.SM XDR
only deals with 32 bit quantities,
not all values of
.I length
are possible, and
.B spray
rounds up to the nearest possible value.  When
.I length
is greater than 1514, then the
.SM RPC
call can no longer be
encapsulated in one Ethernet packet, so the
.I length
field
no longer has a simple correspondence to Ethernet packet size.
The default value of
.I length
is 86 bytes (the size of the
.SM RPC
and
.SM UDP
headers).
.SH "SEE ALSO"
.BR icmp (4P),
.BR ping (8C),
.BR sprayd (8C)
.LP
.TX INSTALL
