Arquivotheca/SunOS-4.1.3/man/man8/suninstall.8
.\" @(#)suninstall.8 1.1 92/07/30 SMI; from UCB 4.3 BSD
.TH SUNINSTALL 8 "13 January 1990"
.SH NAME
suninstall \- install and upgrade the SunOS operating system
.SH SYNOPSIS
.B /usr/etc/install/suninstall
.SH DESCRIPTION
.IX "suninstall command" "" "\fLsuninstall\fP command"
.LP
.B suninstall
is a forms-based subsystem for installing and upgrading the SunOS
operating system.
Unlike previous installation subsystems,
.B suninstall
does not require recapitulation of an interrupted
procedure; you can pick up where you left off.
A new invocation of
.B suninstall
displays the saved information and offers the user an opportunity
to make any needed alterations before it proceeds.
.LP
Note: 
.B suninstall
only exists in the mini-root
and should only be invoked from
there (see
.TX INSTALL ).
.LP
.B suninstall
allows installation of the operating system onto any system
configuration, be it standalone, dataless, a homogeneous file server,
or a heterogeneous server.  It installs
the various versions of the
operating system needed by clients on a heterogeneous file
server, from any Sun distribution media format.
The number of different system versions 
that can be installed is only limited to the
disk space available.
.LP
After the
initial installation, the suninstall utility program
.BR add_client (8)
adds clients while the server
is running in multiuser mode.
The suninstall
.BR add_services (8)
program converts a standalone system or server into a
heterogeneous file server, without rebooting, while the system
is running in multiuser mode.
To remove a diskless client, use the suninstall
.BR rm_client (8)
program in multiuser mode.
.LP
To abort the installation procedure, use the interrupt
character (typically
.SM CTRL-C\s0).
.SH USAGE
.LP
Refer to 
.TX INSTALL
for more information on the various menus and selections.
.SH FILES
.PD 0
.TP 25
.B /usr/etc/install
directory containing installation programs and scripts
.TP
.B /usr/etc/install/xdrtoc
subsystem utility program
.TP
.B /etc/install
directory containing suninstall data files
.PD
.SH SEE ALSO
.BR add_client (8),
.BR add_services (8),
.BR extract_unbundled (8),
.BR rm_client (8)
.LP
.TX INSTALL
.SH NOTES
.LP
It is advisable to exit 
.B suninstall
through the exit options from the
.B suninstall
menus.
