Arquivotheca/SunOS-4.1.3/man/man8/sys-unconfig.8
.\" @(#)sys-unconfig.8 1.1 92/07/30 SMI; new for SPARCstation 1
.TH SYS-UNCONFIG 8 "7 October 1990"
.SH NAME
sys-unconfig \- undo a system's configuration
.SH SYNOPSIS
.B /usr/etc/install/sys-unconfig
.SH DESCRIPTION
.IX "sys-unconfig undo" "" "\fLsys-unconfig\fP \(em undo system configuration" ""
.IX configure "undo system configuration"
.IX unconfigure "undo system configuration"
.LP
.B sys-unconfig
packs up a machine to make it ready to be configured again.
.LP
It restores a systems's configuration to an \*(lqas-manufactured\*(rq
state.
A system's configuration consists of hostname,
Network Information Service
(\s-1NIS\s0)
domain name, timezone and
.SM IP
address.
.LP
.B sys-unconfig
does the following:
.RS
.TP 5
\(bu
Restores the default
.B /etc/hosts
file.
.TP
\(bu
Removes the default hostname in
.BR /etc/hostname.??[0-9] .
.TP
\(bu
Removes the default domainname in
.BR /etc/defaultdomain .
.TP
\(bu
Removes the default
.B /usr/lib/zoneinfo/localtime
file.
.TP
\(bu
Disables the
Network Information Service
(\s-1NIS\s0) if the
.SM NIS 
service was requested.
.RE
.LP
When
.B sys-unconfig
is finished, it will perform a system shutdown.
.LP
.B sys-unconfig
is potentially a dangerous utility and can only be run by the
super-user.
.SH FILES
.PD 0
.TP 20
.B /etc/hosts
.TP
.B /usr/lib/zoneinfo/localtime
.TP
.B /usr/etc/install/sys_info 
.PD
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
