Arquivotheca/SunOS-4.1.3/man/man8/telnetd.8c
.\" @(#)telnetd.8c 1.1 92/07/30 SMI; from UCB 4.3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.TH TELNETD 8C "18 December 1989"
.SH NAME
telnetd, in.telnetd \- TCP/IP TELNET protocol server
.SH SYNOPSIS
.B /usr/etc/in.telnetd
.SH AVAILABILITY
This program is available with the
.I Networking
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "telnetd daemon" "" "\fLtelnetd\fP daemon"
.B telnetd
is a server which supports the
.SM TCP/IP
standard
.SM TELNET
virtual terminal protocol.
.B telnetd
is invoked by the internet server (see
.BR inetd (8C)),
normally for requests to connect to the
.SM TELNET
port as indicated by the
.B /etc/services
file (see
.BR services (5)).
.PP
.B telnetd
operates by allocating a pseudo-terminal device (see
.BR pty (4))
for a client, then creating a login process which has
the slave side of the pseudo-terminal as its standard input, output,
and error.
.B telnetd
manipulates the master side of the pseudo-terminal,
implementing the
.SM TELNET
protocol and passing characters
between the remote client and the login process.
.PP
When a
.SM TELNET
session is started up, 
.B telnetd
sends
.SM TELNET
options to the client side indicating
a willingness to do
.I remote echo
of characters, to
.I suppress go
.IR ahead ,
and to receive
.I terminal type information
from the remote client.
If the remote client is willing, the remote terminal type is
propagated in the environment of the created login process.
The pseudo-terminal allocated to the client is configured
to operate in \*(lqcooked\*(rq mode, and with
.SM
.BR XTABS\s0 ,
.SM
.BR ICRNL\s0 ,
and
.SB ONLCR
enabled (see
.BR termio (4)).
.PP
.B telnetd
is willing to
.IR do :
.IR echo ,
.IR binary ,
.I suppress go
.IR ahead ,
and
.I timing
.IR mark .
.B telnetd
is willing to have the remote client
.IR do :
.IR binary ,
.I terminal
.IR type ,
and
.I suppress go
.IR ahead .
.SH "SEE ALSO"
.BR telnet (1C)
.LP
Postel, Jon, and Joyce Reynolds, ``Telnet Protocol Specification,'' RFC 854, 
Network Information Center, SRI International, Menlo Park, Calif., 
May 1983.
.SH BUGS
Some
.SM TELNET
commands are only partially implemented.
.PP
The
.SM TELNET
protocol allows for
the exchange of the number of lines and columns on the user's terminal,
but
.B telnetd
doesn't make use of them.
.PP
Because of bugs in the original 4.2 BSD
.BR telnet (1C),
.B telnetd
performs some dubious protocol exchanges to try to discover if the remote
client is, in fact, a 4.2 BSD
.BR telnet (1C).
.PP
Binary mode
has no common interpretation except between similar operating systems
.PP
The terminal type name received from the remote client is converted to
lower case.
.PP
The
.I packet
interface to the pseudo-terminal
(see
.BR pty (4))
should be used for more
intelligent flushing of input and output queues.
.LP
.B telnetd
never sends
.SM TELNET
.I go ahead
commands.
.LP
.B telnetd
can only support 64 pseudo-terminals.
