Arquivotheca/SunOS-4.1.3/man/man8/unadv.8
.\" @(#)unadv.8 1.1 92/07/30 SMI; from S5R3
.TH UNADV 8 "30 June 1988"
.SH NAME
unadv \- unadvertise a Remote File Sharing resource
.SH SYNOPSIS
.B unadv
.I resource
.SH AVAILABILITY
.LP
This program is available with the
.I \s-1RFS\s0
software installation option.
Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "unadv" "" "\fLunadv\fR \(em unadvertise an \s-1RFS\s0 resource" ""
.IX RFS "unadvertise a resource" "\s-1RFS\s0" "unadvertise a resource"
.IX server "unadvertise"
.IX prevent "remote mounts"
.LP
.B unadv
unadvertises a Remote File Sharing
(\s-1RFS\s0)
.IR resource ,
which is the advertised symbolic name of a local directory, by removing
it from the advertised information on the domain name server.
.B unadv
prevents subsequent remote mounts of that
resource.
It does not affect continued access through existing remote or local mounts.
.LP
An administrator at a server can unadvertise only those
resources that physically reside on the local machine.
A domain administrator can unadvertise any
resource in the domain from the primary name server by specifying
.I resource
name as
.IR domain.resource .
A domain administrator should only unadvertise
another hosts resources to clean up the domain advertise table
when that host goes down.
Unadvertising another host's resource changes
the domain advertise table, but not the host advertise table.
.LP
This command is restricted to the super-user.
.LP
If
.I resource
is not found in the advertised information,
an error message will be sent to standard error.
.SH "SEE ALSO"
.BR adv (8),
.BR fumount (8),
.BR nsquery (8)
