Arquivotheca/SunOS-4.1.3/man/man8/update.8
.\" @(#)update.8 1.1 92/07/30 SMI; 
.TH UPDATE 8  "9 September 1987"
.SH NAME
update \- periodically update the super block
.SH SYNOPSIS
.B /usr/etc/update
.SH DESCRIPTION
.IX  "update command"  ""  "\fLupdate\fP \(em update super block"
.LP
.B update
is a program that executes the
.BR sync (2)
primitive every 30 seconds.
This insures that the file system is fairly
up to date in case of a crash.
This command should not be executed directly,
but should be executed out of the
initialization shell command file.
.SH "SEE ALSO"
.BR sync (1),
.BR sync (2),
.BR init (8)
.  \".SH BUGS
.  \"With
.  \".B update
.  \"running, if the
.  \".SM CPU
.  \"is halted just as the
.  \".I sync
.  \"is executed, a file system can be damaged.
.  \"This is partially due to
.  \".SM DEC
.  \"hardware that
.  \"writes zeros when
.  \".SM NPR
.  \"requests fail.
.  \"A fix would be to have
.  \".IR sync (1)
.  \"temporarily increment the system time by at
.  \"least 30 seconds to trigger the execution of
.  \".B update.
.  \"This would give 30 seconds grace to halt the
.  \".SM CPU\s0.
