Arquivotheca/SunOS-4.1.3/man/man8/uucheck.8c
.\" @(#)uucheck.8c 1.1 92/07/30 SMI; from S5R3
.TH UUCHECK 8C "26 May 1988"
.SH NAME
uucheck \- check the UUCP directories and Permissions file
.SH SYNOPSIS
.B /usr/lib/uucp/uucheck
[
.B \-v
] [
.B \-x
.I debug_level
]
.SH AVAILABILITY
.LP
This command is available with the
.I uucp
software  installation  option.   Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "uucheck check" "" "\fLuucheck\fP \(em check \s-1UUCP\s0 directories and Permissions file" ""
.IX check "UUCP directories and Permissions file" check "\s-1UUCP\s0 directories and Permissions file"
.IX UUCP "check directories and Permissions file" "\s-1UUCP\s0" "check directories and Permissions file"
.IX directory "check UUCP directories and Permissions file" directory "check \s-1UUCP\s0 directories and Permissions file"
.IX Permissions "check UUCP directories and Permissions file" Permissions "check \s-1UUCP\s0 directories and Permissions file"
.LP
.B uucheck
checks for the presence of the
.SM UUCP
system required files and directories.
It also checks for some obvious errors in the
.B Permissions
file
.RB ( /usr/lib/uucp/Permissions ).
.LP
Note: 
.B uucheck
can only be used by the super-user or
.BR uucp .
.SH OPTIONS
.TP
.B \-v
Give a detailed explanation of how the
.SM UUCP
programs will interpret the
.B Permissions
file.
.TP
.BI \-x " debug_level"
Produce debugging output on the standard output.
.I debug_level
is a number between 0 and 9; higher numbers give more detailed information.
5, 7, and 9 are good numbers to try;
they give increasing amounts of detail.
.SH FILES
.PD 0
.TP 20
.B /etc/uucp/Systems
.TP 20
.B /etc/uucp/Permissions
.TP 20
.B /etc/uucp/Devices
.TP 20
.B /etc/uucp/Maxuuscheds
.TP 20
.B /etc/uucp/Maxuuxqts
.TP 20
.B /var/spool/uucp/*
.TP 20
.B /var/spool/locks/LCK*
.TP 20
.B /var/spool/uucppublic/*
.PD
.SH "SEE ALSO"
.BR uucp (1C),
.BR uustat (1C),
.BR uux (1C),
.BR uucico (8C),
.BR uusched (8C)
.SH BUGS
.LP
The program does not check file/directory modes or some errors
in the
.B Permissions
file such as duplicate login or machine name.
