Arquivotheca/SunOS-4.1.3/man/man8/uucico.8c
.\" @(#)uucico.8c 1.1 92/07/30 SMI; from S5R3
.TH UUCICO 8C "12 June 1988"
.SH NAME
uucico \- file transport program for the UUCP system
.SH SYNOPSIS
.B /usr/lib/uucp/uucico
[
.B \-r
.I role_number
] [
.B \-x
.I debug_level
]
[
.B \-i
.I interface
]
[
.B \-d
.I spool_directory
]
.if t .ti +.5i
.B \-s
.I system_name
.SH AVAILABILITY
.LP
This command is available with the
.I uucp
software  installation  option.   Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "uucico file" "" "\fLuucico\fP \(em file transport program for \s-1UUCP\s0" ""
.IX UUCP "file transport program" "\s-1UUCP\s0" "file transport program"
.IX transport "UUCP file transport program" "transport" "\s-1UUCP\s0 file transport program"
.IX transfer "UUCP file transport program" "transfer" "\s-1UUCP\s0 file transport program"
.LP
.B uucico
is the file transport program for
.SM UUCP
work file transfers.
.BR uux (1C)
and
.BR uucp (1C)
both queue jobs that will be transferred by
.BR uucico .
It is normally started by the scheduler,
.B uusched (8C),
but can be started manually;
this is done for debugging.  For example,
the script
.B Uutry
starts
.B uucico
with debugging turned on.
.SH OPTIONS
.TP
.BI \-r " role_number"
Specify the role that
.B uucico
should perform.
.I role_number
is the digit 1 for master
mode or 0 for slave mode (default).
Master mode should be specified when
.B uucico
is started by a program or
.BR cron (8).
.TP
.BI \-x " debug_level"
Produce debugging output on the standard output.
.I debug_level
is a number between 0 and 9; higher numbers give more detailed information.
5, 7, and 9 are good numbers to try;
they give increasing amounts of detail.
.TP
.BI \-i " interface"
Define the interface used with
.BR uucico .
This interface only affects slave mode.
Known interfaces are
.SM UNIX
(default).
.SH FILES
.PD 0
.TP 20
.B /etc/uucp/Systems
.TP
.B /etc/uucp/Permissions
.TP
.B /etc/uucp/Devices
.TP
.B /etc/uucp/Devconfig
.TP
.B /etc/uucp/Sysfiles
.TP
.B /etc/uucp/Maxuuxqts
.TP
.B /etc/uucp/Maxuuscheds
.TP
.B /var/spool/uucp/*
.TP
.B /var/spool/locks/LCK*
.TP
.B /var/spool/uucppublic/*
.PD
.SH "SEE ALSO"
.BR uucp (1C),
.BR uustat (1C),
.BR uux (1C),
.BR cron (8),
.BR uusched (8C).

