Arquivotheca/SunOS-4.1.3/man/man8/uucleanup.8c
.\" @(#)uucleanup.8c 1.1 92/07/30 SMI; from S5R3
.TH UUCLEANUP 8C "26 May 1988"
.SH NAME
uucleanup \- UUCP spool directory clean-up
.SH SYNOPSIS
.B /usr/lib/uucp/uucleanup
[
.BI \-C time
] [
.BI \-D time
] [
.BI \-m string
] [
.BI \-o time
] [
.BI \-s system
] [
.BI \-W time
]
.if t .ti +.5i
[
.BI \-x " debug_level"
] [
.BI \-X time
]
.SH AVAILABILITY
.LP
This command is available with the
.I uucp
software  installation  option.   Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "uucleanup UUCP" "" "\fLuucleanup\fP \(em \s-1UUCP\s0 spool directory clean-up" ""
.IX "UUCP" "spool directory clean-up" "\s-1UUCP\s0" "spool directory clean-up"
.IX "spool" "UUCP spool directory clean-up" "spool" "\s-1UUCP\s0 spool directory clean-up"
.IX "directory" "UUCP spool directory clean-up" "directory" "\s-1UUCP\s0 spool directory clean-up"
.IX "clean" "UUCP spool directory clean-up" "clean" "\s-1UUCP\s0 spool directory clean-up"
.IX "remove" "old files in UUCP spool directory" "remove" "old files in \s-1UUCP\s0 spool directory"
.LP
.B uucleanup
will scan the spool directories for old files
and take appropriate action to remove them in a
useful way:
.RS
.TP 4
\(bu
Inform the requestor of send/receive requests for
systems that cannot be reached.
.TP
\(bu
Return mail, which cannot be delivered, to
the sender.
.TP
\(bu
Delete or execute
.B rnews
for
.B rnews
type files
(depending on where the news originated \(em locally or
remotely).
.TP
\(bu
Remove all other files.
.RE
.LP
In addition, there is provision to warn users of requests that
have been waiting for a given number of days (default 1 day).
Note: 
.B uucleanup
will process as if all option
.IR time s
were specified to the default values unless
.I time
is specifically set.
.LP
This program is typically started by the shell
.BR uudemon.cleanup ,
which should be started by
.BR cron (8).
.SH OPTIONS
.TP
.BI \-C time
Remove any 
.B C.
files that are at least
.I time
days old (default 7 days), and send appropriate information to the requestor.
.TP
.BI \-D time
Remove any
.B D.
files that are at least
.I time
days old (default 7 days), and make an attempt to deliver mail messages and
execute
.B rnews
when appropriate.
.TP
.BI \-m string
Include this line in the warning message generated by the
.B \-W
option.
The default line is
.RB ` "See your local administrator to locate the problem" '. 
.TP
.BI \-o time
Delete other files that are more than
.I time
days old (default 2 days).
.TP
.BI \-s system
Execute for the spool directory for the remote system
.I system
only.
.TP
.BI \-W time
Send a mail message to be sent to the requestor warning about
the delay in contacting the remote for any
.B C.
files that are
.I time
days old (default 1 day).
The message includes the
.IR \s-1JOBID\s0 ,
and in the case of mail, the mail message.
The administrator may include a message line telling whom to
call to check the problem
.RB ( \-m
option).
.TP
.BI \-x " debug_level"
Produce debugging output on the standard output.
.I debug_level
is a number between 0 and 9; higher numbers give more detailed information.
5, 7, and 9 are good numbers to try;
they give increasing amounts of detail.
.TP
.BI \-X time
Remove any 
.B X.
files that are at least
.I time
days old (default 2 days).
The
.B D.
files are probably not present (if they were, the
.B X.
could get executed).
But if there are
.B D.
files, they will be taken care of by
.B D.
processing.
.SH FILES
.PD 0
.TP 20
.B /usr/lib/uucp
directory with commands used by
.B uucleanup
internally
.TP
.B /var/spool/uucp
spool directory
.PD
.SH SEE ALSO
.BR uucp (1C),
.BR uux (1C),
.BR cron (8)
