Arquivotheca/SunOS-4.1.3/man/man8/ypinit.8
.\" @(#)ypinit.8 1.1 92/07/30 SMI
.TH YPINIT 8 "8 December 1988"
.SH NAME
ypinit \- build and install NIS database
.SH SYNOPSIS
.B /usr/etc/yp/ypinit
.B \-m
.LP
.B /usr/etc/yp/ypinit
.B \-s
.I master_name
.SH DESCRIPTION
.IX  "ypinit command"  ""  "\fLypinit\fP \(em make NIS database"
.IX  "create" "NIS database \(em \fLypinit\fP"
.IX  "build" "NIS database \(em \fLypinit\fP"
.IX  "install NIS database"  ""  "install NIS database \(em \fLypinit\fP"
.IX  "YP"  "make database"  ""  "make database \(em \fLypinit\fP"
.IX  "NIS"  "make database"  ""  "make database \(em \fLypinit\fP"
.LP
.B ypinit
sets up a 
Network Information Service
(\s-1NIS\s0)
database on an
.SM NIS
server.
It can be used to set up a master or a slave server.
You must be the super-user to run it.
It asks a few, self-explanatory  questions,
and reports success or failure to the terminal.
.LP
It sets up a master server
using the simple model in which that server
is master to all maps in the data base.
This is the way to bootstrap the
.SM NIS
system;
later if you want you can change the association of maps to masters.
.IP Note:
If there are both 3.x and 4.x
.SM NIS
servers running in the network, the 4.x server should be
configured as the master.
.LP
All databases are built from scratch,
either from information available to the program at runtime,
or from the
.SM ASCII
data base files in
.BR /etc .
These files are listed below under
.SM FILES\s0.
All such files should be in their \*(lqtraditional\*(rq form,
rather than the abbreviated form used on client machines.
.LP
An
.SM NIS
database on a slave server is set up by copying
an existing database from a running server.  The
.I master_name
argument should be the hostname of an
.SM NIS
server (either the master server for all the maps,
or a server on which the data base is up-to-date and stable).
.LP
Read
.BR ypfiles (5)
and
.BR ypserv (8)
for an overview of the 
.SM NIS
service.
.SH OPTIONS
.TP
.B \-m
Indicate that the local host is to be the
.SM NIS
master.
.TP
.B \-s
Set up a slave database.
.SH FILES
.PD 0
.TP 20
.B /etc/passwd
.TP
.B /etc/group
.TP
.B /etc/hosts
.TP
.B /etc/networks
.TP
.B /etc/services
.TP
.B /etc/protocols
.\" .TP
.\" .B /etc/netgroup
.TP
.B /etc/ethers
.\" .TP
.\" .B /etc/security/passwd.adjunct
.\" .TP
.\" .B /etc/security/group.adjunct
.PD
.SH "SEE ALSO"
.BR ypfiles (5),
.BR makedbm (8),
.BR ypmake (8),
.BR yppush (8),
.BR ypserv (8),
.BR ypxfr (8)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
