Arquivotheca/SunOS-4.1.3/man/man8/ypupdated.8c
.\" @(#)ypupdated.8c 1.1 92/07/30 SMI;
.TH YPUPDATED 8C "23 February 1988"
.SH NAME
ypupdated, rpc.ypupdated \- server for changing NIS information
.SH SYNOPSIS
.B rpc.ypupdated
[
.B \-is
]
.SH DESCRIPTION
.IX "ypupdated daemon" "" "\fLypupdated\fP daemon"
.LP
.B ypupdated
is a daemon that updates information in the
Network Information Service
(\s-1NIS\s0),
normally started up by
.BR inetd (8C).
.B ypupdated
consults the file
.BR updaters (5)
in the directory
.B /var/yp
to determine which
.SM NIS
maps should be updated and how to change them.
.LP
By default, the daemon requires the most secure method of
authentication available to it, either
.SM DES
(secure) or
.SM UNIX
(insecure).
.SH OPTIONS
.TP
.B \-i
Accept
.SM RPC
calls with the insecure 
.SM AUTH_UNIX
credentials.
This allows programmatic updating of the
.SM NIS
maps in all networks.
.TP
.B \-s
Accept only calls authenticated using the secure 
.SM RPC
mechanism
(\s-1AUTH_DES\s0
authentication).
This disables programmatic updating of the
.SM NIS
maps unless the network supports these calls.
.SH FILES
.PD 0
.TP 20
.B /var/yp/updaters
.PD
.SH "SEE ALSO"
.BR updaters (5),
.BR inetd (8C),
.BR keyserv (8C)
.LP
.TX ADMIN
.br
.TX NETP
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
