Arquivotheca/SunOS-4.1.3/man/man8/zdump.8
.\" @(#)zdump.8 1.1 92/07/30 SMI; from Arthur Olson
.TH ZDUMP 8 "9 September 1987"
.SH NAME
zdump \- time zone dumper
.SH SYNOPSIS
.B zdump
[
.B \-v
] [
.B \-c
.I cutoffyear
] [
.I zonename
\&... ]
.SH DESCRIPTION
.IX "zdump command" "" "\fLzdump\fP command"
.B zdump
prints the current time in each
.I zonename
named on the command line.
.SH OPTIONS
.TP
.B \-v
For each
.I zonename
on the command line, print the current time,
the time at the lowest possible time value,
the time one day after the lowest possible time value,
the times both one second before and exactly at
each time at which the rules for computing local time change,
the time at the highest possible time value,
and the time at one day less than the highest possible time value.
Each line ends with
.B isdst=1
if the given time is Daylight Saving Time or
.B isdst=0
otherwise.
.TP
.BI "\-c " cutoffyear
Cut off the verbose output near the start of the year
.IR cutoffyear .
.SH FILES
.PD 0
.TP 20
.B /usr/share/lib/zoneinfo
standard zone information directory
.PD
.SH "SEE ALSO"
.BR ctime (3V),
.BR tzfile (5),
.BR zic (8)
