Arquivotheca/SunOS-4.1.3/man/man7/ansic.7v
.\" @(#)ansic.7v 1.1 92/07/30 SMI; new for 4.1
.TH ANSIC 7V "30 September 1989"
.SH NAME
ansic \- ANSI C (draft of December 7 1988) lint library
.SH SYNOPSIS
.B "/usr/5bin/lint \-n \-lansic"
.I ansic_src.c
.SH AVAILABILITY
.LP
This environment is not available under SunOS Release 4.1. 
The environment that most closely approximates an
.SM ANSI C
environment is the System V environment.
The System V environment is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "ansic"  ""  "\fLansic\fP \(em C language standard"
.IX  "language standards"  ansic  ""  "\fLansic\fP \(em C Language standard"
.LP
.SM ANSI C
is a proposed standard for the C language.
SunOS Release 4.1 does not currently fully support
.SM ANSI C
applications.  It
does support many of the functions described by the
.SM ANSI C
draft.
This man page does not imply that the functions supported by SunOS
Release 4.1 and the functions described by the
.SM ANSI C
draft perform identically.
The
.SM ANSI C
lint library is intended solely as a porting aid.
.LP
The
.SM ANSI C
lint library consists exclusively of
.SM ANSI C
functions.
Users may lint their code with the
.B "\-n \-lansic"
options to catch all non-\s-1ANSI\s0 C features.
.LP
Certain functions defined in the
.SM ANSI C
lint library are not available
in the C library but are available.  In
particular, math functions are made available only when the
.B \-lm
option is added to
.BR cc (1V)
or
.BR ld (1)
commands.
.LP
Other
.SM ANSI C
functions not supported at all in SunOS Release 4.1 are
.BR raise(\|) ,
.BR fgetpos(\|) ,
.BR fsetpos(\|) ,
.BR div(\|) ,
.BR ldiv(\|) ,
.BR strtoul(\|) ,
.BR strerror(\|) ,
and 
.BR difftime(\|) .
.SH FILES
.PD 0
.TP 20
.B /usr/5lib/lint/llib-lansic*
.SM ANSI C
lint library
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR bsd (7),
.BR posix (7V),
.BR sunos (7),
.BR svidii (7V),
.BR svidiii (7V),
.BR xopen (7V)
