Arquivotheca/SunOS-4.1.3/man/man7/bsd.7
.\" @(#)bsd.7 1.1 92/07/30 SMI; new for 4.1
.TH BSD 7 "30 September 1989"
.SH NAME
bsd \- overview of the Berkeley 4.3 environment
.SH SYNOPSIS
.B /usr/bin/lint
.B \-n
.B \-lbsd
.I bsd_src.c
.SH DESCRIPTION
.IX  "bsd"  ""  "\fLbsd\fP \(em Berkeley 4.3 environment"
.IX  "operating system standards"  bsd  ""  "\fLbsd\fP \(em Berkeley 4.3 environment"
.LP
.SM BSD
4.3 is a set of functions and headers.  The SunOS Release 4.1
is a superset of
.SM BSD
4.3.  It includes all of the
functionality described in the
.SM BSD
4.3 documentation.
See
.BR sunos (7)
for an overview of SunOS functionality.  
.LP
Note:  there may be some cases where the
coexistence of another environment overrides the
.SM BSD
4.3 semantics.
In particular, when there has been a point of conflict between
.SM POSIX.1
and
.SM BSD
4.3,
.SM POSIX.1
has won (see
.BR setsid (8V)
for such an example).
.LP
Many man pages are marked with a \*(lqV\*(rq after the section
number, indicating some sort of System V conformance.
.SM BSD
4.3 functions
are also documented on these man pages, as well as on man pages
without the \*(lqV\*(rq section suffix.
.LP
By default, the user will get a superset of the
.SM BSD
4.3 environment.  No path modifications
should be necessary.  The typical path is 
.BR "set path = ( /usr/ucb /bin /usr/bin )"
.SH LINT
.LP
As a portability aid, Sun is providing a lint library
that consists exclusively of
.SM BSD
4.3 functions.  Users may lint
their code with the 
.B "\-n \-lbsd"
options to catch all non-\s-1BSD\s0 4.3 features.
.LP
.SM BSD\s0,
as with most other environments, continues to evolve.  The
.B \-lbsd
lint library will always refer to the most 
recent
.SM BSD
release supported by Sun.  Some applications may
wish to port to a particular release of
.SM BSD\s0.
They may safely
use the more specific name of 
.B \-l4.3bsd
(currently the same as 
.BR \-lbsd ).
Lint libraries for
.SM BSD
releases earlier than 4.3 are not currently available.  4.3
.SM BSD
is sufficiently close to 4.2
.SM BSD
that the 4.3
.SM BSD
lint library usually works.
.SH FILES
.PD 0
.TP 20
.B /usr/bin/*
.SM BSD
4.3 and SunOS specific executables
.TP 20
.B /usr/ucb/*
.SM BSD
4.3 derived executables
.TP 20
.B /usr/include/*
.SM BSD
4.3 and SunOS specific header files
.TP
.B /usr/lib/*
.SM BSD
4.3 and SunOS specific library files
.TP
.B /usr/lib/lint/llib-lbsd*
.SM BSD
4.3 lint library
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR posix (7V),
.BR sunos (7),
.BR svidii (7V),
.BR svidiii (7V),
.BR xopen (7V),
.BR setsid (8V)
