Arquivotheca/SunOS-4.1.3/man/man7/me.7
.\" @(#)me.7 1.1 92/07/30 SMI; from UCB 4.3
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.hc %
.TH ME 7 "19 December 1989"
.SH NAME
me \- macros for formatting papers
.SH SYNOPSIS
.B "nroff \-me"
[ options ]
file ...
.br
.B "troff \-me"
[ options ]
file ...
.IX  "me file"  ""  "\fL\-me\fP \(em macro package"
.IX  "document production"  "me file"  ""  "\fL\-me\fP \(em macro package"
.SH DESCRIPTION
This package of
.B nroff
and
.B troff
macro definitions provides a canned formatting
facility for tech%nical papers in various formats.
When producing 2-column output on a terminal, filter
the output through
.IR  col (1).
.LP
The macro requests are defined below.
Many
.B nroff
and
.B troff
requests are unsafe in conjunction with
this package, however, these requests may be used with
impunity after the first .pp:
.nf
.IP
.ta \w'.sz +n  'u
\&.bp	begin new page
\&.br	break output line here
\&.sp n	insert n spacing lines
\&.ls n	(line spacing) n=1 single, n=2 double space
\&.na	no alignment of right margin
\&.ce n	center next n lines
\&.ul n	underline next n lines
\&.sz +n	add n to point size
.fi
.LP
Output of the
.B eqn,
.B neqn,
.B refer,
and
.BR tbl (1)
preprocessors
for equations and tables is acceptable as input.
.SH REQUESTS
In the following list,
\*(lqinitialization\*(rq
refers to the first .pp, .lp, .ip, .np, .sh, or .uh macro.
This list is incomplete.
.LP
.ta \w'.eh \'x\'y\'z\'  'u +\w'Initial 'u +\w'Cause 'u
.br
.di x
			\ka
.br
.di
.in \nau
.ti0
Request	Initial	Cause	Explanation
.ti0
	Value	Break
.br
.in \nau
.ti0
\&.(c	-	yes	Begin centered block
.ti0
\&.(d	-	no	Begin delayed text
.ti0
\&.(f	-	no	Begin footnote
.ti0
\&.(l	-	yes	Begin list
.ti0
\&.(q	-	yes	Begin major quote
.ti0
\&.(x\fIx\fR 	-	no	Begin indexed item in index \fIx\fR
.ti0
\&.(z	-	no	Begin floating keep
.ti0
\&.)c	-	yes	End centered block
.ti0
\&.)d	-	yes	End delayed text
.ti0
\&.)f	-	yes	End footnote
.ti0
\&.)l	-	yes	End list
.ti0
\&.)q	-	yes	End major quote
.ti0
\&.)x	-	yes	End index item
.ti0
\&.)z	-	yes	End floating keep
.ti 0
\&.++ \fIm H\fR 	-	no	Define paper section.  \fIm
defines the part of the paper, and can be
.B C
(chapter),
.B A
(appendix),
.B P
(preliminary, for instance, abstract, table of contents, etc.),
.B B
(bibliography),
.B RC
(chapters renumbered from page one each chapter),
or
.B RA
(appendix renumbered from page one).
.ti 0
\&.+c \fIT\fR 	-	yes	Begin chapter (or appendix, etc., as
set by \fB.++\fR).
.I T
is the chapter title.
.ti0
\&.1c	1	yes	One column format on a new page.
.ti0
\&.2c	1	yes	Two column format.
.ti0
\&.EN	-	yes	Space after equation produced by
.B eqn
or
.BR meqn .
.ti0
\&.EQ \fIx y\fR 	-	yes	Precede equation; break out and add space.
Equation number is
.IR y .
The optional argument
.I x
may be
.I I
to indent equation (default),
.I L
to left-adjust the equation, or
.I C
to center the equation.
.ti0
\&.GE	-	yes	End
.I gremlin
picture.
.ti0
\&.GS	-	yes	Begin
.I gremlin
picture.
.ti0
\&.PE	-	yes	End
.I pic
picture.
.ti0
\&.PS	-	yes	Begin
.I pic
picture.
.ti0
\&.TE	-	yes	End table.
.ti0
\&.TH	-	yes	End heading section of table.
.ti0
\&.TS \fIx\fR	-	yes	Begin table; if
.I x
is
.I H
table has repeated heading.
.ti 0
\&.ac \fIA N\fR 	-	no	Set up for
.SM ACM
style output.
.I A
is the Author's name(s),
.I N
is the total number of pages.
Must be given before the first initialization.
.ti0
\&.b \fIx\fR 	no	no	Print
.I x
in boldface; if no argument switch to boldface.
.ti 0
\&.ba \fI+n\fR 	0	yes	Augments the base indent by
.I n.
This indent is used to set the indent on regular text
(like paragraphs).
.ti0
\&.bc	no	yes	Begin new column
.ti0
\&.bi \fIx\fR 	no	no	Print
.I x
in bold italics (nofill only)
.ti0
\&.bu	-	yes	Begin bulleted paragraph
.ti0
\&.bx \fIx\fR	no	no	Print
.I x
in a box (nofill only).
.ti 0
\&.ef  \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set even footer to x  y  z
.ti 0
\&.eh \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set even header to x  y  z
.ti 0
\&.fo \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set footer to x  y  z
.ti 0
\&.hx	-	no	Suppress headers and footers on next page.
.ti0
\&.he \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set header to x  y  z
.ti0
\&.hl	-	yes	Draw a horizontal line
.ti0
\&.i \fIx\fR 	no	no	Italicize
.I x;
if
.I x
missing, italic text follows.
.ti0
\&.ip \fIx y\fR 	no	yes	Start indented paragraph,
with hanging tag
.IR x .
Indentation is
.I y
ens (default 5).
.ti0
\&.lp	yes	yes	Start left-blocked paragraph.
.ti 0
\&.lo	-	no	Read in a file of local macros of the
form
.BI \&.* x.
Must be given before initialization.
.ti0
\&.np	1	yes	Start numbered paragraph.
.ti 0
\&.of \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set odd footer to x  y  z
.ti 0
\&.oh \fI\'x\'y\'z\fR	\'\'\'\'\'	no	Set odd header to x  y  z
.ti 0
\&.pd	-	yes	Print delayed text.
.ti0
\&.pp	no	yes	Begin paragraph.
First line indented.
.ti0
\&.r	yes	no	Roman text follows.
.ti 0
\&.re	-	no	Reset tabs to default values.
.ti 0
\&.sc	no	no	Read in a file of special characters
and diacritical marks.
Must be given before initialization.
.ti0
\&.sh \fIn x\fR 	-	yes	Section head follows,
font automatically bold.
.I n
is level of section,
.I x
is title of section.
.ti 0
\&.sk	no	no	Leave the next page blank.
Only one page is remembered ahead.
.ti0
\&.sm \fIx -	no	Set
.I x
in a smaller pointsize.
.ti 0
\&.sz \fI+n\fR 	10p	no	Augment the point size by
.I n
points.
.ti 0
\&.th	no	no	Produce the paper in thesis format.
Must be given before initialization.
.ti 0
\&.tp	no	yes	Begin title page.
.ti0
\&.u \fIx\fR	-	no	Underline argument (even in
.BR troff ).
(Nofill only).
.ti0
\&.uh	-	yes	Like .sh but unnumbered.
.ti0
\&.xp \fIx\fR 	-	no	Print index
.IR x .
.SH FILES
.PD 0
.TP 20
.B /usr/share/lib/tmac/tmac.e
.TP
.B /usr/share/lib/me/*
.PD
.SH "SEE ALSO"
.BR eqn (1),
.BR nroff (1),
.BR troff (1),
.BR refer (1),
.BR tbl (1)
.LP
.TX DOCS
