Arquivotheca/SunOS-4.1.3/man/man7/posix.7v
.\" @(#)posix.7v 1.1 92/07/30 SMI;
.TH POSIX 7V "30 September 1989"
.SH NAME
posix \- overview of the IEEE Std 1003.1-1988 (POSIX.1) environment
.SH SYNOPSIS
.B "/usr/5bin/lint \-n \-lposix"
.I posix_src.c
.SH AVAILABILITY
.LP
This environment is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "posix"  ""  "\fLposix\fP \(em IEEE Std 1003.1-1988 (POSIX.1)"
.IX  "operating system standards"  posix  ""  "\fLposix\fP \(em IEEE Std 1003.1-1988 (POSIX.1)"
.LP
.SM POSIX.1
is a set of functions and headers.  The SunOS Release 4.1
implementation of
.SM POSIX.1
is a superset \(em it includes all of the
functionality described in the
.SM IEEE
standard as well as most of the
SunOS functionality.  See the 
.BR sunos(7)
man page for a description of
SunOS functionality.
.LP
All man pages that are associated with
.SM POSIX.1
are marked by a \*(lqV\*(rq
after the section number.  Not all \*(lqV\*(rq pages, however, are
.SM POSIX.1\s0.
Some \*(lqV\*(rq pages may be part of other System V based environments such as
X/Open.
.LP
If a user desires to work in a
.SM POSIX.1
(or
System V) environment, the user
should set the path variable to include 
.B /usr/5bin
before anything else.  The typical path is
.BR "\s-1PATH\s0=/usr/5bin:/bin:/usr/bin:/usr/ucb" .
.SH "LINT"
.LP
As a portability aid, Sun is providing a lint library
that consists exclusively of
.SM POSIX.1
functions.  Users may lint
their code with the 
.B "\-n \-lposix"
options to catch all non-\s-1POSIX.1\s0 features.  
.LP
.SM POSIX.1
is primarily an operating system interface. 
.SM POSIX.1
also specifies a subset of the functions defined by
.SM ANSI C\s0.
These are included in the
.B posix
lint library.
Because of the additional functionality provided by
.SM ANSI C\s0,
Sun will also be providing an
.SM ANSI C
(based on the December 7, 1988 draft) lint library.
A portable application may want to lint with
.B "\-n \-lposix \-lansic"
for the most complete coverage of functions.
.LP
.SM POSIX.1
as with most other environments, continues to evolve.  The 
.B \-lposix
lint library will always refer to the most recent standard supported by Sun.
Some applications may wish to port to a particular version of the standard; they
may safely use the more specific name of
.B \-lposix1-88
(currently the same as 
.BR \-lposix ).
.LP
Certain functions defined in the 
.B posix
lint library are not available in the
C library. 
In particular, math functions are made available only when the
.B \-lm
option is added to
.BR cc (1V)
or 
.BR ld (1)
commands.
.SH FILES
.PD 0
.TP 20
.B /usr/5bin/*
.SM POSIX.1
and System V specific executables
.TP 20
.B /usr/5include/*
.SM POSIX.1
and System V specific headers
.TP
.B /usr/5lib/*
.SM POSIX.1
and System V specific library files
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR bsd (7),
.BR sunos (7),
.BR svidii (7V),
.BR svidiii (7V),
.BR xopen (7V)
.LP
.I "IEEE Std 1003.1-1988"
