Arquivotheca/SunOS-4.1.3/man/man7/svidii.7v
.\" @(#)svidii.7v 1.1 92/07/30 SMI;
.TH SVIDII 7V "30 September 1989"
.SH NAME
svidii \- overview of the System V environment 
.SH SYNOPSIS
.B "/usr/5bin/lint \-n \-lsvidii"
.I sys5_src.c
.SH AVAILABILITY
.LP
This command is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "svidiii"  ""  "\fLsvidii\fP \(em SVID Issue 2"
.IX  "operating system standards"  system5  ""  "\fLsvidii\fP \(em SVID Issue 2"
.IX  "operating system standards"  svidii  ""  "\fLsvidii\fP \(em SVID Issue 2"
.LP
.SM SVID II
is a set of functions and header files.  The SunOS Release 4.1
implementation of 
.SM SVID II
is a superset \(em it includes all of the
functionality described in the
.SM SVID
issue 2 documents as well as most of the
SunOS functionality.  See the 
.BR sunos (7)
man page for a description of
SunOS functionality.
.LP
All man pages that are associated with 
.SM SVID II
are marked by a \*(lqV\*(rq
after the section number.  Not all \*(lqV\*(rq pages are 
.SM SVID II\s0,
however.
Some \*(lqV\*(rq pages may be part of other System V based environments such as
X/Open.
.LP
If a user desires to work in a 
.SM SVID II
environment, the user
should set the path variable to include 
.B /usr/xpg2bin
and 
.B /usr/5bin
before anything else. 
The typical path is:
.LP
.RS
.ft B
set path=( /usr/xpg2bin /usr/5bin /bin /usr/bin /usr/ucb )
.ft
.RE
.LP
As a portability aid, Sun is providing two lint libraries
that consist exclusively of 
.SM SVID II
functions as defined in the
.SM SVID
issue 2.  Users may lint
their code with the 
.B "\-n \-lsvidii"
options to catch all features that are not found in
.SM SVID
issue 2, all volumes.
Using lint with the
.B "\-n \-lsvidii-3"
options is just like 
.B "\-n \-lsvidii"
except that it does not include volume 3 (which contains new directory
reading routines and new signal functions that appeared in System V
release 3.2).
.SH FILES
.PD 0
.TP 20
.B /usr/5bin/*
System V specific executables
.TP 20
.B /usr/5include/*
System V specific header files
.TP
.B /usr/5lib/*
System V specific library files
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR bsd (7),
.BR posix (7V),
.BR sunos (7),
.BR svidiii (7V),
.BR xopen (7V)
