Arquivotheca/SunOS-4.1.3/man/man7/svidiii.7v
.\" @(#)svidiii.7v 1.1 92/07/30 SMI;
.TH SVIDIII 7V "30 September 1989"
.SH NAME
svidiii \- SVIDIII lint library
.SH SYNOPSIS
.B "/usr/5bin/lint \-n \-lsvidiii"
.I svidiii_src.c
.SH AVAILABILITY
.LP
This environment is not fully tested under SunOS Release 4.1 as there is 
no test suite available.
The environment that is believed to closely approximate a
.SM SVIDIII
environment is the System V environment.
The System V environment is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "svidiii"  ""  "\fLsvidiii\fP \(em System V release 4 environment" ""
.IX  "operating system standards"  svidiii  ""  "\fLsvidiii\fP \(em System V release 4 environment"
.LP
.SM SVIDIII
is a future environment that Sun intends to support.  SunOS Release 4.1
does not currently fully support
.SM SVIDIII
applications.
It does support many of the
functions described by the
.SM SVIDIII
document.
This man page does not imply that
the functions supported by SunOS Release 4.1 and the functions described by the 
.SM SVIDIII
document perform identically.  
The
.SM SVIDIII
lint library is intended solely as a porting aid.
.LP
The
.SM SVIDIII
lint library
consists exclusively of
.SM SVIDIII
functions.  Users may lint
their code with the 
.B "\-n \-lsvidiii"
options to catch all non-\s-1SVIDIII\s0 features.  
.SH FILES
.PD 0
.TP 25 
.B /usr/5lib/lint/llib-lsvidiii*
.SM SVIDIII
C lint library
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR bsd (7),
.BR posix (7V),
.BR sunos (7),
.BR svidii (7V),
.BR xopen (7V)
