Arquivotheca/SunOS-4.1.3/man/man7/xopen.7v
.\" @(#)xopen.7v 1.1 92/07/30 SMI;
.TH XOPEN 7V "30 September 1989"
.SH NAME
xopen \- overview of the X/Open Portability Guide Issue 2 (X/Open) environment 
.SH SYNOPSIS
.B "/usr/5bin/lint \-n \-lxopen"
.I xopen_src.c
.SH AVAILABILITY
.LP
This command is available with the
.I System V
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "xopen"  ""  "\fLxopen\fP \(em /usr/group X/Open version 2"
.IX  "operating system standards"  xopen  ""  "\fLxopen\fP \(em /usr/group X/Open issue 2"
.LP
X/Open is a set of functions and header files.
The SunOS Release 4.1
implementation of X/Open is a superset \(em it includes all of the
functionality described in the
.B /usr/group 
Standard 1984 \(em as well as much of
the System V functionality, and much of the SunOS functionality.
.LP
All man pages that are associated with X/Open are marked by a \*(lqV\*(rq
after the section number.  Not all \*(lqV\*(rq pages are X/Open, however.
Some \*(lqV\*(rq pages may be part of other System V based environments such as
.SM POSIX.1\s0.
.LP
If a user desires to work in a X/Open (or System V) environment, the user
should set the path variable to include 
.B /usr/xpg2bin
and
.B /usr/5bin
before anything else.  The typical path is:
.LP
.RS
.ft B
set path=( /usr/xpg2bin /usr/5bin /bin /usr/bin /usr/ucb )
.ft
.RE
.LP
As a portability aid, Sun is providing a lint library
that consists exclusively of X/Open functions.  Users may lint
their code with the 
.B "\-n \-lxopen"
options to catch all non-X/Open features.
.LP
X/Open, as with most other environments, continues to evolve.  The
.B \-lxopen
lint library will always refer to the most recent document
supported by Sun.  Some applications may wish to port to a
particular version of the environment; they may safely use the more
specific name of
.B \-lxpg2
(currently the same as 
.BR \-lxopen ).
.SH FILES
.PD 0
.TP 20
.B /usr/xpg2bin/*
X/Open specific executables
.TP 20
.B /usr/xpg2include/*
X/Open specific header files
.TP 20
.B /usr/5include/*
System V specific header files
.TP
.B /usr/xpg2lib/*
X/Open specific library files
.TP
.B /usr/5lib/*
System V specific library files
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR bsd (7),
.BR posix (7V),
.BR sunos (7),
.BR svidii (7V),
.BR svidiii (7V)
