Arquivotheca/SunOS-4.1.3/man/man4/lo.4
.\" @(#)lo.4 1.1 92/07/30 SMI; from UCB 4.1
.TH LO 4N "9 October 1987"
.SH NAME
lo \- software loopback network interface
.SH SYNOPSIS
.B pseudo-device loop
.SH DESCRIPTION
.IX  "lo device"  ""  "\fLlo\fP \(em software loopback network interface"  ""  PAGE START
.IX  "network loopback interface"  ""  "network loopback interface \(em \fLlo\fP"  ""  PAGE START
.LP
The
.B loop
device is a software loopback network interface;
see
.BR if (4N)
for a general description of network interfaces.
.LP
The
.B loop
interface is used for performance analysis and software testing, and
to provide guaranteed access to Internet protocols on machines with
no local network interfaces.
A typical application is the
.BR comsat (8C)
server which accepts notification of mail delivery through a particular
port on the loopback interface.
.LP
By default, the loopback interface is
accessible at Internet address 127.0.0.1 (non-standard); this address
may be changed with the
.SB SIOCSIFADDR
ioctl.
.SH SEE ALSO
.BR if (4N),
.BR inet (4F),
.BR comsat (8C)
.SH DIAGNOSTICS
.TP 10
.B lo%d: can't handle af%d
The interface was handed a message with
addresses formatted in an unsuitable address
family; the packet was dropped.
.SH BUGS
It should handle all address and protocol families.
An approved network address should be reserved for this
interface.
.IX  "lo device"  ""  "\fLlo\fP \(em software loopback network interface"  ""  PAGE END
.IX  "network loopback interface"  ""  "network loopback interface \(em \fLlo\fP"  ""  PAGE END
