Arquivotheca/SunOS-4.1.3/man/man4/mti.4s
.\" @(#)mti.4s 1.1 92/07/30 SMI
.TH MTI 4S "26 February 1988"
.SH NAME
mti \- Systech MTI-800/1600 multi-terminal interface
.SH "CONFIG \(em SUN-3, SUN-3x, SUN-4 SYSTEMS"
.nf
.ft B
device mti0 at vme16d16 ? csr 0x620 flags 0xffff priority 4 vector mtiintr 0x88
device mti1 at vme16d16 ? csr 0x640 flags 0xffff priority 4 vector mtiintr 0x89
device mti2 at vme16d16 ? csr 0x660 flags 0xffff priority 4 vector mtiintr 0x8a
device mti3 at vme16d16 ? csr 0x680 flags 0xffff priority 4 vector mtiintr 0x8b
.fi
.ft R
.SH SYNOPSIS
.ft B
.nf
#include <fcntl.h>
#include <sys/termios.h>
open("/dev/tty\fIxy\fB", mode);
open("/dev/ttyd\fIn\fB", mode);
open("/dev/cua\fIn\fB", mode);
.ft R
.fi
.SH DESCRIPTION
.IX  "mti device"  ""  "\fLmti\fP \(em Systech MTI-800/1600 multi-terminal interface"  ""  PAGE START
.LP
The Systech
.SM MTI
card provides 8 (\s-1MTI\s0-800) or 16 (\s-1MTI\s0-1600) serial communication
lines with modem control.
Each port supports those
.BR termio (4)
device control functions specified by flags in the
.B c_cflag
word of the
.B termios
structure and by the
.BR \s-1IGNBRK\*S ,
.BR \s-1IGNPAR\*S ,
.BR \s-1PARMRK\*S ,
or
.SB INPCK
flags in the
.B c_iflag
word of the
.B termios
structure are performed by the
.B mti
driver.  All other
.BR termio (4)
functions must be performed by
.SM STREAMS
modules pushed on top of the driver; when a device is opened, the
.BR ldterm (4M)
and
.BR ttcompat (4M)
.SM STREAMS
modules are automatically pushed on top of the stream, providing the
standard
.BR termio (4)
interface.
.LP
Bit
.I i
of
.B flags
may be specified to say that a line is not properly
connected, and that the line
.I i
should be treated as hard-wired with carrier
always present.  Thus specifying
.B "flags 0x0004"
in the specification of
.B mti0
would treat line
.B /dev/tty02
in this way.
.LP
Minor device numbers in the range 0 \- 63 correspond directly to the
normal tty lines and are named
.BI /dev/tty XY\fR,
where
.I X
is the physical board number (0 \- 3), and
.I Y
is the line number on the board as a single hexadecimal digit.
Thus the first line on the first board is
.BR /dev/tty00 ,
and the sixteenth line on the third board is
.BR /dev/tty2f .
.LP
To allow a single tty line to be connected to a modem and used for
both incoming and outgoing calls, a special feature, controlled by
the minor device number, has been added.
Minor device numbers in the range 128 \- 191 correspond to the same physical
lines as those above (that is,
the same line as the minor device number minus 128).
.LP
A dial-in line has a minor device in the range 0 \- 63 and
is conventionally renamed
.BI /dev/ttyd n\fR,
where
.I n
is a number indicating which dial-in line it is (so that
.B /dev/ttyd0
is the first dial-in line), and the dial-out line corresponding to that dial-in
line has a minor device number 128 greater than the minor device number of the
dial-in line and is conventionally named
.BI /dev/cua n\fR,
where
.I n
is the number of the dial-in line.
.LP
The
.BI /dev/cua n
lines are special in that they can be opened even when
there is no carrier on the line.
Once a
.BI /dev/cua n
line is opened, the corresponding tty line can not be
opened until the
.BI /dev/cua n
line is closed; a blocking open will wait until the
.BI /dev/cua n
line is closed (which will drop Data Terminal Ready,
after which Carrier Detect will usually drop as well)
and carrier is detected again, and a non-blocking
open will return an error.
Also, if the
.BI /dev/ttyd n
line has been opened successfully (usually only
when carrier is recognized on the modem) the corresponding
.BI /dev/cua n
line can not be opened.
This allows a modem to be attached to for example,
.B /dev/ttyd0
(renamed from
.BR /dev/tty00 )
and used for dial-in (by enabling the line for
login in
.BR /etc/ttytab )
and also used for dial-out (by
.BR tip (1C)
or
.BR uucp (1C))
as
.B /dev/cua0
when no one is logged in on
the line.
Note: the bit in the
.B flags
word in the configuration file (see above) must be zero
for this line,
which enables hardware carrier detection.
.br
.ne 7
.SH WIRING
The Systech requires the
.SM CTS
modem control signal to operate.
If the device does not supply
.SM CTS
then
.SM RTS
should be jumpered to
.SM CTS
at the distribution panel (short pins 4 to 5).
Also, the
.SM CD
(carrier detect) line does not work properly.
When connecting a modem, the modem's
.SM CD
line should be wired to
.SM DSR\s0,
which the software will treat as carrier detect.
.SH IOCTLS
The standard set of
.B termio
.B ioctl(\|)
calls are supported by
.BR mti .
.LP
The state of the
.SB CRTSCTS
flag in the
.B c_cflag
word has no effect; no output will be generated unless
.SM CTS
is high.  Breaks can be generated by the
.BR \s-1TCSBRK\s0 ,
.BR \s-1TIOCSBRK\s0 ,
and
.SB TIOCCBRK
.B ioctl(\|)
calls.
The modem control lines
.BR \s-1TIOCM_CAR\s0 ,
.BR \s-1TIOCM_CTS\s0 ,
.BR \s-1TIOCM_RTS\s0 ,
and
.SB TIOCM_DTR
are provided; however, as described above, the
.SM DSR
line is treated as
.SM CD
and the
.SM CD
line is ignored.
.LP
The input and output line speeds may be set to any of the speeds
supported by
.BR termio .
The speeds cannot be set independently; when the output speed is set,
the input speed is set to the same speed.
The baud rates
.B B200
and
.B B38400
are not supported by the hardware;
.B B200
selects 2000 baud, and
.B B38400
selects 7200 baud.
.SH ERRORS
.LP
An
.B open(\|)
will fail if:
.TP 15
.SM ENXIO
The unit being opened does not exist.
.TP 15
.SM EBUSY
The dial-out device is being opened and the dial-in device is already open, or
the dial-in device is being opened with a no-delay open and the dial-out device
is already open.
.TP 15
.SM EBUSY
The unit has been marked as exclusive-use by another process with a
.SB TIOCEXCL
.B ioctl(\|)
call.
.TP 15
.SM EINTR
The open was interrupted by the delivery of a signal.
.SH FILES
.PD 0
.TP 20
.B /dev/tty[0-3][0-9a-f]
hardwired tty lines
.TP
.B /dev/ttyd[0-9a-f]
dial-in tty lines
.TP
.B /dev/cua[0-9a-f]
dial-out tty lines
.PD
.SH "SEE ALSO"
.BR tip (1C),
.BR uucp (1C),
.BR mcp (4S),
.BR termio (4),
.BR ldterm (4M),
.BR ttcompat (4M),
.BR zs (4S),
.BR ttysoftcar (8)
.\".LP
.\"The \fIMTI-800A/1600A Multiple Terminal Interface User's Manual, Rev. D\fP,
.\"which comes with the multiplexer.
.  \"Part Number: 800-1097-01).
.SH DIAGNOSTICS
.LP
Most of these diagnostics \*(lqshould never happen\*(rq and their occurrence
usually indicates problems elsewhere in the system.
.TP
.BI mti n , " n" ": silo overflow."
More than 512 characters have been received by the
.B mti
hardware without being read by the software.
Extremely unlikely to occur.
.TP
.BI mti n ": read error code <" n ">. Probable hardware fault"
The
.B mti
returned the indicated error code.
See the
.SM MTI
manual.
.TP
.BI mti n ": \s-1DMA\s0 output error."
The
.B mti
encountered an error while trying to do
.SM DMA
output.
.TP
.BI mti n ": impossible response " n .
The
.B mti
returned an error it could not understand.
.IX  "mti device"  ""  "\fLmti \(em Systech MTI-800/1600 multi-terminal interface"  ""  PAGE END
