Arquivotheca/SunOS-4.1.3/man/man4/rfs.4
.\" @(#)rfs.4 1.1 92/07/30 SMI; new for 4.1 RFS
.TH RFS 4 "25 January 1990"
.SH NAME
rfs, RFS \- remote file sharing
.SH CONFIGURATION
.nf
.ft B
options   RFS
options   VFSSTATS
.ft
.fi
.SH AVAILABILITY
.LP
Available only with the
.I \s-1RFS\s0
software installation option.
Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX "rfs" "" "\fLrfs\fP \(em remote file sharing" ""
.LP
The
Remote File Sharing service, or
.SM RFS\s0,
allows transparent resource sharing among hosts on a network.
A 
.I resource
can be a directory,
the files contained in that directory, subdirectories,
devices, and even named pipes.
Resources are advertised as a local directory using
the name services.
Hosts can then mount these resources, and use them
as they would a local file system.
The host advertising the resource is a file server,
the hosts mounting the resource are clients.
.LP
All file servers and clients on a network belong to an
.SM RFS
.IR domain ,
and are administered by the same 
.SM RFS
name server.
A domain consists of the following:
.RS
.TP
\(bu
A primary name server
.TP
\(bu
Possibly one or more secondary name servers
.TP
\(bu
File servers
.TP
\(bu
Clients
.RE
The name server maintains a list of advertised resources,
and passwords in use.
The name server also provides
.I name-to-resource
mapping.
This allows a client to mount an advertised resource by the
resource name, without needing to know the name of the file
server or the pathname of the directory.
.SH FILES
.PD 0
.TP 20
.B /usr/nserve/rfmaster 
hosts providing domain name service
.PD
.SH "SEE ALSO"
.BR clone (4),
.BR nit_buf (4M),
.BR nit_pm (4M),
.BR tcptli (4P),
.BR timod (4),
.BR tirdwr (4),
.BR rfadmin (8),
.BR rfstart (8),
.BR rfudaemon (8),
.BR rmntstat (8)
.LP
.TX ADMIN
