Arquivotheca/SunOS-4.1.3/man/man4/taac.4s
.\" @(#)taac.4s 1.1 92/07/30 SMI;
.TH TAAC 4S "6 December 1989"
.SH NAME
taac \- Sun applications accelerator
.SH CONFIG
.B taac0 at vme32d32 ? csr 0x28000000
.SH "CONFIG \- SUN-3/SUN-4 SYSTEMS"
.ft B
.nf
device taac0 at vme32d32 1 csr 0x28000000
device taac0 at vme32d32 2 csr 0xf8000000
device taac0 at vme32d32 3 csr 0x28000000
.ft R
.fi
The first line should be used to generate a kernel for Sun-3/160,
Sun-3/260, Sun-4/260, Sun-4/370 and Sun-4/460 systems.
The second line should be used to generate a kernel for Sun-4/110
systems; and the last line should be used to generate a kernel for
Sun-4/330 systems.
.SH "CONFIG \- SUN-4/150 SYSTEMS"
.ft B
.nf
device taac0 at vme32d32 2 csr 0xf8000000
.ft R
.fi
.SH AVAILABILITY
.LP
.SM TAAC-1
can only be used in Sun
.SM VME\s0-bus
packages with 4 or more full size (9U)
slots.
.SH DESCRIPTION
.IX "taac device" "" "\fLtaac\fP device"
.LP
The 
.B taac
interface supports the optional
.SM TAAC-1
Applications Accelerator.
This add-on device is composed of a very-long-instruction-word
computation engine, coupled with an 8MB memory array.  This memory
area can be used as a frame buffer or as storage for large
data sets.
.LP
the Sun-4/150
.SM VME
address space is limited to 28 bits.
The
.SM TAAC-1
must be reconfigured to work in this package.
See
.I "Configuration Procedures fro the \s-1TAAC-1\s0 Application Accelerator Board Set."
.LP
Programs can be downloaded for execution on the 
.SM TAAC-1
directly, they can be executed by the host processor, or
the host processor and the
.SM TAAC-1
engine can be used in combination.
See the
.I
.SM TAAC-1
.I User's Guide
for detailed information on accessing the
.SM TAAC-1
from the host.  This manual also describes the C compiler,
the programming tools, and the support libraries for the
.SM TAAC-1.
.LP
Programs on the host processor gain access to the
.SM TAAC-1
registers and memory by using
.BR mmap (2).
.\".SH FILES
.\".PD 0
.\".TP
.\".B /dev/taac0
.\".TP
.\".B /usr/include/taac1
.\".TP
.\".B /usr/lib/taac1
.\".PD
.SH SEE ALSO 
.BR mmap (2)
.LP
.I "TAAC-1 Application Accelerator: User Guide"
.br
.I "Configuration Procedures for the \s-1TAAC-1\s0 Application Accelerator Board Set"
