Arquivotheca/SunOS-4.1.3/man/man4/tm.4s
.\" @(#)tm.4s 1.1 92/07/30 SMI;
.TH TM 4S "19 December 1989"
.SH NAME
tm \- Tapemaster 1/2 inch tape controller
.SH "CONFIG \(em SUN-3, SUN-3x SYSTEMS"
.ft B
.nf
controller tm0 at vme16d16 ? csr 0xa0 priority 3 vector tmintr 0x60
controller tm1 at vme16d16 ? csr 0xa2 priority 3 vector tmintr 0x61
tape mt0 at tm0 drive 0 flags 1
tape mt0 at tm1 drive 0 flags 1
.ft R
.fi
.SH DESCRIPTION
.IX  "tm device"  ""  "\fLtm\fP \(em tapemaster 1/2-inch tape drive"  ""  PAGE START
.IX  "tapemaster 1/2-inch tape drive"  ""  "tapemaster 1/2-inch tape drive \(em \fLtm\fP"  ""  PAGE START
.IX  "tape drive, 1/2-inch"  tm  ""  "\fLtm\fP \(em tapemaster"  PAGE START
.IX  "1/2-inch tape drive"  tm  ""  "\fLtm\fP \(em tapemaster"  PAGE START
.LP
The Tapemaster tape controller controls
Pertec-interface 1/2\*(rq tape drives such as the
.SM CDC
Keystone, providing
a standard tape interface to the device, see
.BR mtio (4).
This controller supports single-density or speed drives.
.LP
The
.B tm
driver supports the character device interface.
The driver returns an
.SM ENOTTY
error on unsupported ioctls.
.LP
The 
.B tm
driver does not support the backspace file to beginning
of file (MTNBSF n) command.
The equivalent positioning can be obtained by using
MTBSF (n+1) followed by MTFSF 1.
.LP
Half-inch reel tape devices do not support
the retension ioctl.
.SH FILES
.PD 0
.TP 20
.B /dev/rmt*	
rewinding
.TP
.B /dev/nrmt*	
non-rewinding
.PD
.SH SEE ALSO
.BR mt (1),
.BR tar (1),
.BR mtio (4),
.BR st(4S),
.BR xt(4S)
.SH BUGS
.LP
The Tapemaster controller does not provide for byte-swapping
and the resultant system overhead prevents streaming transports from streaming.
.LP
The system should remember which controlling terminal has the
tape drive open and write error messages to that terminal
rather than on the console.
.LP
The Tapemaster controller is not supported on Sun-4 systems.
.SH WARNINGS
.LP
The Tapemaster interface will not be supported in a future release.
The Xylogics 472 controller and
.B xt 
driver replace the Tapemaster controller and
.B tm 
driver.
.IX  "tm device"  ""  "\fLtm\fP \(em tapemaster 1/2-inch tape drive"  ""  PAGE END
.IX  "tapemaster 1/2-inch tape drive"  ""  "tapemaster 1/2-inch tape drive \(em \fLtm\fP"  ""  PAGE END
.IX  "tape drive, 1/2-inch"  tm  ""  "\fLtm\fP \(em tapemaster"  PAGE END
.IX  "1/2-inch tape drive"  tm  ""  "\fLtm\fP \(em tapemaster"  PAGE END
