Arquivotheca/SunOS-4.1.3/man/man4/xd.4s
.\" @(#)xd.4s 1.1 92/07/30 SMI;
.TH XD 4S "24 November 1987"
.SH NAME
xd \- Disk driver for Xylogics 7053 SMD Disk Controller
.SH "CONFIG \(em SUN-3, SUN-3x, SUN-4 SYSTEMS"
.ft B
.nf
controller xdc0 at vme16d32 ? csr 0xee80 priority 2 vector xdintr 0x44
controller xdc1 at vme16d32 ? csr 0xee90 priority 2 vector xdintr 0x45
controller xdc2 at vme16d32 ? csr 0xeea0 priority 2 vector xdintr 0x46
controller xdc3 at vme16d32 ? csr 0xeeb0 priority 2 vector xdintr 0x47
disk xd0 at xdc0 drive 0
disk xd1 at xdc0 drive 1
disk xd2 at xdc0 drive 2
disk xd3 at xdc0 drive 3
disk xd4 at xdc1 drive 0
disk xd5 at xdc1 drive 1
disk xd6 at xdc1 drive 2
disk xd7 at xdc1 drive 3
disk xd8 at xdc2 drive 0
disk xd9 at xdc2 drive 1
disk xd10 at xdc2 drive 2
disk xd11 at xdc2 drive 3
disk xd12 at xdc3 drive 0
disk xd13 at xdc3 drive 1
disk xd14 at xdc3 drive 2
disk xd15 at xdc3 drive 3
.fi
.ft R
.LP
The four
.B controller
lines given in the synopsis section above specify
the first, second, third, and fourth Xylogics 7053 SMD disk controller
in a Sun system.
.SH DESCRIPTION
.IX  "xd device"  ""  "\fLxd\fP \(em Xylogics SMD Disk driver"  ""  PAGE START
.IX  "Xylogics SMD Disk driver"  ""  "Xylogics SMD Disk driver \(em \fLxd\fP"  ""  PAGE START
.IX  "7053 SMD Disk driver"  ""  "7053 SMD Disk driver \(em \fLxd\fP"  ""  PAGE START
.IX  "SMD disk controller"  "Xylogics 7053"  ""  "\fLxd\fP \(em Xylogics 7053"  PAGE START
.IX  "disk driver"  "Xylogics"  ""  "\fLxd\fP \(em Xylogics"  PAGE START
.LP
Files with minor device numbers 0 through 7 refer to various portions
of drive 0; minor devices 8 through 15 refer to drive 1, and so on.
The standard device names begin with
.B xd
followed by
the drive number and then a letter a-h for partitions 0-7 respectively.
The character ? stands here for a drive number in the range 0-7.
.LP
The block files access the disk using the system's normal
buffering mechanism and may be read and written without regard to
physical disk records.  There is also a \*(lqraw\*(rq interface
which provides for direct transmission between the disk
and the user's read or write buffer.
A single read or write call usually results in only one I/O operation;
therefore raw I/O is considerably more efficient when
many words are transmitted.  The names of the raw files conventionally
begin with an extra
.BR r .
.LP
In raw I/O counts should be a multiple of 512 bytes (a disk sector).
Likewise
.BR directory (3V)
calls should specify a multiple of 512 bytes.
.LP
If
.B "flags 0x1"
is specified, the overlapped seeks feature for that drive is turned off.
Note: to be effective, the flag must be set on all drives for a
specific controller. This action is necessary for controllers with older
firmware, which have bugs preventing overlapped seeks from working properly.
.SH "DISK SUPPORT"
This driver handles all
.SM SMD
drives by reading a label from sector
0 of the drive which describes the disk geometry and partitioning.
.LP
The
.B xd?a
partition is normally used for the root file system
on a disk, the xd?b partition as a paging area,
and the
.B xd?c
partition for pack-pack copying (it normally maps
the entire disk).  The rest of the disk is normally the
.B xd?g
partition.
.SH FILES
.PD 0
.TP 20
.B /dev/xd[0-7][a-h]
block files
.TP
.B /dev/rxd[0-7][a-h]
raw files
.PD
.SH SEE ALSO
.BR lseek (2V),
.BR read (2V),
.BR write (2V),
.BR directory (3V),
.BR dkio (4S)
.SH DIAGNOSTICS
.TP
.B xdc\fIn\fP: self test error
Self test error in controller,
see the Maintenance and Reference Manual.
.TP
.B xd\fIn\fP: unable to read bad sector info
The bad sector forwarding information for the disk could not be read.
.TP
.B xd\fIn\fP: initialization failed
The drive could not be successfully initialized.
.TP
.B xd\fIn\fP: unable to read label
The drive geometry/partition table information could not be read.
.TP
.B xd\fIn\fP: Corrupt label
The geometry/partition label checksum was incorrect.
.TP
.B xd\fIn\fP: offline
A drive ready status is no longer detected, so the unit has been logically
removed from the system. If the drive ready status is restored, the unit
will automatically come back online the next time it is accessed.
.TP
.B
xd\fInc\fP: \fIcmd how \fP(\fImsg\|\fP) blk \fI#\fIn\fP \fPabs blk #\fI\fIn\fP
A command such as read or write encountered an error condition (\fIhow\fP):
either it
.IR failed ,
the controller was
.IR reset ,
the unit was
.IR restored ,
or an operation was
\fIretry\fP'ed.
The
.I msg
is derived from the error number
given by the controller, indicating a condition such as \*(lqdrive not ready\
(rq,
\*(lqsector not found\*(rq or \*(lqdisk write protected\*(rq.  The
.I blk #
is the sector
in error relative to the beginning of the partition involved.
The
.I abs blk #
is the absolute block number of the sector in error.
Some fields of the error message may be missing since the information
is not always available.
.SH BUGS
In raw I/O
.BR read (2V)
and
.BR write (2V)
truncate file offsets to 512-byte block boundaries, and
.BR write (2V)
scribbles on the tail of incomplete blocks.
Thus, in programs that are likely to access raw devices,
.BR read (2V),
.BR write (2V)
and
.BR lseek (2V)
should always deal in 512-byte multiples.
.LP
Older revisions of the firmware do not properly support overlapped seeks.
This will only affect systems with multiple disks on a single controller.
If a large number of \*(lqzero sector count\*(rq errors appear, you should use the
.B flags
field to disable overlapped seeks.
.IX  "xd device"  ""  "\fLxd\fP \(em Xylogics SMD Disk driver"  ""  PAGE END
.IX  "Xylogics SMD Disk driver"  ""  "Xylogics SMD Disk driver \(em \fLxd\fP"  ""  PAGE END
.IX  "7053 SMD Disk driver"  ""  "7053 SMD Disk driver \(em \fLxd\fP"  ""  PAGE END
.IX  "SMD disk controller"  "Xylogics 7053"  ""  "\fLxd\fP \(em Xylogics 7053"  PAGE END
.IX  "disk driver"  "Xylogics"  ""  "\fLxd\fP \(em Xylogics"  PAGE END
