Arquivotheca/SunOS-4.1.3/man/arch/implog.8c
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\" @(#)implog.8c 1.1 92/07/30 SMI; from UCB 4.3 BSD 6.2
.\"
.TH IMPLOG 8C "May 5, 1986"
.UC 5
.SH NAME
implog \- IMP log interpreter
.SH SYNOPSIS
.B /etc/implog
[
.B \-D
] [
.B \-f
] [
.B \-c
] [
.B \-r
] [
.B \-l
[
.I link
] ] [
.B \-h
.I host-number
] [
.B \-i
.I imp-number
] [
.B \-t
.I message-type
]
.SH DESCRIPTION
.B implog
interprets the message log produced by
.IR implogd (8C).
.PP
If no arguments are specified, 
.B implog
interprets and prints every message present in the message
file.  Options may be specified to force printing only a
subset of the logged messages.
.TP
.B \-D
Do not show data messages. 
.TP
.B \-f
Follow (monitor) the logging process.
First print the current contents of the log file, then
check for newly logged messages every 5 seconds. 
.TP
.B \-c
In addition to printing any data messages logged, show the
contents of the data in hexadecimal bytes.
.TP
.B \-r
Print the raw
.SM IMP
leader, showing all fields, in addition to the formatted interpretation,
according to type.
.HP
.B \-l
.RI [ " link-number " ]
.br
Show only those messages received on the specified
.IR link-number .  If
.I link-number
is omitted, the link number of the IP protocol is assumed.
.TP
.BI \-h " host-number"
Show only those messages received from the specified
.IR host-number .
(Usually specified in conjunction with an
.SM IMP\s0.)
.TP
.BI \-i " imp-number"
Show only those messages received from the specified
.IR imp-number .
.TP
.BR \-t " message-type"
Show only those messages received of the specified message type.
.SH "SEE ALSO"
implogd(8C)
.SH BUGS
You cannot specify multiple hosts, 
.SM IMP\s0s,
etc.
You cannot follow the reception of messages without looking at
those already in the file.
