Arquivotheca/SunOS-4.1.3/man/arch/newsrc.5
.\" @(#)newsrc.5 1.1 92/07/30 SMI
.TH NEWSRC 5 "6 January 1984"
.SH NAME
newsrc \- information file for readnews and checknews
.SH DESCRIPTION
.IX  "readnews information file"  ""  "readnews information file \(em \fL.newsrc\fP"
.IX  "checknews information file"  ""  "checknews information file \(em \fL.newsrc\fP"
The
.BI . newsrc
file contains the list of previously read articles and an optional
options line for
.IR readnews (1)
and
.IR checknews (1).
Each newsgroup that articles
have been read from has a line of the form:
.sp .5
	\fInewsgroup\fP\|: range
.sp .5
.I Range
is a list of the articles read.  It is basically a list of numbers
separated by commas with sequential numbers collapsed with hyphens.
For instance:
.RS
.nf
.B general: 1-78,80,85-90
.br
.B fa.info-cpm: 1-7
.br
.B net.news: 1
.br
.B fa.info-vax! 1-5
.fi
.RE
.LP
If the : is replaced with an ! (as in info-vax above) the newsgroup
is not subscribed to and is not be shown to the user.
.LP
An options line starts with the word
.B options
(left-justified).  Then there are the list of options just as they
would be on the command line.  For instance:
.RS
.nf
.B "options \-n all !fa.sf-lovers !fa.human-nets \-r"
.br
.B "options \-c \-r"
.fi
.RE
.LP
A string of lines beginning with a space or tab after the initial options
line are considered continuation lines.
.SH FILES
.TP 25
~/.newsrc
options and list of previously read articles
.SH SEE ALSO
readnews(1),
checknews(1)
