Arquivotheca/SunOS-4.1.3/man/arch/old-sysdiag.8
.\" @(#)old-sysdiag.8 1.1 92/07/30 SMI;
.TH OLD-SYSDIAG 1 "21 December 1987"
.SH NAME
old-sysdiag, sysdiag \- system diagnostics
.SH SYNOPSIS
.B /usr/old/sysdiag/sysdiag
.SH AVAILABILITY
This program is available with the
.I User Diagnostics
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "sysdiag command"  ""  "\fLsysdiag\fP \(em system diagnostics"
.IX  "diagnostics sysdiag"   ""   "diagnostics \(em \fLsysdiag\fP"
.IX  "memory diagnostics sysdiag"   ""   "memory diagnostics \(em \fLsysdiag\fP"
.IX  "peripheral diagnostics sysdiag"   ""   "peripheral diagnostics \(em \fLsysdiag\fP"
.IX  disk "diagnostics \(em \fLsysdiag\fP"
.LP
.B sysdiag
is a general-purpose system diagnostic facility that
tests
the system and reports its findings.  It concentrates on three
areas of system functionality; memory, peripherals and disk.
.LP
To use
.BR sysdiag ,
log on as
.BR sysdiag ,
then enter the command
.BR sysdiag .
.LP
.B sysdiag
creates a
.BR sunview (1)
environment with one window each for memory,
peripherals, and disk error messages, plus a window for the console.
It also creates date/time and performance monitor graphs.
It places abbreviated error messages from the memory, disk, and
peripherals in the appropriate windows,
and sends console messages to the
console window.
.LP
When called from a terminal
.B sysdiag
interleaves
all its messages on the screen.
.LP
With or without the windows, it places
long error messages in files named
.BI log. xx.nn
where:
.RS
.TP
.I xx
is the name of diagnostic
.TP
.I nn
is the pass number (increments each pass)
.RE
.LP
After it completes its test,
.B sysdiag
displays the error log files
by executing the command
.RB ` "more\ log*" '.
These files remain after
.B sysdiag
exits.
.LP
.B sysdiag
consists of a user account with a home directory, a
collection of scripts, and executable files containing the actual
test code.
.LP
To configure or change
.BR sysdiag ,
either change the shell commands in
.BR /usr/diag/sysdiag/sysdiag ,
or change the
.B sysdiag
user configuration files
.BR .login ,
.BR .sunview ,
and
.BR .cshrc .
.SH FILES
.PD 0
.TP 20
.B .login
.TP
.B .sunview
.TP
.B .cshrc
.PD
.SH SEE ALSO
.BR sunview (1)
See the appropriate diagnostic manual for your Sun system.
