Arquivotheca/SunOS-4.1.3/man/arch/sendnews.8
.\" @(#)sendnews.8 1.1 92/07/30 SMI
.TH SENDNEWS 8 "6 January 1984"
.SH NAME
sendnews \- send news articles via mail
.SH SYNOPSIS
sendnews
[
.B \-o
]
[
.B \-a
]
[
.B \-b
]
[
.B \-n
newsgroups
]
destination
.SH DESCRIPTION
.IX  "sendnews command"  ""  "\fLsendnews\fP \(em news delivery"
.IX  "news delivery"  ""  "news delivery \(em \fLsendnews\fP"
.I sendnews
reads an article from it's standard input, performs a set of changes
to it, and gives it to the mail program to mail it to
.IR destination .
.LP
An `N' is prepended to each line for decoding by
.IR uurec (1).
.SH OPTIONS
.TP
.B \-o
handle old format articles.
.TP
.B \-a
used for sending articles via the
.SM ARPANET.
It maps the article's path from
.IB uucphost ! xxx
to
.IB xxx @ arpahost.
.TP
.B \-b
used for sending articles via the
.BR Berknet .
It maps the article's path from
.IB uucphost ! xxx
to
.IB berkhost : xxx.
.TP
.B \-n
change the article's newsgroup to the specified
.IR newsgroup .
.SH SEE ALSO
inews(1),
uurec(8),
recnews(8),
readnews(1),
checknews(1)
