Arquivotheca/SunOS-4.1.3/man/arch/setup.8s
.\" @(#)setup.8s 1.1 92/07/30 SMI; 
.TH SETUP 8S "13 January 1987"
.SH NAME
setup \- Sun UNIX installation program
.SH SYNOPSIS
.B setup
.SH DESCRIPTION
.IX setup "" "\fLsetup\fR \(em Sun \s-1UNIX\s0 installation program\fR
.LP
.I setup
is the program supplied by Sun to install major Sun Unix releases such
as 2.0 or 3.0.
.I setup
allows a system administrator to install major Sun Unix release on new
hardware, upgrade between major releases, and add additional hardware
to existing machines.
.LP
.I setup
provide both a tty interface for cursor addressable terminals and
a SunWindows system interface for use on bit mapped displays.
The 
.I "Setup Reference Manual" 
contains a detailed description of the use of 
.I setup.
.LP
Initially, 
.I setup 
asks the following questions in a menu format before entering the 
tty or SunWindows interface. For all menus respond to the 
.B ">>" 
prompt with the corresponding number of the menu item you choose.
.LP
The first question asked is the mode of use of
.I setup.
.RS
.ft L
'nf
Are you running setup:
	1) to install on a new system
	2) re-entrantly
	3) to upgrade an existing system
	4) in demonstration mode
>> 
.ft R
.fi
.RE
The next question is to determine the type of interface to be used.
Note that the cursor addressable interface can be used within a
.IR shelltool (1)
under SunWindows.
.RS
'nf
.ft L
Will you be running setup from:
	1) a Sun bit mapped display device
	2) a cursor addressable terminal
>> 
.ft R
.fi
.RE
If you have selected the tty interface for cursor addressable terminals,
.I setup
asks for the terminal type.
.if n .bp
.RS
'nf
.ft L
Select your terminal type:
	1) Televideo 925
	2) Wyse Model 50
	3) Sun Workstation
	4) Other
>> 
.ft R
.fi
.RE
If you select "Other", the name of the terminal must correspond to a name
in the 
.IR termcap (5) 
database.
.RS
'nf
.ft L
Enter the terminal type (your terminal type must be in /etc/termcap): 
>>
.ft R
.fi
.RE
.I setup
begins running the interface for the terminal-type you have selected.
.SH FILES
.nf
.ft I
/etc/hosts
/etc/nd.local
/etc/ethers
/etc/rc.local
/etc/rc.boot
/etc/setup.info
/etc/sendmail.cf
.IX "files used by programs" "\fL/setup.info\fR \(em \fLsetup\fR information"
.fi
.ft R
.SH BUGS
.I setup
will not run on tty devices that do not support cursor addressing and 
are not registered in the 
.IR termcap (5) 
data base.
