Arquivotheca/SunOS-4.1.3/man/arch/skyversion.8
.\" @(#)skyversion.8 1.1 92/07/30 SMI;
.TH SKYVERSION 8 "9 September 1987"
.SH NAME
skyversion \- print the SKYFFP board microcode version number
.SH SYNOPSIS
.B /usr/etc/skyversion
.SH DESCRIPTION
.IX  "skyversion command"  ""  "\fLskyversion\fP \(em display SKY version"
.B skyversion
obtains from the
.SM SKYFFP
board the Sky version number of the microcode
currently loaded and prints the result on the standard output.
.SH DIAGNOSTICS
The Sky version number operation code
used to implement this command is not
available for microcode releases earlier
than Sky release 3.00. The result
in this case is unpredictable and is either
a nonmeaningful version number
or a message indicating that no version
number is available.
.LP
Meaningful version numbers are of the form
.IB n . dd
where
.I n
\(>= 3.
