Arquivotheca/SunOS-4.1.3/man/arch/sys-config.8
.\" @(#)sys-config.8 1.1 92/07/30 SMI; new for SPARCstation 1
.TH SYS-CONFIG 8 "13 January 1990"
.SH NAME
sys-config \- configure a system or administer configuration information
.SH SYNOPSIS
.B /usr/etc/install/sys-config
.SH DESCRIPTION
.IX "sys-config configure" "" "\fLsys-config\fP \(em configure a system" ""
.IX configure "administer configuration information"
.IX configure "a system"
.IX administer "configuration information"
.LP
.B sys-config
\*(lqunpacks\*(rq a machine and sets up its configuration.
.B sys-config
automatically runs when a pre-installed system is booted
for the first time.
It should not be run by hand.
Instead, run 
.BR sys-unconfig (8)
to return the system to its pre-installed state.
Then, reboot system,
which will run
.B sys-config
automatically.
.LP
A system's configuration consists of hostname,
Network Information Service
(\s-1NIS\s0)
domain name,
timezone and
.SM IP
address.
.LP
.B sys-config
does the following:
.RS
.TP 3
\(bu
Edits the
.B /etc/hosts
with the correct hostname and
.SM IP
address.
.TP
\(bu
Sets the hostname in
.BR /etc/rc.boot .
.TP
\(bu
Sets the domainname in
.BR /etc/rc.single .
.TP
\(bu
Sets the
.B /usr/lib/zoneinfo/localtime
file.
.TP
\(bu
Enables the
Network Information Service
(\s-1NIS\s0)
if the
.SM NIS
service was requested.
.RE
.LP
When
.B sys-config
is finished, it prompts for a system reboot.
.LP
The default answer to any particular 
question is the current value of that configuration parameter.
Parameters that have not changed can be quickly skipped over to
get to the one that should be changed by typing a
.SM RETURN\s0.
.LP
.B sys-config
is potentially a dangerous utility and can be run only by the
super-user.
.SH FILES
.PD 0
.TP 20
.B /etc/hosts
.TP
.B /usr/lib/zoneinfo/localtime
.TP
.B /usr/etc/install/sys_info
.PD
.SH SEE ALSO
.BR sys-unconfig (8)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
