Arquivotheca/SunOS-4.1.3/man/arch/ypwhich.8
.\" @(#)ypwhich.8 1.1 92/07/30 SMI
.TH YPWHICH 8 "17 December 1987"
.SH NAME
ypwhich \- return NIS server
.SH SYNOPSIS
.B ypwhich
.RB [ " \-d "
.IR domainname " ] "
.RI [ " hostname " ]
.LP
.B ypwhich
.RB [ " \-d "
.IR domainname " ] "
.RB [ " \-t " ]
.B \-m
.RI [ " mname " ]
.SH AVAILABILITY
.LP
This program is available with the
.I Networking Tools and Programs
software installation option.  Refer to
.TX INSTALL
for information on how to install optional software.
.SH DESCRIPTION
.IX  "ypwhich command"  ""  "\fLypwhich\fP \(em return NIS server"
.LP
.B ypwhich
tells which
Network Interface Service
(\s-1NIS\s0)
server supplies the
.SM NIS
service to an
.SM NIS
client, and which
.SM NIS
server is the master for a map.
If invoked without arguments, it gives the
.SM NIS
server for the local machine.  If
.I hostname
is specified, that machine is queried
to find out which
.SM NIS
master it is using.
.LP
If the
.B \-m
switch is used without
.IR mname ,
a list of every map
in the domain and the master of each will be printed.  If
.I mname
is specified, only the master
.SM NIS
server for that map is printed.
.I mname
may be a mapname, or a nickname for a mapname.
Mapnames and nicknames are described in
.BR ypcat (1).
.SH OPTIONS
.TP
.BI \-d " domainname"
specifies the name of an
.SM NIS
domain.
The default is the default domain for the local machine.
.TP
.B \-m
Find the master
.SM NIS
server for a map,
or for all maps in a domain.  No
.I hostname
may be specified with
.BR \-m .
.TP
.B \-t
Inhibit nickname translation;
useful if there is a mapname identical to a nickname.
This is not true of any Sun-supplied map.
.SH "SEE ALSO"
.BR ypcat (1),
.BR ypfiles (5),
.BR rpcinfo (8C),
.BR yppush (8),
.BR ypserv (8)
.SH NOTES
.LP
The Network Information Service
(\s-1NIS\s0)
was formerly known as Sun Yellow Pages
(\s-1YP\s0). 
The functionality of the two remains the same;
only the name has changed.
The name Yellow Pages is a registered trademark in the United Kingdom
of British Telecommunications plc,
and may not be used without permission.
