Arquivotheca/SunOS-4.1.3/man/man1/lpstat.1
.\" @(#)lpstat.1 1.1 92/07/30 SMI; from SVID
.TH LPSTAT 1 "21 June 1988"
.SH NAME
lpstat \- display the printer status information
.SH SYNOPSIS
.B lpstat
[
.B \-d
]
[
.B \-r
]
[
.B \-s
]
[
.B \-t
]
[
.B \-a
[
.I list
]\|]
[
.B \-c
[
.I list
]\|]
.if n .ti 5
[
.B \-o
[
.I list
]\|]
[
.B \-p
[
.I list
]\|]
.if n .ti 5
[
.B \-u
[
.I list
]\|]
.if t .ti +.5i
[
.B \-v
[
.I list
]\|]
.SH DESCRIPTION
.IX "lpstat print" "" "\fLlpstat\fP\(emprint the printer status information"
.IX "printer" "display status information"
.LP
.B lpstat
prints information about the current status
of the printer spooling system.
.LP
If no
.I options
are given, then
.B lpstat
prints the status of all requests made to
.BR lp (1)
by the user.
When the destination printer is not explicitly
specified, the value of the
.SB LPDEST
environment variable is used by default.
If
.SB LPDEST
is not defined, then the value of the
.SB PRINTER
environment variable is used.
If
.SB PRINTER
is not defined either, then the system default
printer is used.
Any arguments that are not options
are assumed to be request
.I ids
(as returned by
.BR lp ).
.B lpstat
prints the status of such requests.
.SH OPTIONS
.LP
The options below may appear in any order and may be repeated and
intermixed with other arguments.
Some of the options below may be followed by an optional
.I list
that can be in one of two forms:
a list of items separated from one another by a comma,
or a list of items enclosed in double quotes
and separated from one another by a comma and/or
one or more
.SM SPACE
characters.
For example:
.LP
.RS
.ft B
\-u"user1, user2, user3"
.ft R
.RE
.LP
The omission of a
.I list
following such options prints all information
relevant to the option, for example:
.LP
.RS
.B lpstat\ \-o
.RE
.LP
prints the status of all output requests.
.TP 10
.B \-d
Print the system default destination for
output requests.
.TP
.B \-r
Print the status of
the printer request scheduler
.TP
.B \-s
Print a status summary, including
the status of the line printer scheduler,
the system default destination, a list of class names
and their members, and a list of printers
and their associated devices.
.TP
.B \-t
Print all status information.
.TP
.BR \-a [\|\fIlist\fP\|]
Print acceptance status of destinations for output
requests.
.I list
is a list of intermixed printer names.
.TP
.BR \-c [\|\fIlist\fP\|]
Print class names and their members.
.I list
is a list of class names. 
.TP
.BR \-o [\|\fIlist\fP\|]
Print the status of output requests.
.I list
is a list of intermixed printer names, class names,
and request
.IR ids .
.TP
.BR \-p [\|\fIlist\fP\|]
Print the status of printers.
.I list
is a list of printer names.
.TP
.BR \-u [\|\fIlist\fP\|]
Print status of output requests for users on the default printer.
.I list
is a list of login names.
.TP
.BR \-v [\|\fIlist\fP\|]
Print the names of printers
and the path names of the devices
associated with them.
.I list
is a list of printer names.
.SH FILES
.PD 0
.TP 20
.B /usr/spool/lp
.PD
.SH SEE ALSO
.BR lp (1),
.BR lpr (1),
.BR lprm (1),
.BR lpc (8),
.BR lpd (8)
